zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef HAL_NXP_DTS_NXP_S32_S32K396_289BGA_PINCTRL_H_
#define HAL_NXP_DTS_NXP_S32_S32K396_289BGA_PINCTRL_H_

#include <zephyr/dt-bindings/pinctrl/nxp-siul2-pinctrl.h>

/* SIUL */
#define PTA0_EIRQ0                              NXP_SIUL2_PINMUX(0, 0, 0, 0, 16, 1)
#define PTA1_EIRQ1                              NXP_SIUL2_PINMUX(0, 0, 1, 0, 17, 1)
#define PTA2_EIRQ2                              NXP_SIUL2_PINMUX(0, 0, 2, 0, 18, 1)
#define PTA3_EIRQ3                              NXP_SIUL2_PINMUX(0, 0, 3, 0, 19, 1)
#define PTA4_EIRQ4                              NXP_SIUL2_PINMUX(0, 0, 4, 0, 20, 1)
#define PTA5_EIRQ5                              NXP_SIUL2_PINMUX(0, 0, 5, 0, 21, 1)
#define PTA6_EIRQ6                              NXP_SIUL2_PINMUX(0, 0, 6, 0, 22, 1)
#define PTA7_EIRQ7                              NXP_SIUL2_PINMUX(0, 0, 7, 0, 23, 1)
#define PTA8_EIRQ16                             NXP_SIUL2_PINMUX(0, 0, 8, 0, 32, 1)
#define PTA9_EIRQ17                             NXP_SIUL2_PINMUX(0, 0, 9, 0, 33, 1)
#define PTA10_EIRQ18                            NXP_SIUL2_PINMUX(0, 0, 10, 0, 34, 1)
#define PTA14_EIRQ22                            NXP_SIUL2_PINMUX(0, 0, 14, 0, 38, 1)
#define PTA15_EIRQ23                            NXP_SIUL2_PINMUX(0, 0, 15, 0, 39, 1)
#define PTA16_EIRQ4                             NXP_SIUL2_PINMUX(0, 0, 16, 0, 20, 2)
#define PTA18_EIRQ0                             NXP_SIUL2_PINMUX(0, 0, 18, 0, 16, 2)
#define PTA19_EIRQ1                             NXP_SIUL2_PINMUX(0, 0, 19, 0, 17, 2)
#define PTA20_EIRQ2                             NXP_SIUL2_PINMUX(0, 0, 20, 0, 18, 2)
#define PTA21_EIRQ3                             NXP_SIUL2_PINMUX(0, 0, 21, 0, 19, 2)
#define PTA25_EIRQ5                             NXP_SIUL2_PINMUX(0, 0, 25, 0, 21, 2)
#define PTA30_EIRQ7                             NXP_SIUL2_PINMUX(0, 0, 30, 0, 23, 2)
#define PTB0_EIRQ8                              NXP_SIUL2_PINMUX(0, 0, 32, 0, 24, 1)
#define PTB1_EIRQ9                              NXP_SIUL2_PINMUX(0, 0, 33, 0, 25, 1)
#define PTB2_EIRQ10                             NXP_SIUL2_PINMUX(0, 0, 34, 0, 26, 1)
#define PTB3_EIRQ11                             NXP_SIUL2_PINMUX(0, 0, 35, 0, 27, 1)
#define PTB4_EIRQ12                             NXP_SIUL2_PINMUX(0, 0, 36, 0, 28, 1)
#define PTB5_EIRQ13                             NXP_SIUL2_PINMUX(0, 0, 37, 0, 29, 1)
#define PTB8_EIRQ14                             NXP_SIUL2_PINMUX(0, 0, 40, 0, 30, 1)
#define PTB9_EIRQ15                             NXP_SIUL2_PINMUX(0, 0, 41, 0, 31, 1)
#define PTB10_EIRQ24                            NXP_SIUL2_PINMUX(0, 0, 42, 0, 40, 1)
#define PTB11_EIRQ25                            NXP_SIUL2_PINMUX(0, 0, 43, 0, 41, 1)
#define PTB12_EIRQ26                            NXP_SIUL2_PINMUX(0, 0, 44, 0, 42, 1)
#define PTB13_EIRQ27                            NXP_SIUL2_PINMUX(0, 0, 45, 0, 43, 1)
#define PTB14_EIRQ28                            NXP_SIUL2_PINMUX(0, 0, 46, 0, 44, 1)
#define PTB15_EIRQ29                            NXP_SIUL2_PINMUX(0, 0, 47, 0, 45, 1)
#define PTB16_EIRQ30                            NXP_SIUL2_PINMUX(0, 0, 48, 0, 46, 1)
#define PTB17_EIRQ31                            NXP_SIUL2_PINMUX(0, 0, 49, 0, 47, 1)
#define PTB21_EIRQ8                             NXP_SIUL2_PINMUX(0, 0, 53, 0, 24, 2)
#define PTB22_EIRQ9                             NXP_SIUL2_PINMUX(0, 0, 54, 0, 25, 2)
#define PTB23_EIRQ10                            NXP_SIUL2_PINMUX(0, 0, 55, 0, 26, 2)
#define PTB24_EIRQ11                            NXP_SIUL2_PINMUX(0, 0, 56, 0, 27, 2)
#define PTB25_EIRQ12                            NXP_SIUL2_PINMUX(0, 0, 57, 0, 28, 2)
#define PTB26_EIRQ13                            NXP_SIUL2_PINMUX(0, 0, 58, 0, 29, 2)
#define PTB28_EIRQ14                            NXP_SIUL2_PINMUX(0, 0, 60, 0, 30, 2)
#define PTC0_EIRQ0                              NXP_SIUL2_PINMUX(0, 0, 64, 0, 16, 3)
#define PTC1_EIRQ1                              NXP_SIUL2_PINMUX(0, 0, 65, 0, 17, 3)
#define PTC2_EIRQ2                              NXP_SIUL2_PINMUX(0, 0, 66, 0, 18, 3)
#define PTC3_EIRQ3                              NXP_SIUL2_PINMUX(0, 0, 67, 0, 19, 3)
#define PTC4_EIRQ4                              NXP_SIUL2_PINMUX(0, 0, 68, 0, 20, 3)
#define PTC5_EIRQ5                              NXP_SIUL2_PINMUX(0, 0, 69, 0, 21, 3)
#define PTC6_EIRQ6                              NXP_SIUL2_PINMUX(0, 0, 70, 0, 22, 3)
#define PTC7_EIRQ7                              NXP_SIUL2_PINMUX(0, 0, 71, 0, 23, 3)
#define PTC8_EIRQ16                             NXP_SIUL2_PINMUX(0, 0, 72, 0, 32, 2)
#define PTC9_EIRQ17                             NXP_SIUL2_PINMUX(0, 0, 73, 0, 33, 2)
#define PTC10_EIRQ18                            NXP_SIUL2_PINMUX(0, 0, 74, 0, 34, 2)
#define PTC11_EIRQ19                            NXP_SIUL2_PINMUX(0, 0, 75, 0, 35, 2)
#define PTC12_EIRQ20                            NXP_SIUL2_PINMUX(0, 0, 76, 0, 36, 2)
#define PTC13_EIRQ21                            NXP_SIUL2_PINMUX(0, 0, 77, 0, 37, 2)
#define PTC14_EIRQ22                            NXP_SIUL2_PINMUX(0, 0, 78, 0, 38, 2)
#define PTC15_EIRQ23                            NXP_SIUL2_PINMUX(0, 0, 79, 0, 39, 2)
#define PTC20_EIRQ16                            NXP_SIUL2_PINMUX(0, 0, 84, 0, 32, 3)
#define PTC21_EIRQ17                            NXP_SIUL2_PINMUX(0, 0, 85, 0, 33, 3)
#define PTC23_EIRQ18                            NXP_SIUL2_PINMUX(0, 0, 87, 0, 34, 3)
#define PTC24_EIRQ19                            NXP_SIUL2_PINMUX(0, 0, 88, 0, 35, 3)
#define PTC25_EIRQ20                            NXP_SIUL2_PINMUX(0, 0, 89, 0, 36, 3)
#define PTC26_EIRQ21                            NXP_SIUL2_PINMUX(0, 0, 90, 0, 37, 3)
#define PTC27_EIRQ22                            NXP_SIUL2_PINMUX(0, 0, 91, 0, 38, 3)
#define PTC29_EIRQ23                            NXP_SIUL2_PINMUX(0, 0, 93, 0, 39, 3)
#define PTD0_EIRQ8                              NXP_SIUL2_PINMUX(0, 0, 96, 0, 24, 3)
#define PTD1_EIRQ9                              NXP_SIUL2_PINMUX(0, 0, 97, 0, 25, 3)
#define PTD2_EIRQ10                             NXP_SIUL2_PINMUX(0, 0, 98, 0, 26, 3)
#define PTD3_EIRQ11                             NXP_SIUL2_PINMUX(0, 0, 99, 0, 27, 3)
#define PTD4_EIRQ12                             NXP_SIUL2_PINMUX(0, 0, 100, 0, 28, 3)
#define PTD5_EIRQ13                             NXP_SIUL2_PINMUX(0, 0, 101, 0, 29, 3)
#define PTD6_EIRQ14                             NXP_SIUL2_PINMUX(0, 0, 102, 0, 30, 3)
#define PTD7_EIRQ15                             NXP_SIUL2_PINMUX(0, 0, 103, 0, 31, 3)
#define PTD8_EIRQ24                             NXP_SIUL2_PINMUX(0, 0, 104, 0, 40, 2)
#define PTD9_EIRQ25                             NXP_SIUL2_PINMUX(0, 0, 105, 0, 41, 2)
#define PTD10_EIRQ26                            NXP_SIUL2_PINMUX(0, 0, 106, 0, 42, 2)
#define PTD11_EIRQ27                            NXP_SIUL2_PINMUX(0, 0, 107, 0, 43, 2)
#define PTD12_EIRQ28                            NXP_SIUL2_PINMUX(0, 0, 108, 0, 44, 2)
#define PTD13_EIRQ29                            NXP_SIUL2_PINMUX(0, 0, 109, 0, 45, 2)
#define PTD14_EIRQ30                            NXP_SIUL2_PINMUX(0, 0, 110, 0, 46, 3)
#define PTD15_EIRQ31                            NXP_SIUL2_PINMUX(0, 0, 111, 0, 47, 2)
#define PTD17_EIRQ24                            NXP_SIUL2_PINMUX(0, 0, 113, 0, 40, 3)
#define PTD20_EIRQ25                            NXP_SIUL2_PINMUX(0, 0, 116, 0, 41, 3)
#define PTD21_EIRQ26                            NXP_SIUL2_PINMUX(0, 0, 117, 0, 42, 3)
#define PTD22_EIRQ27                            NXP_SIUL2_PINMUX(0, 0, 118, 0, 43, 3)
#define PTD23_EIRQ28                            NXP_SIUL2_PINMUX(0, 0, 119, 0, 44, 3)
#define PTD24_EIRQ29                            NXP_SIUL2_PINMUX(0, 0, 120, 0, 45, 3)
#define PTD27_EIRQ30                            NXP_SIUL2_PINMUX(0, 0, 123, 0, 46, 2)
#define PTD28_EIRQ31                            NXP_SIUL2_PINMUX(0, 0, 124, 0, 47, 3)
#define PTE0_EIRQ0                              NXP_SIUL2_PINMUX(0, 0, 128, 0, 16, 4)
#define PTE1_EIRQ1                              NXP_SIUL2_PINMUX(0, 0, 129, 0, 17, 4)
#define PTE2_EIRQ2                              NXP_SIUL2_PINMUX(0, 0, 130, 0, 18, 4)
#define PTE4_EIRQ4                              NXP_SIUL2_PINMUX(0, 0, 132, 0, 20, 4)
#define PTE5_EIRQ5                              NXP_SIUL2_PINMUX(0, 0, 133, 0, 21, 4)
#define PTE6_EIRQ6                              NXP_SIUL2_PINMUX(0, 0, 134, 0, 22, 4)
#define PTE8_EIRQ7                              NXP_SIUL2_PINMUX(0, 0, 136, 0, 23, 4)
#define PTE9_EIRQ8                              NXP_SIUL2_PINMUX(0, 0, 137, 0, 24, 4)
#define PTE10_EIRQ9                             NXP_SIUL2_PINMUX(0, 0, 138, 0, 25, 4)
#define PTE11_EIRQ10                            NXP_SIUL2_PINMUX(0, 0, 139, 0, 26, 4)
#define PTE14_EIRQ13                            NXP_SIUL2_PINMUX(0, 0, 142, 0, 29, 4)
#define PTE15_EIRQ14                            NXP_SIUL2_PINMUX(0, 0, 143, 0, 30, 4)
#define PTE16_EIRQ15                            NXP_SIUL2_PINMUX(0, 0, 144, 0, 31, 4)
#define PTF0_EIRQ0                              NXP_SIUL2_PINMUX(0, 0, 160, 0, 16, 5)
#define PTF1_EIRQ1                              NXP_SIUL2_PINMUX(0, 0, 161, 0, 17, 5)
#define PTF2_EIRQ2                              NXP_SIUL2_PINMUX(0, 0, 162, 0, 18, 5)
#define PTF3_EIRQ3                              NXP_SIUL2_PINMUX(0, 0, 163, 0, 19, 5)
#define PTF4_EIRQ4                              NXP_SIUL2_PINMUX(0, 0, 164, 0, 20, 5)
#define PTF5_EIRQ5                              NXP_SIUL2_PINMUX(0, 0, 165, 0, 21, 5)
#define PTF6_EIRQ6                              NXP_SIUL2_PINMUX(0, 0, 166, 0, 22, 5)
#define PTF7_EIRQ7                              NXP_SIUL2_PINMUX(0, 0, 167, 0, 23, 5)
#define PTF8_EIRQ16                             NXP_SIUL2_PINMUX(0, 0, 168, 0, 32, 4)
#define PTF9_EIRQ17                             NXP_SIUL2_PINMUX(0, 0, 169, 0, 33, 4)
#define PTF10_EIRQ18                            NXP_SIUL2_PINMUX(0, 0, 170, 0, 34, 4)
#define PTF11_EIRQ19                            NXP_SIUL2_PINMUX(0, 0, 171, 0, 35, 4)
#define PTF12_EIRQ20                            NXP_SIUL2_PINMUX(0, 0, 172, 0, 36, 4)
#define PTF13_EIRQ21                            NXP_SIUL2_PINMUX(0, 0, 173, 0, 37, 4)
#define PTF14_EIRQ22                            NXP_SIUL2_PINMUX(0, 0, 174, 0, 38, 4)
#define PTF15_EIRQ23                            NXP_SIUL2_PINMUX(0, 0, 175, 0, 39, 4)
#define PTG0_EIRQ8                              NXP_SIUL2_PINMUX(0, 0, 192, 0, 24, 5)
#define PTG1_EIRQ9                              NXP_SIUL2_PINMUX(0, 0, 193, 0, 25, 5)
#define PTG2_EIRQ10                             NXP_SIUL2_PINMUX(0, 0, 194, 0, 26, 5)
#define PTG3_EIRQ11                             NXP_SIUL2_PINMUX(0, 0, 195, 0, 27, 5)
#define PTG4_EIRQ12                             NXP_SIUL2_PINMUX(0, 0, 196, 0, 28, 5)
#define PTG5_EIRQ13                             NXP_SIUL2_PINMUX(0, 0, 197, 0, 29, 5)
#define PTG6_EIRQ14                             NXP_SIUL2_PINMUX(0, 0, 198, 0, 30, 5)
#define PTG7_EIRQ15                             NXP_SIUL2_PINMUX(0, 0, 199, 0, 31, 5)
#define PTG8_EIRQ24                             NXP_SIUL2_PINMUX(0, 0, 200, 0, 40, 4)
#define PTG9_EIRQ25                             NXP_SIUL2_PINMUX(0, 0, 201, 0, 41, 4)
#define PTG10_EIRQ26                            NXP_SIUL2_PINMUX(0, 0, 202, 0, 42, 4)
#define PTG11_EIRQ27                            NXP_SIUL2_PINMUX(0, 0, 203, 0, 43, 4)
#define PTG12_EIRQ28                            NXP_SIUL2_PINMUX(0, 0, 204, 0, 44, 4)
#define PTG13_EIRQ29                            NXP_SIUL2_PINMUX(0, 0, 205, 0, 45, 4)
#define PTG14_EIRQ30                            NXP_SIUL2_PINMUX(0, 0, 206, 0, 46, 4)
#define PTG15_EIRQ31                            NXP_SIUL2_PINMUX(0, 0, 207, 0, 47, 4)
#define PTH7_EIRQ23_I                           NXP_SIUL2_PINMUX(0, 0, 231, 0, 39, 5)
#define PTH8_EIRQ24_I                           NXP_SIUL2_PINMUX(0, 0, 232, 0, 40, 5)
#define PTH9_EIRQ25_I                           NXP_SIUL2_PINMUX(0, 0, 233, 0, 41, 5)
#define PTH10_EIRQ26_I                          NXP_SIUL2_PINMUX(0, 0, 234, 0, 42, 5)
#define PTH11_EIRQ27_I                          NXP_SIUL2_PINMUX(0, 0, 235, 0, 43, 5)
#define PTH12_EIRQ28_I                          NXP_SIUL2_PINMUX(0, 0, 236, 0, 44, 5)
#define PTH7_EIRQ23_I                           NXP_SIUL2_PINMUX(0, 0, 231, 0, 39, 5)
#define PTH8_EIRQ24_I                           NXP_SIUL2_PINMUX(0, 0, 232, 0, 40, 5)
#define PTH9_EIRQ25_I                           NXP_SIUL2_PINMUX(0, 0, 233, 0, 41, 5)
#define PTH10_EIRQ26_I                          NXP_SIUL2_PINMUX(0, 0, 234, 0, 42, 5)
#define PTH11_EIRQ27_I                          NXP_SIUL2_PINMUX(0, 0, 235, 0, 43, 5)
#define PTH12_EIRQ28_I                          NXP_SIUL2_PINMUX(0, 0, 236, 0, 44, 5)

