zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* EMIOS_0 */
#define PTA0_EMIOS_0_CH17_Z                     NXP_SIUL2_PINMUX(0, 0, 0, 0, 65, 2)
#define PTA1_EMIOS_0_CH9_Z                      NXP_SIUL2_PINMUX(0, 0, 1, 0, 57, 1)
#define PTA2_EMIOS_0_CH19_Z_O                   NXP_SIUL2_PINMUX(0, 0, 2, 11, 0, 0)
#define PTA2_EMIOS_0_CH19_Z_I                   NXP_SIUL2_PINMUX(0, 0, 2, 0, 67, 5)
#define PTA6_EMIOS_0_CH13_Z_O                   NXP_SIUL2_PINMUX(0, 0, 6, 11, 0, 0)
#define PTA6_EMIOS_0_CH13_Z_I                   NXP_SIUL2_PINMUX(0, 0, 6, 0, 61, 5)
#define PTA7_EMIOS_0_CH11_Z_O                   NXP_SIUL2_PINMUX(0, 0, 7, 13, 0, 0)
#define PTA7_EMIOS_0_CH11_Z_I                   NXP_SIUL2_PINMUX(0, 0, 7, 0, 59, 6)
#define PTA10_EMIOS_0_CH12_Z_O                  NXP_SIUL2_PINMUX(0, 0, 10, 2, 0, 0)
#define PTA10_EMIOS_0_CH12_Z_I                  NXP_SIUL2_PINMUX(0, 0, 10, 0, 60, 2)
#define PTA15_EMIOS_0_CH10_Z                    NXP_SIUL2_PINMUX(0, 0, 15, 0, 58, 2)
#define PTA16_EMIOS_0_CH11_Z                    NXP_SIUL2_PINMUX(0, 0, 16, 0, 59, 2)
#define PTA17_EMIOS_0_CH6_Z_O                   NXP_SIUL2_PINMUX(0, 0, 17, 2, 0, 0)
#define PTA17_EMIOS_0_CH10_Z_O                  NXP_SIUL2_PINMUX(0, 0, 17, 10, 0, 0)
#define PTA17_EMIOS_0_CH6_Z_I                   NXP_SIUL2_PINMUX(0, 0, 17, 0, 54, 2)
#define PTA17_EMIOS_0_CH10_Z_I                  NXP_SIUL2_PINMUX(0, 0, 17, 0, 58, 4)
#define PTA21_EMIOS_0_CH4_Z_O                   NXP_SIUL2_PINMUX(0, 0, 21, 8, 0, 0)
#define PTA21_EMIOS_0_CH4_Z_I                   NXP_SIUL2_PINMUX(0, 0, 21, 0, 52, 6)
#define PTA25_EMIOS_0_CH8_Z_O                   NXP_SIUL2_PINMUX(0, 0, 25, 8, 0, 0)
#define PTA25_EMIOS_0_CH8_Z_I                   NXP_SIUL2_PINMUX(0, 0, 25, 0, 56, 4)
#define PTA26_EMIOS_0_CH9_Z_O                   NXP_SIUL2_PINMUX(0, 0, 26, 8, 0, 0)
#define PTA26_EMIOS_0_CH9_Z_I                   NXP_SIUL2_PINMUX(0, 0, 26, 0, 57, 5)
#define PTA30_EMIOS_0_CH13_Z_O                  NXP_SIUL2_PINMUX(0, 0, 30, 8, 0, 0)
#define PTA30_EMIOS_0_CH13_Z_I                  NXP_SIUL2_PINMUX(0, 0, 30, 0, 61, 4)
#define PTA31_EMIOS_0_CH14_Z_O                  NXP_SIUL2_PINMUX(0, 0, 31, 8, 0, 0)
#define PTA31_EMIOS_0_CH14_Z_I                  NXP_SIUL2_PINMUX(0, 0, 31, 0, 62, 4)
#define PTB0_EMIOS_0_CH3_Z_O                    NXP_SIUL2_PINMUX(0, 0, 32, 4, 0, 0)
#define PTB0_EMIOS_0_CH3_Z_I                    NXP_SIUL2_PINMUX(0, 0, 32, 0, 51, 4)
#define PTB1_EMIOS_0_CH7_Z_O                    NXP_SIUL2_PINMUX(0, 0, 33, 4, 0, 0)
#define PTB1_EMIOS_0_CH7_Z_I                    NXP_SIUL2_PINMUX(0, 0, 33, 0, 55, 3)
#define PTB2_EMIOS_0_CH8_Z_O                    NXP_SIUL2_PINMUX(0, 0, 34, 2, 0, 0)
#define PTB2_EMIOS_0_CH8_Z_I                    NXP_SIUL2_PINMUX(0, 0, 34, 0, 56, 1)
#define PTB3_EMIOS_0_CH9_Z_O                    NXP_SIUL2_PINMUX(0, 0, 35, 2, 0, 0)
#define PTB3_EMIOS_0_CH9_Z_I                    NXP_SIUL2_PINMUX(0, 0, 35, 0, 57, 2)
#define PTB4_EMIOS_0_CH4_Z_O                    NXP_SIUL2_PINMUX(0, 0, 36, 2, 0, 0)
#define PTB4_EMIOS_0_CH4_Z_I                    NXP_SIUL2_PINMUX(0, 0, 36, 0, 52, 1)
#define PTB5_EMIOS_0_CH5_Z_O                    NXP_SIUL2_PINMUX(0, 0, 37, 2, 0, 0)
#define PTB5_EMIOS_0_CH5_Z_I                    NXP_SIUL2_PINMUX(0, 0, 37, 0, 53, 1)
#define PTB8_EMIOS_0_CH15_Z                     NXP_SIUL2_PINMUX(0, 0, 40, 0, 63, 6)
#define PTB11_EMIOS_0_CH9_Z_O                   NXP_SIUL2_PINMUX(0, 0, 43, 9, 0, 0)
#define PTB11_EMIOS_0_CH9_Z_I                   NXP_SIUL2_PINMUX(0, 0, 43, 0, 57, 4)
#define PTB12_EMIOS_0_CH0_Z_O                   NXP_SIUL2_PINMUX(0, 0, 44, 2, 0, 0)
#define PTB12_EMIOS_0_CH0_Z_I                   NXP_SIUL2_PINMUX(0, 0, 44, 0, 48, 1)
#define PTB13_EMIOS_0_CH1_Z_O                   NXP_SIUL2_PINMUX(0, 0, 45, 2, 0, 0)
#define PTB13_EMIOS_0_CH1_Z_I                   NXP_SIUL2_PINMUX(0, 0, 45, 0, 49, 2)
#define PTB14_EMIOS_0_CH2_Z_O                   NXP_SIUL2_PINMUX(0, 0, 46, 2, 0, 0)
#define PTB14_EMIOS_0_CH2_Z_I                   NXP_SIUL2_PINMUX(0, 0, 46, 0, 50, 3)
#define PTB15_EMIOS_0_CH3_Z_O                   NXP_SIUL2_PINMUX(0, 0, 47, 2, 0, 0)
#define PTB15_EMIOS_0_CH3_Z_I                   NXP_SIUL2_PINMUX(0, 0, 47, 0, 51, 1)
#define PTB16_EMIOS_0_CH4_Z_O                   NXP_SIUL2_PINMUX(0, 0, 48, 2, 0, 0)
#define PTB16_EMIOS_0_CH4_Z_I                   NXP_SIUL2_PINMUX(0, 0, 48, 0, 52, 2)
#define PTB17_EMIOS_0_CH5_Z_O                   NXP_SIUL2_PINMUX(0, 0, 49, 2, 0, 0)
#define PTB17_EMIOS_0_CH5_Z_I                   NXP_SIUL2_PINMUX(0, 0, 49, 0, 53, 2)
#define PTB18_EMIOS_0_CH15_Z_O                  NXP_SIUL2_PINMUX(0, 0, 50, 9, 0, 0)
#define PTB18_EMIOS_0_CH15_Z_I                  NXP_SIUL2_PINMUX(0, 0, 50, 0, 63, 4)
#define PTB19_EMIOS_0_CH15_Z_O                  NXP_SIUL2_PINMUX(0, 0, 51, 8, 0, 0)
#define PTB19_EMIOS_0_CH15_Z_I                  NXP_SIUL2_PINMUX(0, 0, 51, 0, 63, 5)
#define PTB21_EMIOS_0_CH17_Z_O                  NXP_SIUL2_PINMUX(0, 0, 53, 8, 0, 0)
#define PTB21_EMIOS_0_CH17_Z_I                  NXP_SIUL2_PINMUX(0, 0, 53, 0, 65, 4)
#define PTB23_EMIOS_0_CH19_Z_O                  NXP_SIUL2_PINMUX(0, 0, 55, 8, 0, 0)
#define PTB23_EMIOS_0_CH19_Z_I                  NXP_SIUL2_PINMUX(0, 0, 55, 0, 67, 6)
#define PTB27_EMIOS_0_CH23_Z_O                  NXP_SIUL2_PINMUX(0, 0, 59, 9, 0, 0)
#define PTB27_EMIOS_0_CH23_Z_I                  NXP_SIUL2_PINMUX(0, 0, 59, 0, 71, 3)
#define PTC0_EMIOS_0_CH0_Z_O                    NXP_SIUL2_PINMUX(0, 0, 64, 2, 0, 0)
#define PTC0_EMIOS_0_CH14_Z_O                   NXP_SIUL2_PINMUX(0, 0, 64, 6, 0, 0)
#define PTC0_EMIOS_0_CH0_Z_I                    NXP_SIUL2_PINMUX(0, 0, 64, 0, 48, 3)
#define PTC0_EMIOS_0_CH14_Z_I                   NXP_SIUL2_PINMUX(0, 0, 64, 0, 62, 2)
#define PTC1_EMIOS_0_CH1_Z_O                    NXP_SIUL2_PINMUX(0, 0, 65, 2, 0, 0)
#define PTC1_EMIOS_0_CH15_Z_O                   NXP_SIUL2_PINMUX(0, 0, 65, 6, 0, 0)
#define PTC1_EMIOS_0_CH1_Z_I                    NXP_SIUL2_PINMUX(0, 0, 65, 0, 49, 1)
#define PTC1_EMIOS_0_CH15_Z_I                   NXP_SIUL2_PINMUX(0, 0, 65, 0, 63, 1)
#define PTC2_EMIOS_0_CH2_Z_O                    NXP_SIUL2_PINMUX(0, 0, 66, 2, 0, 0)
#define PTC2_EMIOS_0_CH2_Z_I                    NXP_SIUL2_PINMUX(0, 0, 66, 0, 50, 2)
#define PTC3_EMIOS_0_CH3_Z_O                    NXP_SIUL2_PINMUX(0, 0, 67, 2, 0, 0)
#define PTC3_EMIOS_0_CH3_Z_I                    NXP_SIUL2_PINMUX(0, 0, 67, 0, 51, 3)
#define PTC4_EMIOS_0_CH8_Z_O                    NXP_SIUL2_PINMUX(0, 0, 68, 2, 0, 0)
#define PTC4_EMIOS_0_CH8_Z_I                    NXP_SIUL2_PINMUX(0, 0, 68, 0, 56, 2)
#define PTC5_EMIOS_0_CH16_Z_O                   NXP_SIUL2_PINMUX(0, 0, 69, 2, 0, 0)
#define PTC5_EMIOS_0_CH16_Z_I                   NXP_SIUL2_PINMUX(0, 0, 69, 0, 64, 2)
#define PTC8_EMIOS_0_CH9_Z_O                    NXP_SIUL2_PINMUX(0, 0, 72, 12, 0, 0)
#define PTC8_EMIOS_0_CH9_Z_I                    NXP_SIUL2_PINMUX(0, 0, 72, 0, 57, 7)
#define PTC9_EMIOS_0_CH8_Z_O                    NXP_SIUL2_PINMUX(0, 0, 73, 11, 0, 0)
#define PTC9_EMIOS_0_CH8_Z_I                    NXP_SIUL2_PINMUX(0, 0, 73, 0, 56, 5)
#define PTC10_EMIOS_0_CH6_Z_O                   NXP_SIUL2_PINMUX(0, 0, 74, 1, 0, 0)
#define PTC10_EMIOS_0_CH6_Z_I                   NXP_SIUL2_PINMUX(0, 0, 74, 0, 54, 4)
#define PTC12_EMIOS_0_CH22_Z_O                  NXP_SIUL2_PINMUX(0, 0, 76, 3, 0, 0)
#define PTC12_EMIOS_0_CH22_Z_I                  NXP_SIUL2_PINMUX(0, 0, 76, 0, 70, 2)
#define PTC13_EMIOS_0_CH23_Z_O                  NXP_SIUL2_PINMUX(0, 0, 77, 3, 0, 0)
#define PTC13_EMIOS_0_CH23_Z_I                  NXP_SIUL2_PINMUX(0, 0, 77, 0, 71, 1)
#define PTC14_EMIOS_0_CH10_Z_O                  NXP_SIUL2_PINMUX(0, 0, 78, 2, 0, 0)
#define PTC14_EMIOS_0_CH10_Z_I                  NXP_SIUL2_PINMUX(0, 0, 78, 0, 58, 1)
#define PTC15_EMIOS_0_CH11_Z_O                  NXP_SIUL2_PINMUX(0, 0, 79, 2, 0, 0)
#define PTC15_EMIOS_0_CH11_Z_I                  NXP_SIUL2_PINMUX(0, 0, 79, 0, 59, 1)
#define PTC16_EMIOS_0_CH9_Z_O                   NXP_SIUL2_PINMUX(0, 0, 80, 8, 0, 0)
#define PTC16_EMIOS_0_CH9_Z_I                   NXP_SIUL2_PINMUX(0, 0, 80, 0, 57, 6)
#define PTC23_EMIOS_0_CH12_Z_O                  NXP_SIUL2_PINMUX(0, 0, 87, 10, 0, 0)
#define PTC23_EMIOS_0_CH12_Z_I                  NXP_SIUL2_PINMUX(0, 0, 87, 0, 60, 4)
#define PTC26_EMIOS_0_CH5_Z_O                   NXP_SIUL2_PINMUX(0, 0, 90, 10, 0, 0)
#define PTC26_EMIOS_0_CH5_Z_I                   NXP_SIUL2_PINMUX(0, 0, 90, 0, 53, 6)
#define PTC29_EMIOS_0_CH10_Z_O                  NXP_SIUL2_PINMUX(0, 0, 93, 11, 0, 0)
#define PTC29_EMIOS_0_CH10_Z_I                  NXP_SIUL2_PINMUX(0, 0, 93, 0, 58, 5)
#define PTC31_EMIOS_0_CH14_Z_O                  NXP_SIUL2_PINMUX(0, 0, 95, 11, 0, 0)
#define PTC31_EMIOS_0_CH14_Z_I                  NXP_SIUL2_PINMUX(0, 0, 95, 0, 62, 5)
#define PTD0_EMIOS_0_CH2_Z_O                    NXP_SIUL2_PINMUX(0, 0, 96, 2, 0, 0)
#define PTD0_EMIOS_0_CH16_Z_O                   NXP_SIUL2_PINMUX(0, 0, 96, 4, 0, 0)
#define PTD0_EMIOS_0_CH2_Z_I                    NXP_SIUL2_PINMUX(0, 0, 96, 0, 50, 1)
#define PTD0_EMIOS_0_CH16_Z_I                   NXP_SIUL2_PINMUX(0, 0, 96, 0, 64, 1)
#define PTD1_EMIOS_0_CH3_Z_O                    NXP_SIUL2_PINMUX(0, 0, 97, 2, 0, 0)
#define PTD1_EMIOS_0_CH17_Z_O                   NXP_SIUL2_PINMUX(0, 0, 97, 4, 0, 0)
#define PTD1_EMIOS_0_CH3_Z_I                    NXP_SIUL2_PINMUX(0, 0, 97, 0, 51, 2)
#define PTD1_EMIOS_0_CH17_Z_I                   NXP_SIUL2_PINMUX(0, 0, 97, 0, 65, 1)
#define PTD4_EMIOS_0_CH23_Z_O                   NXP_SIUL2_PINMUX(0, 0, 100, 10, 0, 0)
#define PTD4_EMIOS_0_CH23_Z_I                   NXP_SIUL2_PINMUX(0, 0, 100, 0, 71, 5)
#define PTD5_EMIOS_0_CH19_Z_O                   NXP_SIUL2_PINMUX(0, 0, 101, 2, 0, 0)
#define PTD5_EMIOS_0_CH2_Z_O                    NXP_SIUL2_PINMUX(0, 0, 101, 3, 0, 0)
#define PTD5_EMIOS_0_CH2_Z_I                    NXP_SIUL2_PINMUX(0, 0, 101, 0, 50, 4)
#define PTD5_EMIOS_0_CH19_Z_I                   NXP_SIUL2_PINMUX(0, 0, 101, 0, 67, 2)
#define PTD8_EMIOS_0_CH12_Z_O                   NXP_SIUL2_PINMUX(0, 0, 104, 6, 0, 0)
#define PTD8_EMIOS_0_CH12_Z_I                   NXP_SIUL2_PINMUX(0, 0, 104, 0, 60, 1)
#define PTD9_EMIOS_0_CH13_Z_O                   NXP_SIUL2_PINMUX(0, 0, 105, 6, 0, 0)
#define PTD9_EMIOS_0_CH13_Z_I                   NXP_SIUL2_PINMUX(0, 0, 105, 0, 61, 2)
#define PTD10_EMIOS_0_CH16_Z_O                  NXP_SIUL2_PINMUX(0, 0, 106, 2, 0, 0)
#define PTD10_EMIOS_0_CH16_Z_I                  NXP_SIUL2_PINMUX(0, 0, 106, 0, 64, 3)
#define PTD11_EMIOS_0_CH17_Z_O                  NXP_SIUL2_PINMUX(0, 0, 107, 2, 0, 0)
#define PTD11_EMIOS_0_CH17_Z_I                  NXP_SIUL2_PINMUX(0, 0, 107, 0, 65, 3)
#define PTD12_EMIOS_0_CH18_Z_O                  NXP_SIUL2_PINMUX(0, 0, 108, 2, 0, 0)
#define PTD12_EMIOS_0_CH18_Z_I                  NXP_SIUL2_PINMUX(0, 0, 108, 0, 66, 1)
#define PTD13_EMIOS_0_CH20_Z_O                  NXP_SIUL2_PINMUX(0, 0, 109, 2, 0, 0)
#define PTD13_EMIOS_0_CH20_Z_I                  NXP_SIUL2_PINMUX(0, 0, 109, 0, 68, 1)
#define PTD14_EMIOS_0_CH21_Z_O                  NXP_SIUL2_PINMUX(0, 0, 110, 2, 0, 0)
#define PTD14_EMIOS_0_CH21_Z_I                  NXP_SIUL2_PINMUX(0, 0, 110, 0, 69, 1)
#define PTD15_EMIOS_0_CH0_Z_O                   NXP_SIUL2_PINMUX(0, 0, 111, 2, 0, 0)
#define PTD15_EMIOS_0_CH0_Z_I                   NXP_SIUL2_PINMUX(0, 0, 111, 0, 48, 2)
#define PTD16_EMIOS_0_CH1_Z_O                   NXP_SIUL2_PINMUX(0, 0, 112, 2, 0, 0)
#define PTD16_EMIOS_0_CH1_Z_I                   NXP_SIUL2_PINMUX(0, 0, 112, 0, 49, 3)
#define PTD17_EMIOS_0_CH18_Z_O                  NXP_SIUL2_PINMUX(0, 0, 113, 2, 0, 0)
#define PTD17_EMIOS_0_CH18_Z_I                  NXP_SIUL2_PINMUX(0, 0, 113, 0, 66, 3)
#define PTD18_EMIOS_0_CH15_Z_O                  NXP_SIUL2_PINMUX(0, 0, 114, 8, 0, 0)
#define PTD18_EMIOS_0_CH15_Z_I                  NXP_SIUL2_PINMUX(0, 0, 114, 0, 63, 7)
#define PTD19_EMIOS_0_CH0_Z_O                   NXP_SIUL2_PINMUX(0, 0, 115, 14, 0, 0)
#define PTD19_EMIOS_0_CH0_Z_I                   NXP_SIUL2_PINMUX(0, 0, 115, 0, 48, 4)
#define PTD20_EMIOS_0_CH17_Z_O                  NXP_SIUL2_PINMUX(0, 0, 116, 14, 0, 0)
#define PTD20_EMIOS_0_CH17_Z_I                  NXP_SIUL2_PINMUX(0, 0, 116, 0, 65, 5)
#define PTD22_EMIOS_0_CH19_Z_O                  NXP_SIUL2_PINMUX(0, 0, 118, 11, 0, 0)
#define PTD22_EMIOS_0_CH19_Z_I                  NXP_SIUL2_PINMUX(0, 0, 118, 0, 67, 7)
#define PTD25_EMIOS_0_CH1_Z_O                   NXP_SIUL2_PINMUX(0, 0, 121, 8, 0, 0)
#define PTD25_EMIOS_0_CH1_Z_I                   NXP_SIUL2_PINMUX(0, 0, 121, 0, 49, 6)
#define PTD26_EMIOS_0_CH23_Z                    NXP_SIUL2_PINMUX(0, 0, 122, 0, 71, 4)
#define PTE2_EMIOS_0_CH3_Z                      NXP_SIUL2_PINMUX(0, 0, 130, 0, 51, 5)
#define PTE4_EMIOS_0_CH18_Z_O                   NXP_SIUL2_PINMUX(0, 0, 132, 4, 0, 0)
#define PTE4_EMIOS_0_CH18_Z_I                   NXP_SIUL2_PINMUX(0, 0, 132, 0, 66, 2)
#define PTE5_EMIOS_0_CH19_Z_O                   NXP_SIUL2_PINMUX(0, 0, 133, 4, 0, 0)
#define PTE5_EMIOS_0_CH19_Z_I                   NXP_SIUL2_PINMUX(0, 0, 133, 0, 67, 1)
#define PTE7_EMIOS_0_CH7_Z_O                    NXP_SIUL2_PINMUX(0, 0, 135, 2, 0, 0)
#define PTE7_EMIOS_0_CH11_Z_O                   NXP_SIUL2_PINMUX(0, 0, 135, 9, 0, 0)
#define PTE7_EMIOS_0_CH7_Z_I                    NXP_SIUL2_PINMUX(0, 0, 135, 0, 55, 2)
#define PTE7_EMIOS_0_CH11_Z_I                   NXP_SIUL2_PINMUX(0, 0, 135, 0, 59, 4)
#define PTE8_EMIOS_0_CH6_Z_O                    NXP_SIUL2_PINMUX(0, 0, 136, 2, 0, 0)
#define PTE8_EMIOS_0_CH6_Z_I                    NXP_SIUL2_PINMUX(0, 0, 136, 0, 54, 1)
#define PTE9_EMIOS_0_CH7_Z_O                    NXP_SIUL2_PINMUX(0, 0, 137, 2, 0, 0)
#define PTE9_EMIOS_0_CH7_Z_I                    NXP_SIUL2_PINMUX(0, 0, 137, 0, 55, 1)
#define PTE10_EMIOS_0_CH20_Z_O                  NXP_SIUL2_PINMUX(0, 0, 138, 4, 0, 0)
#define PTE10_EMIOS_0_CH20_Z_I                  NXP_SIUL2_PINMUX(0, 0, 138, 0, 68, 2)
#define PTE11_EMIOS_0_CH1_Z_O                   NXP_SIUL2_PINMUX(0, 0, 139, 3, 0, 0)
#define PTE11_EMIOS_0_CH21_Z_O                  NXP_SIUL2_PINMUX(0, 0, 139, 4, 0, 0)
#define PTE11_EMIOS_0_CH1_Z_I                   NXP_SIUL2_PINMUX(0, 0, 139, 0, 49, 4)
#define PTE11_EMIOS_0_CH21_Z_I                  NXP_SIUL2_PINMUX(0, 0, 139, 0, 69, 2)
#define PTE14_EMIOS_0_CH19_Z_O                  NXP_SIUL2_PINMUX(0, 0, 142, 1, 0, 0)
#define PTE14_EMIOS_0_CH19_Z_I                  NXP_SIUL2_PINMUX(0, 0, 142, 0, 67, 3)
#define PTE15_EMIOS_0_CH22_Z_O                  NXP_SIUL2_PINMUX(0, 0, 143, 4, 0, 0)
#define PTE15_EMIOS_0_CH22_Z_I                  NXP_SIUL2_PINMUX(0, 0, 143, 0, 70, 1)
#define PTE16_EMIOS_0_CH23_Z_O                  NXP_SIUL2_PINMUX(0, 0, 144, 4, 0, 0)
#define PTE16_EMIOS_0_CH23_Z_I                  NXP_SIUL2_PINMUX(0, 0, 144, 0, 71, 2)
#define PTE19_EMIOS_0_CH22_Z_O                  NXP_SIUL2_PINMUX(0, 0, 147, 2, 0, 0)
#define PTE19_EMIOS_0_CH22_Z_I                  NXP_SIUL2_PINMUX(0, 0, 147, 0, 70, 3)
#define PTE20_EMIOS_0_CH2_Z_O                   NXP_SIUL2_PINMUX(0, 0, 148, 8, 0, 0)
#define PTE20_EMIOS_0_CH2_Z_I                   NXP_SIUL2_PINMUX(0, 0, 148, 0, 50, 6)
#define PTE23_EMIOS_0_CH4_Z_O                   NXP_SIUL2_PINMUX(0, 0, 151, 8, 0, 0)
#define PTE23_EMIOS_0_CH4_Z_I                   NXP_SIUL2_PINMUX(0, 0, 151, 0, 52, 7)
#define PTE27_EMIOS_0_CH4_Z_O                   NXP_SIUL2_PINMUX(0, 0, 155, 10, 0, 0)
#define PTE27_EMIOS_0_CH4_Z_I                   NXP_SIUL2_PINMUX(0, 0, 155, 0, 52, 4)
#define PTE29_EMIOS_0_CH5_Z_O                   NXP_SIUL2_PINMUX(0, 0, 157, 8, 0, 0)
#define PTE29_EMIOS_0_CH5_Z_I                   NXP_SIUL2_PINMUX(0, 0, 157, 0, 53, 4)
#define PTE31_EMIOS_0_CH6_Z_O                   NXP_SIUL2_PINMUX(0, 0, 159, 8, 0, 0)
#define PTE31_EMIOS_0_CH6_Z_I                   NXP_SIUL2_PINMUX(0, 0, 159, 0, 54, 5)
#define PTF0_EMIOS_0_CH7_Z_O                    NXP_SIUL2_PINMUX(0, 0, 160, 9, 0, 0)
#define PTF0_EMIOS_0_CH7_Z_I                    NXP_SIUL2_PINMUX(0, 0, 160, 0, 55, 5)
#define PTF1_EMIOS_0_CH16_Z_O                   NXP_SIUL2_PINMUX(0, 0, 161, 8, 0, 0)
#define PTF1_EMIOS_0_CH16_Z_I                   NXP_SIUL2_PINMUX(0, 0, 161, 0, 64, 4)
#define PTF2_EMIOS_0_CH23_Z_O                   NXP_SIUL2_PINMUX(0, 0, 162, 9, 0, 0)
#define PTF2_EMIOS_0_CH23_Z_I                   NXP_SIUL2_PINMUX(0, 0, 162, 0, 71, 7)
#define PTF3_EMIOS_0_CH0_Z_O                    NXP_SIUL2_PINMUX(0, 0, 163, 8, 0, 0)
#define PTF3_EMIOS_0_CH0_Z_I                    NXP_SIUL2_PINMUX(0, 0, 163, 0, 48, 5)
#define PTF4_EMIOS_0_CH1_Z_O                    NXP_SIUL2_PINMUX(0, 0, 164, 8, 0, 0)
#define PTF4_EMIOS_0_CH1_Z_I                    NXP_SIUL2_PINMUX(0, 0, 164, 0, 49, 7)
#define PTF5_EMIOS_0_CH2_Z_O                    NXP_SIUL2_PINMUX(0, 0, 165, 8, 0, 0)
#define PTF5_EMIOS_0_CH2_Z_I                    NXP_SIUL2_PINMUX(0, 0, 165, 0, 50, 7)
#define PTF8_EMIOS_0_CH4_Z_O                    NXP_SIUL2_PINMUX(0, 0, 168, 9, 0, 0)
#define PTF8_EMIOS_0_CH4_Z_I                    NXP_SIUL2_PINMUX(0, 0, 168, 0, 52, 5)
#define PTF9_EMIOS_0_CH5_Z_O                    NXP_SIUL2_PINMUX(0, 0, 169, 8, 0, 0)
#define PTF9_EMIOS_0_CH5_Z_I                    NXP_SIUL2_PINMUX(0, 0, 169, 0, 53, 5)
#define PTF10_EMIOS_0_CH18_Z_O                  NXP_SIUL2_PINMUX(0, 0, 170, 8, 0, 0)
#define PTF10_EMIOS_0_CH18_Z_I                  NXP_SIUL2_PINMUX(0, 0, 170, 0, 66, 4)
#define PTF11_EMIOS_0_CH19_Z_O                  NXP_SIUL2_PINMUX(0, 0, 171, 8, 0, 0)
#define PTF11_EMIOS_0_CH19_Z_I                  NXP_SIUL2_PINMUX(0, 0, 171, 0, 67, 9)
#define PTF12_EMIOS_0_CH20_Z_O                  NXP_SIUL2_PINMUX(0, 0, 172, 10, 0, 0)
#define PTF12_EMIOS_0_CH20_Z_I                  NXP_SIUL2_PINMUX(0, 0, 172, 0, 68, 3)
#define PTF13_EMIOS_0_CH21_Z_O                  NXP_SIUL2_PINMUX(0, 0, 173, 9, 0, 0)
#define PTF13_EMIOS_0_CH21_Z_I                  NXP_SIUL2_PINMUX(0, 0, 173, 0, 69, 3)
#define PTF14_EMIOS_0_CH17_Z_O                  NXP_SIUL2_PINMUX(0, 0, 174, 12, 0, 0)
#define PTF14_EMIOS_0_CH17_Z_I                  NXP_SIUL2_PINMUX(0, 0, 174, 0, 65, 7)
#define PTF15_EMIOS_0_CH22_Z_O                  NXP_SIUL2_PINMUX(0, 0, 175, 12, 0, 0)
#define PTF15_EMIOS_0_CH22_Z_I                  NXP_SIUL2_PINMUX(0, 0, 175, 0, 70, 4)
#define PTF19_EMIOS_0_CH5_Z_O                   NXP_SIUL2_PINMUX(0, 0, 179, 8, 0, 0)
#define PTF19_EMIOS_0_CH5_Z_I                   NXP_SIUL2_PINMUX(0, 0, 179, 0, 53, 7)
#define PTF20_EMIOS_0_CH13_Z_O                  NXP_SIUL2_PINMUX(0, 0, 180, 13, 0, 0)
#define PTF20_EMIOS_0_CH13_Z_I                  NXP_SIUL2_PINMUX(0, 0, 180, 0, 61, 7)
#define PTF21_EMIOS_0_CH14_Z_O                  NXP_SIUL2_PINMUX(0, 0, 181, 11, 0, 0)
#define PTF21_EMIOS_0_CH14_Z_I                  NXP_SIUL2_PINMUX(0, 0, 181, 0, 62, 7)
#define PTF24_EMIOS_0_CH8_Z_O                   NXP_SIUL2_PINMUX(0, 0, 184, 8, 0, 0)
#define PTF24_EMIOS_0_CH8_Z_I                   NXP_SIUL2_PINMUX(0, 0, 184, 0, 56, 6)
#define PTF25_EMIOS_0_CH9_Z_O                   NXP_SIUL2_PINMUX(0, 0, 185, 9, 0, 0)
#define PTF25_EMIOS_0_CH9_Z_I                   NXP_SIUL2_PINMUX(0, 0, 185, 0, 57, 8)
#define PTF26_EMIOS_0_CH10_Z_O                  NXP_SIUL2_PINMUX(0, 0, 186, 8, 0, 0)
#define PTF26_EMIOS_0_CH10_Z_I                  NXP_SIUL2_PINMUX(0, 0, 186, 0, 58, 6)
#define PTF27_EMIOS_0_CH11_Z_O                  NXP_SIUL2_PINMUX(0, 0, 187, 11, 0, 0)
#define PTF27_EMIOS_0_CH11_Z_I                  NXP_SIUL2_PINMUX(0, 0, 187, 0, 59, 7)
#define PTF29_EMIOS_0_CH13_Z_O                  NXP_SIUL2_PINMUX(0, 0, 189, 8, 0, 0)
#define PTF29_EMIOS_0_CH13_Z_I                  NXP_SIUL2_PINMUX(0, 0, 189, 0, 61, 6)
#define PTF30_EMIOS_0_CH14_Z_O                  NXP_SIUL2_PINMUX(0, 0, 190, 8, 0, 0)
#define PTF30_EMIOS_0_CH14_Z_I                  NXP_SIUL2_PINMUX(0, 0, 190, 0, 62, 6)
#define PTF31_EMIOS_0_CH15_Z_O                  NXP_SIUL2_PINMUX(0, 0, 191, 8, 0, 0)
#define PTF31_EMIOS_0_CH15_Z_I                  NXP_SIUL2_PINMUX(0, 0, 191, 0, 63, 8)
#define PTG0_EMIOS_0_CH6_Z_O                    NXP_SIUL2_PINMUX(0, 0, 192, 8, 0, 0)
#define PTG0_EMIOS_0_CH6_Z_I                    NXP_SIUL2_PINMUX(0, 0, 192, 0, 54, 6)
#define PTG1_EMIOS_0_CH17_Z_O                   NXP_SIUL2_PINMUX(0, 0, 193, 8, 0, 0)
#define PTG1_EMIOS_0_CH17_Z_I                   NXP_SIUL2_PINMUX(0, 0, 193, 0, 65, 6)
#define PTG3_EMIOS_0_CH19_Z_O                   NXP_SIUL2_PINMUX(0, 0, 195, 8, 0, 0)
#define PTG3_EMIOS_0_CH19_Z_I                   NXP_SIUL2_PINMUX(0, 0, 195, 0, 67, 8)
#define PTG4_EMIOS_0_CH20_Z_O                   NXP_SIUL2_PINMUX(0, 0, 196, 11, 0, 0)
#define PTG4_EMIOS_0_CH20_Z_I                   NXP_SIUL2_PINMUX(0, 0, 196, 0, 68, 4)
#define PTG5_EMIOS_0_CH21_Z_O                   NXP_SIUL2_PINMUX(0, 0, 197, 11, 0, 0)
#define PTG5_EMIOS_0_CH21_Z_I                   NXP_SIUL2_PINMUX(0, 0, 197, 0, 69, 4)
#define PTG7_EMIOS_0_CH23_Z_O                   NXP_SIUL2_PINMUX(0, 0, 199, 8, 0, 0)
#define PTG7_EMIOS_0_CH23_Z_I                   NXP_SIUL2_PINMUX(0, 0, 199, 0, 71, 6)
#define PTG8_EMIOS_0_CH22_Z_O                   NXP_SIUL2_PINMUX(0, 0, 200, 13, 0, 0)
#define PTG8_EMIOS_0_CH22_Z_I                   NXP_SIUL2_PINMUX(0, 0, 200, 0, 70, 5)
#define PTG9_EMIOS_0_CH23_Z_O                   NXP_SIUL2_PINMUX(0, 0, 201, 8, 0, 0)
#define PTG9_EMIOS_0_CH23_Z_I                   NXP_SIUL2_PINMUX(0, 0, 201, 0, 71, 8)
#define PTG10_EMIOS_0_CH7_Z_O                   NXP_SIUL2_PINMUX(0, 0, 202, 8, 0, 0)
#define PTG10_EMIOS_0_CH7_Z_I                   NXP_SIUL2_PINMUX(0, 0, 202, 0, 55, 6)
#define PTG11_EMIOS_0_CH16_Z_O                  NXP_SIUL2_PINMUX(0, 0, 203, 8, 0, 0)
#define PTG11_EMIOS_0_CH16_Z_I                  NXP_SIUL2_PINMUX(0, 0, 203, 0, 64, 5)
#define PTG12_EMIOS_0_CH18_Z_O                  NXP_SIUL2_PINMUX(0, 0, 204, 8, 0, 0)
#define PTG12_EMIOS_0_CH18_Z_I                  NXP_SIUL2_PINMUX(0, 0, 204, 0, 66, 5)
#define PTG13_EMIOS_0_CH19_Z_O                  NXP_SIUL2_PINMUX(0, 0, 205, 13, 0, 0)
#define PTG13_EMIOS_0_CH19_Z_I                  NXP_SIUL2_PINMUX(0, 0, 205, 0, 67, 10)

