zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* FXIO */
#define PTA0_FXIO_D2                            NXP_SIUL2_PINMUX(0, 0, 0, 0, 154, 2)
#define PTA1_FXIO_D3                            NXP_SIUL2_PINMUX(0, 0, 1, 0, 155, 1)
#define PTA2_FXIO_D4_O                          NXP_SIUL2_PINMUX(0, 0, 2, 5, 0, 0)
#define PTA2_FXIO_D4_I                          NXP_SIUL2_PINMUX(0, 0, 2, 0, 156, 3)
#define PTA3_FXIO_D5_O                          NXP_SIUL2_PINMUX(0, 0, 3, 5, 0, 0)
#define PTA3_FXIO_D5_I                          NXP_SIUL2_PINMUX(0, 0, 3, 0, 157, 3)
#define PTA4_FXIO_D6_O                          NXP_SIUL2_PINMUX(0, 0, 4, 3, 0, 0)
#define PTA4_FXIO_D6_I                          NXP_SIUL2_PINMUX(0, 0, 4, 0, 158, 8)
#define PTA6_FXIO_D19_O                         NXP_SIUL2_PINMUX(0, 0, 6, 5, 0, 0)
#define PTA6_FXIO_D19_I                         NXP_SIUL2_PINMUX(0, 0, 6, 0, 171, 4)
#define PTA7_FXIO_D9_O                          NXP_SIUL2_PINMUX(0, 0, 7, 6, 0, 0)
#define PTA7_FXIO_D9_I                          NXP_SIUL2_PINMUX(0, 0, 7, 0, 161, 3)
#define PTA8_FXIO_D6_O                          NXP_SIUL2_PINMUX(0, 0, 8, 4, 0, 0)
#define PTA8_FXIO_D6_I                          NXP_SIUL2_PINMUX(0, 0, 8, 0, 158, 2)
#define PTA9_FXIO_D7_O                          NXP_SIUL2_PINMUX(0, 0, 9, 4, 0, 0)
#define PTA9_FXIO_D7_I                          NXP_SIUL2_PINMUX(0, 0, 9, 0, 159, 2)
#define PTA10_FXIO_D0_O                         NXP_SIUL2_PINMUX(0, 0, 10, 4, 0, 0)
#define PTA10_FXIO_D0_I                         NXP_SIUL2_PINMUX(0, 0, 10, 0, 152, 2)
#define PTA14_FXIO_D14_O                        NXP_SIUL2_PINMUX(0, 0, 14, 6, 0, 0)
#define PTA14_FXIO_D14_I                        NXP_SIUL2_PINMUX(0, 0, 14, 0, 166, 4)
#define PTA15_FXIO_D31                          NXP_SIUL2_PINMUX(0, 0, 15, 0, 183, 1)
#define PTA16_FXIO_D30                          NXP_SIUL2_PINMUX(0, 0, 16, 0, 182, 1)
#define PTA17_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 17, 7, 0, 0)
#define PTA17_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 17, 0, 171, 1)
#define PTA21_FXIO_D0_O                         NXP_SIUL2_PINMUX(0, 0, 21, 3, 0, 0)
#define PTA21_FXIO_D0_I                         NXP_SIUL2_PINMUX(0, 0, 21, 0, 152, 3)
#define PTA22_FXIO_D1_O                         NXP_SIUL2_PINMUX(0, 0, 22, 3, 0, 0)
#define PTA22_FXIO_D1_I                         NXP_SIUL2_PINMUX(0, 0, 22, 0, 153, 3)
#define PTA23_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 23, 3, 0, 0)
#define PTA23_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 23, 0, 154, 3)
#define PTA24_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 24, 2, 0, 0)
#define PTA24_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 24, 0, 155, 3)
#define PTA25_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 25, 3, 0, 0)
#define PTA25_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 25, 0, 154, 6)
#define PTA26_FXIO_D1_O                         NXP_SIUL2_PINMUX(0, 0, 26, 5, 0, 0)
#define PTA26_FXIO_D1_I                         NXP_SIUL2_PINMUX(0, 0, 26, 0, 153, 7)
#define PTA31_FXIO_D0_O                         NXP_SIUL2_PINMUX(0, 0, 31, 3, 0, 0)
#define PTA31_FXIO_D0_I                         NXP_SIUL2_PINMUX(0, 0, 31, 0, 152, 6)
#define PTB0_FXIO_D14_O                         NXP_SIUL2_PINMUX(0, 0, 32, 2, 0, 0)
#define PTB0_FXIO_D14_I                         NXP_SIUL2_PINMUX(0, 0, 32, 0, 166, 3)
#define PTB2_FXIO_D18_O                         NXP_SIUL2_PINMUX(0, 0, 34, 7, 0, 0)
#define PTB2_FXIO_D18_I                         NXP_SIUL2_PINMUX(0, 0, 34, 0, 170, 1)
#define PTB3_FXIO_D17_O                         NXP_SIUL2_PINMUX(0, 0, 35, 7, 0, 0)
#define PTB3_FXIO_D17_I                         NXP_SIUL2_PINMUX(0, 0, 35, 0, 169, 1)
#define PTB8_FXIO_D29                           NXP_SIUL2_PINMUX(0, 0, 40, 0, 181, 1)
#define PTB9_FXIO_D28                           NXP_SIUL2_PINMUX(0, 0, 41, 0, 180, 1)
#define PTB10_FXIO_D27_O                        NXP_SIUL2_PINMUX(0, 0, 42, 7, 0, 0)
#define PTB10_FXIO_D27_I                        NXP_SIUL2_PINMUX(0, 0, 42, 0, 179, 1)
#define PTB11_FXIO_D26_O                        NXP_SIUL2_PINMUX(0, 0, 43, 7, 0, 0)
#define PTB11_FXIO_D26_I                        NXP_SIUL2_PINMUX(0, 0, 43, 0, 178, 1)
#define PTB12_FXIO_D25_O                        NXP_SIUL2_PINMUX(0, 0, 44, 7, 0, 0)
#define PTB12_FXIO_D25_I                        NXP_SIUL2_PINMUX(0, 0, 44, 0, 177, 1)
#define PTB13_FXIO_D8_O                         NXP_SIUL2_PINMUX(0, 0, 45, 3, 0, 0)
#define PTB13_FXIO_D24_O                        NXP_SIUL2_PINMUX(0, 0, 45, 7, 0, 0)
#define PTB13_FXIO_D8_I                         NXP_SIUL2_PINMUX(0, 0, 45, 0, 160, 3)
#define PTB13_FXIO_D24_I                        NXP_SIUL2_PINMUX(0, 0, 45, 0, 176, 1)
#define PTB14_FXIO_D23_O                        NXP_SIUL2_PINMUX(0, 0, 46, 7, 0, 0)
#define PTB14_FXIO_D23_I                        NXP_SIUL2_PINMUX(0, 0, 46, 0, 175, 1)
#define PTB15_FXIO_D22_O                        NXP_SIUL2_PINMUX(0, 0, 47, 7, 0, 0)
#define PTB15_FXIO_D22_I                        NXP_SIUL2_PINMUX(0, 0, 47, 0, 174, 1)
#define PTB16_FXIO_D21_O                        NXP_SIUL2_PINMUX(0, 0, 48, 7, 0, 0)
#define PTB16_FXIO_D21_I                        NXP_SIUL2_PINMUX(0, 0, 48, 0, 173, 1)
#define PTB17_FXIO_D20_O                        NXP_SIUL2_PINMUX(0, 0, 49, 7, 0, 0)
#define PTB17_FXIO_D20_I                        NXP_SIUL2_PINMUX(0, 0, 49, 0, 172, 1)
#define PTB18_FXIO_D1_O                         NXP_SIUL2_PINMUX(0, 0, 50, 3, 0, 0)
#define PTB18_FXIO_D1_I                         NXP_SIUL2_PINMUX(0, 0, 50, 0, 153, 6)
#define PTB19_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 51, 3, 0, 0)
#define PTB19_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 51, 0, 154, 5)
#define PTB20_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 52, 3, 0, 0)
#define PTB20_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 52, 0, 155, 5)
#define PTB21_FXIO_D4_O                         NXP_SIUL2_PINMUX(0, 0, 53, 3, 0, 0)
#define PTB21_FXIO_D4_I                         NXP_SIUL2_PINMUX(0, 0, 53, 0, 156, 5)
#define PTB22_FXIO_D15_O                        NXP_SIUL2_PINMUX(0, 0, 54, 6, 0, 0)
#define PTB22_FXIO_D15_I                        NXP_SIUL2_PINMUX(0, 0, 54, 0, 167, 5)
#define PTB23_FXIO_D4_O                         NXP_SIUL2_PINMUX(0, 0, 55, 3, 0, 0)
#define PTB23_FXIO_D4_I                         NXP_SIUL2_PINMUX(0, 0, 55, 0, 156, 6)
#define PTB24_FXIO_D5_O                         NXP_SIUL2_PINMUX(0, 0, 56, 3, 0, 0)
#define PTB24_FXIO_D5_I                         NXP_SIUL2_PINMUX(0, 0, 56, 0, 157, 6)
#define PTB25_FXIO_D6_O                         NXP_SIUL2_PINMUX(0, 0, 57, 3, 0, 0)
#define PTB25_FXIO_D6_I                         NXP_SIUL2_PINMUX(0, 0, 57, 0, 158, 5)
#define PTB26_FXIO_D7_O                         NXP_SIUL2_PINMUX(0, 0, 58, 3, 0, 0)
#define PTB26_FXIO_D7_I                         NXP_SIUL2_PINMUX(0, 0, 58, 0, 159, 6)
#define PTB27_FXIO_D8_O                         NXP_SIUL2_PINMUX(0, 0, 59, 3, 0, 0)
#define PTB27_FXIO_D8_I                         NXP_SIUL2_PINMUX(0, 0, 59, 0, 160, 2)
#define PTB28_FXIO_D9_O                         NXP_SIUL2_PINMUX(0, 0, 60, 3, 0, 0)
#define PTB28_FXIO_D9_I                         NXP_SIUL2_PINMUX(0, 0, 60, 0, 161, 2)
#define PTB29_FXIO_D10_O                        NXP_SIUL2_PINMUX(0, 0, 61, 3, 0, 0)
#define PTB29_FXIO_D10_I                        NXP_SIUL2_PINMUX(0, 0, 61, 0, 162, 2)
#define PTC1_FXIO_D5_O                          NXP_SIUL2_PINMUX(0, 0, 65, 4, 0, 0)
#define PTC1_FXIO_D5_I                          NXP_SIUL2_PINMUX(0, 0, 65, 0, 157, 7)
#define PTC4_FXIO_D5_O                          NXP_SIUL2_PINMUX(0, 0, 68, 4, 0, 0)
#define PTC4_FXIO_D5_I                          NXP_SIUL2_PINMUX(0, 0, 68, 0, 157, 8)
#define PTC5_FXIO_D4_O                          NXP_SIUL2_PINMUX(0, 0, 69, 4, 0, 0)
#define PTC5_FXIO_D4_I                          NXP_SIUL2_PINMUX(0, 0, 69, 0, 156, 7)
#define PTC6_FXIO_D11                           NXP_SIUL2_PINMUX(0, 0, 70, 0, 163, 3)
#define PTC7_FXIO_D10                           NXP_SIUL2_PINMUX(0, 0, 71, 0, 162, 3)
#define PTC8_FXIO_D12_O                         NXP_SIUL2_PINMUX(0, 0, 72, 7, 0, 0)
#define PTC8_FXIO_D12_I                         NXP_SIUL2_PINMUX(0, 0, 72, 0, 164, 3)
#define PTC9_FXIO_D13_O                         NXP_SIUL2_PINMUX(0, 0, 73, 7, 0, 0)
#define PTC9_FXIO_D13_I                         NXP_SIUL2_PINMUX(0, 0, 73, 0, 165, 3)
#define PTC10_FXIO_D18_O                        NXP_SIUL2_PINMUX(0, 0, 74, 12, 0, 0)
#define PTC10_FXIO_D18_I                        NXP_SIUL2_PINMUX(0, 0, 74, 0, 170, 5)
#define PTC11_FXIO_D15_O                        NXP_SIUL2_PINMUX(0, 0, 75, 4, 0, 0)
#define PTC11_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 75, 6, 0, 0)
#define PTC11_FXIO_D15_I                        NXP_SIUL2_PINMUX(0, 0, 75, 0, 167, 3)
#define PTC11_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 75, 0, 171, 3)
#define PTC12_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 76, 5, 0, 0)
#define PTC12_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 76, 0, 171, 5)
#define PTC13_FXIO_D16_O                        NXP_SIUL2_PINMUX(0, 0, 77, 5, 0, 0)
#define PTC13_FXIO_D16_I                        NXP_SIUL2_PINMUX(0, 0, 77, 0, 168, 3)
#define PTC14_FXIO_D16_O                        NXP_SIUL2_PINMUX(0, 0, 78, 7, 0, 0)
#define PTC14_FXIO_D16_I                        NXP_SIUL2_PINMUX(0, 0, 78, 0, 168, 1)
#define PTC15_FXIO_D18_O                        NXP_SIUL2_PINMUX(0, 0, 79, 8, 0, 0)
#define PTC15_FXIO_D18_I                        NXP_SIUL2_PINMUX(0, 0, 79, 0, 170, 6)
#define PTC16_FXIO_D15_O                        NXP_SIUL2_PINMUX(0, 0, 80, 6, 0, 0)
#define PTC16_FXIO_D15_I                        NXP_SIUL2_PINMUX(0, 0, 80, 0, 167, 1)
#define PTC17_FXIO_D14_O                        NXP_SIUL2_PINMUX(0, 0, 81, 6, 0, 0)
#define PTC17_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 81, 7, 0, 0)
#define PTC17_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 81, 0, 154, 10)
#define PTC17_FXIO_D14_I                        NXP_SIUL2_PINMUX(0, 0, 81, 0, 166, 1)
#define PTC18_FXIO_D6_O                         NXP_SIUL2_PINMUX(0, 0, 82, 2, 0, 0)
#define PTC18_FXIO_D12_O                        NXP_SIUL2_PINMUX(0, 0, 82, 3, 0, 0)
#define PTC18_FXIO_D6_I                         NXP_SIUL2_PINMUX(0, 0, 82, 0, 158, 9)
#define PTC18_FXIO_D12_I                        NXP_SIUL2_PINMUX(0, 0, 82, 0, 164, 2)
#define PTC19_FXIO_D13_O                        NXP_SIUL2_PINMUX(0, 0, 83, 3, 0, 0)
#define PTC19_FXIO_D13_I                        NXP_SIUL2_PINMUX(0, 0, 83, 0, 165, 2)
#define PTC20_FXIO_D14_O                        NXP_SIUL2_PINMUX(0, 0, 84, 3, 0, 0)
#define PTC20_FXIO_D14_I                        NXP_SIUL2_PINMUX(0, 0, 84, 0, 166, 2)
#define PTC21_FXIO_D15_O                        NXP_SIUL2_PINMUX(0, 0, 85, 3, 0, 0)
#define PTC21_FXIO_D15_I                        NXP_SIUL2_PINMUX(0, 0, 85, 0, 167, 2)
#define PTC23_FXIO_D16_O                        NXP_SIUL2_PINMUX(0, 0, 87, 3, 0, 0)
#define PTC23_FXIO_D16_I                        NXP_SIUL2_PINMUX(0, 0, 87, 0, 168, 2)
#define PTC24_FXIO_D17_O                        NXP_SIUL2_PINMUX(0, 0, 88, 3, 0, 0)
#define PTC24_FXIO_D17_I                        NXP_SIUL2_PINMUX(0, 0, 88, 0, 169, 2)
#define PTC25_FXIO_D18_O                        NXP_SIUL2_PINMUX(0, 0, 89, 3, 0, 0)
#define PTC25_FXIO_D18_I                        NXP_SIUL2_PINMUX(0, 0, 89, 0, 170, 2)
#define PTC26_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 90, 3, 0, 0)
#define PTC26_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 90, 0, 171, 2)
#define PTC27_FXIO_D20_O                        NXP_SIUL2_PINMUX(0, 0, 91, 3, 0, 0)
#define PTC27_FXIO_D20_I                        NXP_SIUL2_PINMUX(0, 0, 91, 0, 172, 2)
#define PTC28_FXIO_D21_O                        NXP_SIUL2_PINMUX(0, 0, 92, 3, 0, 0)
#define PTC28_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 92, 4, 0, 0)
#define PTC28_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 92, 0, 154, 7)
#define PTC28_FXIO_D21_I                        NXP_SIUL2_PINMUX(0, 0, 92, 0, 173, 2)
#define PTC29_FXIO_D22_O                        NXP_SIUL2_PINMUX(0, 0, 93, 3, 0, 0)
#define PTC29_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 93, 7, 0, 0)
#define PTC29_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 93, 0, 155, 6)
#define PTC29_FXIO_D22_I                        NXP_SIUL2_PINMUX(0, 0, 93, 0, 174, 2)
#define PTC30_FXIO_D0_O                         NXP_SIUL2_PINMUX(0, 0, 94, 3, 0, 0)
#define PTC30_FXIO_D23_O                        NXP_SIUL2_PINMUX(0, 0, 94, 7, 0, 0)
#define PTC30_FXIO_D0_I                         NXP_SIUL2_PINMUX(0, 0, 94, 0, 152, 4)
#define PTC30_FXIO_D23_I                        NXP_SIUL2_PINMUX(0, 0, 94, 0, 175, 2)
#define PTC31_FXIO_D1_O                         NXP_SIUL2_PINMUX(0, 0, 95, 3, 0, 0)
#define PTC31_FXIO_D24_O                        NXP_SIUL2_PINMUX(0, 0, 95, 7, 0, 0)
#define PTC31_FXIO_D1_I                         NXP_SIUL2_PINMUX(0, 0, 95, 0, 153, 4)
#define PTC31_FXIO_D24_I                        NXP_SIUL2_PINMUX(0, 0, 95, 0, 176, 2)
#define PTD0_FXIO_D0_O                          NXP_SIUL2_PINMUX(0, 0, 96, 6, 0, 0)
#define PTD0_FXIO_D0_I                          NXP_SIUL2_PINMUX(0, 0, 96, 0, 152, 1)
#define PTD1_FXIO_D1_O                          NXP_SIUL2_PINMUX(0, 0, 97, 6, 0, 0)
#define PTD1_FXIO_D1_I                          NXP_SIUL2_PINMUX(0, 0, 97, 0, 153, 1)
#define PTD2_FXIO_D4_O                          NXP_SIUL2_PINMUX(0, 0, 98, 4, 0, 0)
#define PTD2_FXIO_D6_O                          NXP_SIUL2_PINMUX(0, 0, 98, 5, 0, 0)
#define PTD2_FXIO_D4_I                          NXP_SIUL2_PINMUX(0, 0, 98, 0, 156, 1)
#define PTD2_FXIO_D6_I                          NXP_SIUL2_PINMUX(0, 0, 98, 0, 158, 3)
#define PTD3_FXIO_D5_O                          NXP_SIUL2_PINMUX(0, 0, 99, 4, 0, 0)
#define PTD3_FXIO_D7_O                          NXP_SIUL2_PINMUX(0, 0, 99, 5, 0, 0)
#define PTD3_FXIO_D5_I                          NXP_SIUL2_PINMUX(0, 0, 99, 0, 157, 2)
#define PTD3_FXIO_D7_I                          NXP_SIUL2_PINMUX(0, 0, 99, 0, 159, 3)
#define PTD5_FXIO_D15_O                         NXP_SIUL2_PINMUX(0, 0, 101, 6, 0, 0)
#define PTD5_FXIO_D15_I                         NXP_SIUL2_PINMUX(0, 0, 101, 0, 167, 4)
#define PTD6_FXIO_D3_O                          NXP_SIUL2_PINMUX(0, 0, 102, 2, 0, 0)
#define PTD6_FXIO_D13_O                         NXP_SIUL2_PINMUX(0, 0, 102, 6, 0, 0)
#define PTD6_FXIO_D3_I                          NXP_SIUL2_PINMUX(0, 0, 102, 0, 155, 9)
#define PTD6_FXIO_D13_I                         NXP_SIUL2_PINMUX(0, 0, 102, 0, 165, 1)
#define PTD8_FXIO_D1_O                          NXP_SIUL2_PINMUX(0, 0, 104, 5, 0, 0)
#define PTD8_FXIO_D11_O                         NXP_SIUL2_PINMUX(0, 0, 104, 7, 0, 0)
#define PTD8_FXIO_D1_I                          NXP_SIUL2_PINMUX(0, 0, 104, 0, 153, 5)
#define PTD8_FXIO_D11_I                         NXP_SIUL2_PINMUX(0, 0, 104, 0, 163, 5)
#define PTD9_FXIO_D0_O                          NXP_SIUL2_PINMUX(0, 0, 105, 3, 0, 0)
#define PTD9_FXIO_D10_O                         NXP_SIUL2_PINMUX(0, 0, 105, 7, 0, 0)
#define PTD9_FXIO_D0_I                          NXP_SIUL2_PINMUX(0, 0, 105, 0, 152, 5)
#define PTD9_FXIO_D10_I                         NXP_SIUL2_PINMUX(0, 0, 105, 0, 162, 4)
#define PTD13_FXIO_D7_O                         NXP_SIUL2_PINMUX(0, 0, 109, 3, 0, 0)
#define PTD13_FXIO_D7_I                         NXP_SIUL2_PINMUX(0, 0, 109, 0, 159, 7)
#define PTD15_FXIO_D6_O                         NXP_SIUL2_PINMUX(0, 0, 111, 1, 0, 0)
#define PTD15_FXIO_D10_O                        NXP_SIUL2_PINMUX(0, 0, 111, 7, 0, 0)
#define PTD15_FXIO_D6_I                         NXP_SIUL2_PINMUX(0, 0, 111, 0, 158, 7)
#define PTD15_FXIO_D10_I                        NXP_SIUL2_PINMUX(0, 0, 111, 0, 162, 1)
#define PTD17_FXIO_D9_O                         NXP_SIUL2_PINMUX(0, 0, 113, 6, 0, 0)
#define PTD17_FXIO_D9_I                         NXP_SIUL2_PINMUX(0, 0, 113, 0, 161, 1)
#define PTD18_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 114, 3, 0, 0)
#define PTD18_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 114, 0, 154, 4)
#define PTD19_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 115, 3, 0, 0)
#define PTD19_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 115, 0, 155, 4)
#define PTD20_FXIO_D25_O                        NXP_SIUL2_PINMUX(0, 0, 116, 3, 0, 0)
#define PTD20_FXIO_D25_I                        NXP_SIUL2_PINMUX(0, 0, 116, 0, 177, 2)
#define PTD21_FXIO_D26_O                        NXP_SIUL2_PINMUX(0, 0, 117, 3, 0, 0)
#define PTD21_FXIO_D26_I                        NXP_SIUL2_PINMUX(0, 0, 117, 0, 178, 2)
#define PTD22_FXIO_D27_O                        NXP_SIUL2_PINMUX(0, 0, 118, 3, 0, 0)
#define PTD22_FXIO_D27_I                        NXP_SIUL2_PINMUX(0, 0, 118, 0, 179, 2)
#define PTD23_FXIO_D28_O                        NXP_SIUL2_PINMUX(0, 0, 119, 3, 0, 0)
#define PTD23_FXIO_D28_I                        NXP_SIUL2_PINMUX(0, 0, 119, 0, 180, 2)
#define PTD24_FXIO_D29_O                        NXP_SIUL2_PINMUX(0, 0, 120, 3, 0, 0)
#define PTD24_FXIO_D29_I                        NXP_SIUL2_PINMUX(0, 0, 120, 0, 181, 2)
#define PTD26_FXIO_D7                           NXP_SIUL2_PINMUX(0, 0, 122, 0, 159, 4)
#define PTD26_FXIO_D30                          NXP_SIUL2_PINMUX(0, 0, 122, 0, 182, 2)
#define PTD27_FXIO_D31                          NXP_SIUL2_PINMUX(0, 0, 123, 0, 183, 2)
#define PTD31_FXIO_D6_O                         NXP_SIUL2_PINMUX(0, 0, 127, 3, 0, 0)
#define PTD31_FXIO_D6_I                         NXP_SIUL2_PINMUX(0, 0, 127, 0, 158, 4)
#define PTE0_FXIO_D3_O                          NXP_SIUL2_PINMUX(0, 0, 128, 3, 0, 0)
#define PTE0_FXIO_D3_I                          NXP_SIUL2_PINMUX(0, 0, 128, 0, 155, 7)
#define PTE1_FXIO_D2_O                          NXP_SIUL2_PINMUX(0, 0, 129, 3, 0, 0)
#define PTE1_FXIO_D2_I                          NXP_SIUL2_PINMUX(0, 0, 129, 0, 154, 8)
#define PTE2_FXIO_D13                           NXP_SIUL2_PINMUX(0, 0, 130, 0, 165, 4)
#define PTE4_FXIO_D6_O                          NXP_SIUL2_PINMUX(0, 0, 132, 6, 0, 0)
#define PTE4_FXIO_D6_I                          NXP_SIUL2_PINMUX(0, 0, 132, 0, 158, 1)
#define PTE5_FXIO_D7_O                          NXP_SIUL2_PINMUX(0, 0, 133, 6, 0, 0)
#define PTE5_FXIO_D7_I                          NXP_SIUL2_PINMUX(0, 0, 133, 0, 159, 1)
#define PTE6_FXIO_D12                           NXP_SIUL2_PINMUX(0, 0, 134, 0, 164, 4)
#define PTE7_FXIO_D11_O                         NXP_SIUL2_PINMUX(0, 0, 135, 7, 0, 0)
#define PTE7_FXIO_D11_I                         NXP_SIUL2_PINMUX(0, 0, 135, 0, 163, 4)
#define PTE8_FXIO_D12_O                         NXP_SIUL2_PINMUX(0, 0, 136, 4, 0, 0)
#define PTE8_FXIO_D8_O                          NXP_SIUL2_PINMUX(0, 0, 136, 7, 0, 0)
#define PTE8_FXIO_D8_I                          NXP_SIUL2_PINMUX(0, 0, 136, 0, 160, 5)
#define PTE8_FXIO_D12_I                         NXP_SIUL2_PINMUX(0, 0, 136, 0, 164, 1)
#define PTE9_FXIO_D11_O                         NXP_SIUL2_PINMUX(0, 0, 137, 7, 0, 0)
#define PTE9_FXIO_D11_I                         NXP_SIUL2_PINMUX(0, 0, 137, 0, 163, 1)
#define PTE10_FXIO_D4_O                         NXP_SIUL2_PINMUX(0, 0, 138, 6, 0, 0)
#define PTE10_FXIO_D4_I                         NXP_SIUL2_PINMUX(0, 0, 138, 0, 156, 2)
#define PTE11_FXIO_D5_O                         NXP_SIUL2_PINMUX(0, 0, 139, 6, 0, 0)
#define PTE11_FXIO_D5_I                         NXP_SIUL2_PINMUX(0, 0, 139, 0, 157, 1)
#define PTE14_FXIO_D7_O                         NXP_SIUL2_PINMUX(0, 0, 142, 6, 0, 0)
#define PTE14_FXIO_D7_I                         NXP_SIUL2_PINMUX(0, 0, 142, 0, 159, 5)
#define PTE15_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 143, 6, 0, 0)
#define PTE15_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 143, 0, 154, 1)
#define PTE16_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 144, 6, 0, 0)
#define PTE16_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 144, 0, 155, 2)
#define PTE17_FXIO_D5                           NXP_SIUL2_PINMUX(0, 0, 145, 0, 157, 4)
#define PTE18_FXIO_D4                           NXP_SIUL2_PINMUX(0, 0, 146, 0, 156, 4)
#define PTF4_FXIO_D0_O                          NXP_SIUL2_PINMUX(0, 0, 164, 4, 0, 0)
#define PTF4_FXIO_D0_I                          NXP_SIUL2_PINMUX(0, 0, 164, 0, 152, 7)
#define PTF7_FXIO_D1_O                          NXP_SIUL2_PINMUX(0, 0, 167, 4, 0, 0)
#define PTF7_FXIO_D1_I                          NXP_SIUL2_PINMUX(0, 0, 167, 0, 153, 8)
#define PTF8_FXIO_D2_O                          NXP_SIUL2_PINMUX(0, 0, 168, 4, 0, 0)
#define PTF8_FXIO_D2_I                          NXP_SIUL2_PINMUX(0, 0, 168, 0, 154, 9)
#define PTF14_FXIO_D3_O                         NXP_SIUL2_PINMUX(0, 0, 174, 5, 0, 0)
#define PTF14_FXIO_D3_I                         NXP_SIUL2_PINMUX(0, 0, 174, 0, 155, 8)
#define PTF20_FXIO_D4_O                         NXP_SIUL2_PINMUX(0, 0, 180, 7, 0, 0)
#define PTF20_FXIO_D4_I                         NXP_SIUL2_PINMUX(0, 0, 180, 0, 156, 8)
#define PTF21_FXIO_D5_O                         NXP_SIUL2_PINMUX(0, 0, 181, 7, 0, 0)
#define PTF21_FXIO_D5_I                         NXP_SIUL2_PINMUX(0, 0, 181, 0, 157, 11)
#define PTF25_FXIO_D6_O                         NXP_SIUL2_PINMUX(0, 0, 185, 7, 0, 0)
#define PTF25_FXIO_D6_I                         NXP_SIUL2_PINMUX(0, 0, 185, 0, 158, 10)
#define PTF28_FXIO_D7_O                         NXP_SIUL2_PINMUX(0, 0, 188, 4, 0, 0)
#define PTF28_FXIO_D7_I                         NXP_SIUL2_PINMUX(0, 0, 188, 0, 159, 8)
#define PTF29_FXIO_D8_O                         NXP_SIUL2_PINMUX(0, 0, 189, 7, 0, 0)
#define PTF29_FXIO_D8_I                         NXP_SIUL2_PINMUX(0, 0, 189, 0, 160, 6)
#define PTF31_FXIO_D9_O                         NXP_SIUL2_PINMUX(0, 0, 191, 6, 0, 0)
#define PTF31_FXIO_D9_I                         NXP_SIUL2_PINMUX(0, 0, 191, 0, 161, 5)
#define PTG6_FXIO_D10_O                         NXP_SIUL2_PINMUX(0, 0, 198, 2, 0, 0)
#define PTG6_FXIO_D10_I                         NXP_SIUL2_PINMUX(0, 0, 198, 0, 162, 5)
#define PTG7_FXIO_D11_O                         NXP_SIUL2_PINMUX(0, 0, 199, 2, 0, 0)
#define PTG7_FXIO_D11_I                         NXP_SIUL2_PINMUX(0, 0, 199, 0, 163, 7)
#define PTG8_FXIO_D12_O                         NXP_SIUL2_PINMUX(0, 0, 200, 2, 0, 0)
#define PTG8_FXIO_D12_I                         NXP_SIUL2_PINMUX(0, 0, 200, 0, 164, 5)
#define PTG13_FXIO_D13_O                        NXP_SIUL2_PINMUX(0, 0, 205, 2, 0, 0)
#define PTG13_FXIO_D13_I                        NXP_SIUL2_PINMUX(0, 0, 205, 0, 165, 5)
#define PTG15_FXIO_D14_O                        NXP_SIUL2_PINMUX(0, 0, 207, 2, 0, 0)
#define PTG15_FXIO_D14_I                        NXP_SIUL2_PINMUX(0, 0, 207, 0, 166, 5)
#define PTG16_FXIO_D15_O                        NXP_SIUL2_PINMUX(0, 0, 208, 3, 0, 0)
#define PTG16_FXIO_D15_I                        NXP_SIUL2_PINMUX(0, 0, 208, 0, 167, 6)
#define PTG17_FXIO_D16_O                        NXP_SIUL2_PINMUX(0, 0, 209, 3, 0, 0)
#define PTG17_FXIO_D16_I                        NXP_SIUL2_PINMUX(0, 0, 209, 0, 168, 4)
#define PTG18_FXIO_D17_O                        NXP_SIUL2_PINMUX(0, 0, 210, 3, 0, 0)
#define PTG18_FXIO_D17_I                        NXP_SIUL2_PINMUX(0, 0, 210, 0, 169, 3)
#define PTG19_FXIO_D18_O                        NXP_SIUL2_PINMUX(0, 0, 211, 3, 0, 0)
#define PTG19_FXIO_D18_I                        NXP_SIUL2_PINMUX(0, 0, 211, 0, 170, 3)
