zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
#define PTG20_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 212, 3, 0, 0)
#define PTG20_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 212, 0, 171, 6)
#define PTG21_FXIO_D20_O                        NXP_SIUL2_PINMUX(0, 0, 213, 3, 0, 0)
#define PTG21_FXIO_D20_I                        NXP_SIUL2_PINMUX(0, 0, 213, 0, 172, 3)
#define PTG22_FXIO_D21                          NXP_SIUL2_PINMUX(0, 0, 214, 3, 0, 0)
#define PTG22_FXIO_D21                          NXP_SIUL2_PINMUX(0, 0, 214, 0, 173, 3)
#define PTG23_FXIO_D22                          NXP_SIUL2_PINMUX(0, 0, 215, 3, 0, 0)
#define PTG23_FXIO_D22                          NXP_SIUL2_PINMUX(0, 0, 215, 0, 174, 3)
#define PTG24_FXIO_D23                          NXP_SIUL2_PINMUX(0, 0, 216, 3, 0, 0)
#define PTG24_FXIO_D23                          NXP_SIUL2_PINMUX(0, 0, 216, 0, 175, 3)
#define PTG25_FXIO_D24                          NXP_SIUL2_PINMUX(0, 0, 217, 3, 0, 0)
#define PTG25_FXIO_D24                          NXP_SIUL2_PINMUX(0, 0, 217, 0, 176, 3)
#define PTG26_FXIO_D25                          NXP_SIUL2_PINMUX(0, 0, 218, 3, 0, 0)
#define PTG26_FXIO_D25                          NXP_SIUL2_PINMUX(0, 0, 218, 0, 177, 3)
#define PTG27_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 219, 3, 0, 0)
#define PTG27_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 219, 0, 178, 3)
#define PTH7_FXIO_D23                           NXP_SIUL2_PINMUX(0, 0, 231, 3, 0, 0)
#define PTH7_FXIO_D23                           NXP_SIUL2_PINMUX(0, 0, 231, 0, 175, 4)
#define PTH8_FXIO_D24                           NXP_SIUL2_PINMUX(0, 0, 232, 3, 0, 0)
#define PTH8_FXIO_D24                           NXP_SIUL2_PINMUX(0, 0, 232, 0, 176, 4)
#define PTH9_FXIO_D25                           NXP_SIUL2_PINMUX(0, 0, 233, 3, 0, 0)
#define PTH9_FXIO_D25                           NXP_SIUL2_PINMUX(0, 0, 233, 0, 177, 4)
#define PTH10_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 234, 3, 0, 0)
#define PTH10_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 234, 0, 178, 4)
#define PTH11_FXIO_D27                          NXP_SIUL2_PINMUX(0, 0, 235, 3, 0, 0)
#define PTH11_FXIO_D27                          NXP_SIUL2_PINMUX(0, 0, 235, 0, 179, 3)
#define PTH12_FXIO_D28                          NXP_SIUL2_PINMUX(0, 0, 236, 3, 0, 0)
#define PTH12_FXIO_D28                          NXP_SIUL2_PINMUX(0, 0, 236, 0, 180, 3)
#define PTG22_FXIO_D21                          NXP_SIUL2_PINMUX(0, 0, 236, 0, 173, 3)
#define PTG23_FXIO_D22                          NXP_SIUL2_PINMUX(0, 0, 215, 3, 0, 0)
#define PTG23_FXIO_D22                          NXP_SIUL2_PINMUX(0, 0, 215, 0, 174, 3)
#define PTG24_FXIO_D23                          NXP_SIUL2_PINMUX(0, 0, 216, 3, 0, 0)
#define PTG24_FXIO_D23                          NXP_SIUL2_PINMUX(0, 0, 216, 0, 175, 3)
#define PTG25_FXIO_D24                          NXP_SIUL2_PINMUX(0, 0, 217, 3, 0, 0)
#define PTG25_FXIO_D24                          NXP_SIUL2_PINMUX(0, 0, 217, 0, 176, 3)
#define PTG26_FXIO_D25                          NXP_SIUL2_PINMUX(0, 0, 218, 3, 0, 0)
#define PTG26_FXIO_D25                          NXP_SIUL2_PINMUX(0, 0, 218, 0, 177, 3)
#define PTG27_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 219, 3, 0, 0)
#define PTG27_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 219, 0, 178, 3)
#define PTH7_FXIO_D23                           NXP_SIUL2_PINMUX(0, 0, 231, 3, 0, 0)
#define PTH7_FXIO_D23                           NXP_SIUL2_PINMUX(0, 0, 231, 0, 175, 4)
#define PTH8_FXIO_D24                           NXP_SIUL2_PINMUX(0, 0, 232, 3, 0, 0)
#define PTH8_FXIO_D24                           NXP_SIUL2_PINMUX(0, 0, 232, 0, 176, 4)
#define PTH9_FXIO_D25                           NXP_SIUL2_PINMUX(0, 0, 233, 3, 0, 0)
#define PTH9_FXIO_D25                           NXP_SIUL2_PINMUX(0, 0, 233, 0, 177, 4)
#define PTH10_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 234, 3, 0, 0)
#define PTH10_FXIO_D26                          NXP_SIUL2_PINMUX(0, 0, 234, 0, 178, 4)
#define PTH11_FXIO_D27                          NXP_SIUL2_PINMUX(0, 0, 235, 3, 0, 0)
#define PTH11_FXIO_D27                          NXP_SIUL2_PINMUX(0, 0, 235, 0, 179, 3)
#define PTH12_FXIO_D28                          NXP_SIUL2_PINMUX(0, 0, 236, 3, 0, 0)
#define PTH12_FXIO_D28                          NXP_SIUL2_PINMUX(0, 0, 236, 0, 180, 3)

/* LPSPI0 */
#define PTA0_LPSPI0_PCS7                        NXP_SIUL2_PINMUX(0, 0, 0, 0, 228, 1)
#define PTA1_LPSPI0_PCS6                        NXP_SIUL2_PINMUX(0, 0, 1, 0, 227, 1)
#define PTA7_LPSPI0_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 7, 2, 0, 0)
#define PTA7_LPSPI0_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 7, 0, 222, 3)
#define PTA15_LPSPI0_PCS3                       NXP_SIUL2_PINMUX(0, 0, 15, 0, 224, 1)
#define PTA16_LPSPI0_PCS4                       NXP_SIUL2_PINMUX(0, 0, 16, 0, 225, 1)
#define PTA26_LPSPI0_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 26, 4, 0, 0)
#define PTA26_LPSPI0_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 26, 0, 221, 3)
#define PTA30_LPSPI0_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 30, 4, 0, 0)
#define PTA30_LPSPI0_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 30, 0, 231, 4)
#define PTA31_LPSPI0_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 31, 4, 0, 0)
#define PTA31_LPSPI0_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 31, 0, 222, 2)
#define PTB0_LPSPI0_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 32, 3, 0, 0)
#define PTB0_LPSPI0_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 32, 0, 221, 1)
#define PTB1_LPSPI0_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 33, 3, 0, 0)
#define PTB1_LPSPI0_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 33, 0, 231, 3)
#define PTB4_LPSPI0_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 36, 3, 0, 0)
#define PTB4_LPSPI0_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 36, 0, 231, 2)
#define PTB5_LPSPI0_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 37, 3, 0, 0)
#define PTB5_LPSPI0_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 37, 4, 0, 0)
#define PTB5_LPSPI0_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 37, 0, 221, 2)
#define PTB5_LPSPI0_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 37, 0, 222, 1)
#define PTB8_LPSPI0_PCS5                        NXP_SIUL2_PINMUX(0, 0, 40, 0, 226, 1)
#define PTC2_LPSPI0_PCS2_O                      NXP_SIUL2_PINMUX(0, 0, 66, 4, 0, 0)
#define PTC2_LPSPI0_PCS2_I                      NXP_SIUL2_PINMUX(0, 0, 66, 0, 223, 2)
#define PTC6_LPSPI0_PCS1                        NXP_SIUL2_PINMUX(0, 0, 70, 0, 222, 4)
#define PTC7_LPSPI0_PCS0                        NXP_SIUL2_PINMUX(0, 0, 71, 0, 221, 6)
#define PTC8_LPSPI0_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 72, 6, 0, 0)
#define PTC8_LPSPI0_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 72, 0, 229, 1)
#define PTC9_LPSPI0_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 73, 6, 0, 0)
#define PTC9_LPSPI0_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 73, 0, 230, 2)
#define PTD5_LPSPI0_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 101, 7, 0, 0)
#define PTD5_LPSPI0_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 101, 0, 222, 5)
#define PTD6_LPSPI0_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 102, 7, 0, 0)
#define PTD6_LPSPI0_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 102, 0, 221, 7)
#define PTD7_LPSPI0_PCS3_O                      NXP_SIUL2_PINMUX(0, 0, 103, 4, 0, 0)
#define PTD7_LPSPI0_PCS3_I                      NXP_SIUL2_PINMUX(0, 0, 103, 0, 224, 2)
#define PTD10_LPSPI0_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 106, 5, 0, 0)
#define PTD10_LPSPI0_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 106, 0, 230, 4)
#define PTD11_LPSPI0_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 107, 6, 0, 0)
#define PTD11_LPSPI0_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 107, 0, 229, 5)
#define PTD12_LPSPI0_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 108, 6, 0, 0)
#define PTD12_LPSPI0_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 108, 0, 231, 5)
#define PTD15_LPSPI0_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 111, 4, 0, 0)
#define PTD15_LPSPI0_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 111, 0, 229, 3)
#define PTD16_LPSPI0_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 112, 4, 0, 0)
#define PTD16_LPSPI0_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 112, 0, 230, 3)
#define PTD20_LPSPI0_PCS6_O                     NXP_SIUL2_PINMUX(0, 0, 116, 13, 0, 0)
#define PTD20_LPSPI0_PCS6_I                     NXP_SIUL2_PINMUX(0, 0, 116, 0, 227, 2)
#define PTD21_LPSPI0_PCS7_O                     NXP_SIUL2_PINMUX(0, 0, 117, 14, 0, 0)
#define PTD21_LPSPI0_PCS7_I                     NXP_SIUL2_PINMUX(0, 0, 117, 0, 228, 2)
#define PTD23_LPSPI0_PCS4_O                     NXP_SIUL2_PINMUX(0, 0, 119, 11, 0, 0)
#define PTD23_LPSPI0_PCS4_I                     NXP_SIUL2_PINMUX(0, 0, 119, 0, 225, 2)
#define PTD24_LPSPI0_PCS5_O                     NXP_SIUL2_PINMUX(0, 0, 120, 12, 0, 0)
#define PTD24_LPSPI0_PCS5_I                     NXP_SIUL2_PINMUX(0, 0, 120, 0, 226, 2)
#define PTE0_LPSPI0_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 128, 2, 0, 0)
#define PTE0_LPSPI0_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 128, 0, 230, 1)
#define PTE1_LPSPI0_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 129, 2, 0, 0)
#define PTE1_LPSPI0_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 129, 0, 229, 2)
#define PTE2_LPSPI0_SOUT                        NXP_SIUL2_PINMUX(0, 0, 130, 0, 231, 1)
#define PTE4_LPSPI0_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 132, 1, 0, 0)
#define PTE4_LPSPI0_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 132, 0, 221, 5)
#define PTE6_LPSPI0_PCS2                        NXP_SIUL2_PINMUX(0, 0, 134, 0, 223, 1)
#define PTF28_LPSPI0_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 188, 5, 0, 0)
#define PTF28_LPSPI0_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 188, 0, 221, 4)

/* LPSPI4 */
#define PTA0_LPSPI4_PCS2                        NXP_SIUL2_PINMUX(0, 0, 0, 0, 257, 1)
#define PTA1_LPSPI4_PCS1                        NXP_SIUL2_PINMUX(0, 0, 1, 0, 256, 1)
#define PTA16_LPSPI4_PCS3                       NXP_SIUL2_PINMUX(0, 0, 16, 0, 258, 1)
#define PTB8_LPSPI4_PCS0                        NXP_SIUL2_PINMUX(0, 0, 40, 0, 255, 2)
#define PTB9_LPSPI4_SOUT                        NXP_SIUL2_PINMUX(0, 0, 41, 0, 261, 2)
#define PTB10_LPSPI4_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 42, 1, 0, 0)
#define PTB10_LPSPI4_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 42, 0, 259, 2)
#define PTB11_LPSPI4_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 43, 1, 0, 0)
#define PTB11_LPSPI4_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 43, 0, 260, 2)
#define PTC10_LPSPI4_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 74, 5, 0, 0)
#define PTC10_LPSPI4_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 74, 0, 255, 1)
#define PTC11_LPSPI4_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 75, 5, 0, 0)
#define PTC11_LPSPI4_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 75, 0, 261, 1)
#define PTC23_LPSPI4_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 87, 11, 0, 0)
#define PTC23_LPSPI4_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 87, 0, 257, 4)
#define PTC24_LPSPI4_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 88, 11, 0, 0)
#define PTC24_LPSPI4_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 88, 0, 258, 4)
#define PTC25_LPSPI4_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 89, 5, 0, 0)
#define PTC25_LPSPI4_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 89, 0, 256, 4)
#define PTC26_LPSPI4_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 90, 7, 0, 0)
#define PTC26_LPSPI4_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 90, 0, 260, 1)
#define PTC27_LPSPI4_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 91, 7, 0, 0)
#define PTC27_LPSPI4_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 91, 0, 259, 1)
#define PTE21_LPSPI4_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 149, 6, 0, 0)
#define PTE21_LPSPI4_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 149, 0, 260, 3)
#define PTE23_LPSPI4_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 151, 6, 0, 0)
#define PTE23_LPSPI4_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 151, 0, 255, 4)
#define PTF25_LPSPI4_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 185, 6, 0, 0)
#define PTF25_LPSPI4_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 185, 0, 255, 3)
#define PTF26_LPSPI4_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 186, 6, 0, 0)
#define PTF26_LPSPI4_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 186, 0, 256, 2)
#define PTF27_LPSPI4_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 187, 6, 0, 0)
#define PTF27_LPSPI4_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 187, 0, 257, 3)
#define PTF28_LPSPI4_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 188, 6, 0, 0)
#define PTF28_LPSPI4_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 188, 0, 258, 2)
#define PTG12_LPSPI4_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 204, 6, 0, 0)
#define PTG12_LPSPI4_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 204, 0, 258, 3)

