zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* LPUART0 */
#define PTA0_LPUART0_CTS                        NXP_SIUL2_PINMUX(0, 0, 0, 0, 360, 1)
#define PTA2_LPUART0_RX                         NXP_SIUL2_PINMUX(0, 0, 2, 0, 187, 1)
#define PTA3_LPUART0_TX_O                       NXP_SIUL2_PINMUX(0, 0, 3, 6, 0, 0)
#define PTA3_LPUART0_TX_I                       NXP_SIUL2_PINMUX(0, 0, 3, 0, 363, 1)
#define PTA6_LPUART0_RIN_B                      NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B                      NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTA17_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 17, 8, 0, 0)
#define PTA17_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 17, 0, 363, 6)
#define PTB0_LPUART0_RX                         NXP_SIUL2_PINMUX(0, 0, 32, 0, 187, 2)
#define PTB1_LPUART0_TX_O                       NXP_SIUL2_PINMUX(0, 0, 33, 2, 0, 0)
#define PTB1_LPUART0_TX_I                       NXP_SIUL2_PINMUX(0, 0, 33, 0, 363, 2)
#define PTB10_LPUART0_DTR_B                     NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B                     NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 44, 0, 187, 6)
#define PTB12_LPUART0_DCD_B                     NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 45, 8, 0, 0)
#define PTB13_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 45, 0, 363, 7)
#define PTB13_LPUART0_RIN_B                     NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTB16_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 48, 8, 0, 0)
#define PTB16_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 48, 0, 363, 8)
#define PTB17_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 49, 0, 187, 7)
#define PTC2_LPUART0_RX                         NXP_SIUL2_PINMUX(0, 0, 66, 0, 187, 3)
#define PTC3_LPUART0_TX_O                       NXP_SIUL2_PINMUX(0, 0, 67, 4, 0, 0)
#define PTC3_LPUART0_TX_I                       NXP_SIUL2_PINMUX(0, 0, 67, 0, 363, 3)
#define PTC8_LPUART0_CTS                        NXP_SIUL2_PINMUX(0, 0, 72, 0, 360, 2)
#define PTC9_LPUART0_RTS                        NXP_SIUL2_PINMUX(0, 0, 73, 3, 0, 0)
#define PTC10_LPUART0_DSR_B                     NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LPUART0_DTR_B                     NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PTD0_LPUART0_CTS                        NXP_SIUL2_PINMUX(0, 0, 96, 0, 360, 3)
#define PTD1_LPUART0_RTS                        NXP_SIUL2_PINMUX(0, 0, 97, 9, 0, 0)
#define PTD15_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 111, 0, 187, 8)
#define PTD16_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 112, 8, 0, 0)
#define PTD16_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 112, 0, 363, 9)
#define PTE7_LPUART0_RX                         NXP_SIUL2_PINMUX(0, 0, 135, 0, 187, 9)
#define PTE10_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 138, 0, 187, 10)
#define PTE11_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 139, 8, 0, 0)
#define PTE11_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 139, 0, 363, 10)
#define PTF20_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 180, 8, 0, 0)
#define PTF20_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 180, 0, 363, 11)
#define PTF21_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 181, 0, 187, 11)
#define PTH7_LPUART0_RX_I                       NXP_SIUL2_PINMUX(0, 0, 231, 0, 187, 13)
#define PTH7_LPUART0_RX_I                       NXP_SIUL2_PINMUX(0, 0, 231, 0, 187, 13)

/* FCCU */
#define PTA2_FCCU_ERR0                          NXP_SIUL2_PINMUX(0, 0, 2, 1, 0, 0)
#define PTA2_FCCU_ERR_IN0                       NXP_SIUL2_PINMUX(0, 0, 2, 0, 148, 1)
#define PTA3_FCCU_ERR1                          NXP_SIUL2_PINMUX(0, 0, 3, 1, 0, 0)
#define PTA3_FCCU_ERR_IN1                       NXP_SIUL2_PINMUX(0, 0, 3, 0, 149, 1)
#define PTE15_FCCU_ERR0                         NXP_SIUL2_PINMUX(0, 0, 143, 1, 0, 0)
#define PTE15_FCCU_ERR_IN0                      NXP_SIUL2_PINMUX(0, 0, 143, 0, 148, 2)
#define PTE16_FCCU_ERR1                         NXP_SIUL2_PINMUX(0, 0, 144, 1, 0, 0)
#define PTE16_FCCU_ERR_IN1                      NXP_SIUL2_PINMUX(0, 0, 144, 0, 149, 2)
#define PTF14_FCCU_ERR0                         NXP_SIUL2_PINMUX(0, 0, 174, 4, 0, 0)
#define PTF14_FCCU_ERR_IN0                      NXP_SIUL2_PINMUX(0, 0, 174, 0, 148, 3)
#define PTF15_FCCU_ERR1                         NXP_SIUL2_PINMUX(0, 0, 175, 5, 0, 0)
#define PTF15_FCCU_ERR_IN1                      NXP_SIUL2_PINMUX(0, 0, 175, 0, 149, 3)

/* LCU0 */
#define PTA2_LCU0_OUT3                          NXP_SIUL2_PINMUX(0, 0, 2, 6, 0, 0)
#define PTA2_LCU0_OUT0                          NXP_SIUL2_PINMUX(0, 0, 2, 9, 0, 0)
#define PTA3_LCU0_OUT2                          NXP_SIUL2_PINMUX(0, 0, 3, 4, 0, 0)
#define PTA3_LCU0_OUT3                          NXP_SIUL2_PINMUX(0, 0, 3, 13, 0, 0)
#define PTA8_LCU0_OUT8                          NXP_SIUL2_PINMUX(0, 0, 8, 11, 0, 0)
#define PTA9_LCU0_OUT9                          NXP_SIUL2_PINMUX(0, 0, 9, 12, 0, 0)
#define PTA18_LCU0_OUT0                         NXP_SIUL2_PINMUX(0, 0, 18, 8, 0, 0)
#define PTA19_LCU0_OUT1                         NXP_SIUL2_PINMUX(0, 0, 19, 9, 0, 0)
#define PTA20_LCU0_OUT2                         NXP_SIUL2_PINMUX(0, 0, 20, 8, 0, 0)
#define PTA23_LCU0_OUT0                         NXP_SIUL2_PINMUX(0, 0, 23, 12, 0, 0)
#define PTA24_LCU0_OUT8                         NXP_SIUL2_PINMUX(0, 0, 24, 9, 0, 0)
#define PTA25_LCU0_OUT9                         NXP_SIUL2_PINMUX(0, 0, 25, 10, 0, 0)
#define PTB10_LCU0_OUT9                         NXP_SIUL2_PINMUX(0, 0, 42, 6, 0, 0)
#define PTB11_LCU0_OUT8                         NXP_SIUL2_PINMUX(0, 0, 43, 5, 0, 0)
#define PTB12_LCU0_OUT2                         NXP_SIUL2_PINMUX(0, 0, 44, 6, 0, 0)
#define PTB12_LCU0_OUT8                         NXP_SIUL2_PINMUX(0, 0, 44, 11, 0, 0)
#define PTB13_LCU0_OUT3                         NXP_SIUL2_PINMUX(0, 0, 45, 5, 0, 0)
#define PTB13_LCU0_OUT9                         NXP_SIUL2_PINMUX(0, 0, 45, 10, 0, 0)
#define PTB13_LCU0_OUT1                         NXP_SIUL2_PINMUX(0, 0, 45, 13, 0, 0)
#define PTB14_LCU0_OUT7                         NXP_SIUL2_PINMUX(0, 0, 46, 4, 0, 0)
#define PTB14_LCU0_OUT11                        NXP_SIUL2_PINMUX(0, 0, 46, 11, 0, 0)
#define PTB14_LCU0_OUT3                         NXP_SIUL2_PINMUX(0, 0, 46, 13, 0, 0)
#define PTB15_LCU0_OUT2                         NXP_SIUL2_PINMUX(0, 0, 47, 11, 0, 0)
#define PTB16_LCU0_OUT5                         NXP_SIUL2_PINMUX(0, 0, 48, 12, 0, 0)
#define PTD2_LCU0_OUT1                          NXP_SIUL2_PINMUX(0, 0, 98, 1, 0, 0)
#define PTD2_LCU0_OUT5                          NXP_SIUL2_PINMUX(0, 0, 98, 9, 0, 0)
#define PTD3_LCU0_OUT0                          NXP_SIUL2_PINMUX(0, 0, 99, 6, 0, 0)
#define PTD3_LCU0_OUT4                          NXP_SIUL2_PINMUX(0, 0, 99, 9, 0, 0)
#define PTD4_LCU0_OUT6                          NXP_SIUL2_PINMUX(0, 0, 100, 5, 0, 0)
#define PTD20_LCU0_OUT4                         NXP_SIUL2_PINMUX(0, 0, 116, 11, 0, 0)
#define PTD21_LCU0_OUT4                         NXP_SIUL2_PINMUX(0, 0, 117, 5, 0, 0)
#define PTD21_LCU0_OUT10                        NXP_SIUL2_PINMUX(0, 0, 117, 9, 0, 0)
#define PTD21_LCU0_OUT0                         NXP_SIUL2_PINMUX(0, 0, 117, 12, 0, 0)
#define PTD22_LCU0_OUT5                         NXP_SIUL2_PINMUX(0, 0, 118, 6, 0, 0)
#define PTD22_LCU0_OUT7                         NXP_SIUL2_PINMUX(0, 0, 118, 10, 0, 0)
#define PTD23_LCU0_OUT10                        NXP_SIUL2_PINMUX(0, 0, 119, 6, 0, 0)
#define PTD23_LCU0_OUT2                         NXP_SIUL2_PINMUX(0, 0, 119, 9, 0, 0)
#define PTD24_LCU0_OUT11                        NXP_SIUL2_PINMUX(0, 0, 120, 6, 0, 0)
#define PTD24_LCU0_OUT1                         NXP_SIUL2_PINMUX(0, 0, 120, 10, 0, 0)
#define PTD30_LCU0_OUT8                         NXP_SIUL2_PINMUX(0, 0, 126, 5, 0, 0)
#define PTD31_LCU0_OUT9                         NXP_SIUL2_PINMUX(0, 0, 127, 5, 0, 0)
#define PTE0_LCU0_OUT11                         NXP_SIUL2_PINMUX(0, 0, 128, 10, 0, 0)
#define PTE4_LCU0_OUT7                          NXP_SIUL2_PINMUX(0, 0, 132, 9, 0, 0)
#define PTE5_LCU0_OUT6                          NXP_SIUL2_PINMUX(0, 0, 133, 9, 0, 0)
#define PTE10_LCU0_OUT5                         NXP_SIUL2_PINMUX(0, 0, 138, 8, 0, 0)
#define PTE11_LCU0_OUT4                         NXP_SIUL2_PINMUX(0, 0, 139, 9, 0, 0)
#define PTE16_LCU0_OUT3                         NXP_SIUL2_PINMUX(0, 0, 144, 8, 0, 0)
#define PTE26_LCU0_OUT10                        NXP_SIUL2_PINMUX(0, 0, 154, 12, 0, 0)
#define PTF14_LCU0_OUT4                         NXP_SIUL2_PINMUX(0, 0, 174, 11, 0, 0)
#define PTF15_LCU0_OUT6                         NXP_SIUL2_PINMUX(0, 0, 175, 11, 0, 0)
#define PTF16_LCU0_OUT7                         NXP_SIUL2_PINMUX(0, 0, 176, 11, 0, 0)
#define PTF20_LCU0_OUT5                         NXP_SIUL2_PINMUX(0, 0, 180, 12, 0, 0)
#define PTG4_LCU0_OUT2                          NXP_SIUL2_PINMUX(0, 0, 196, 10, 0, 0)
#define PTG5_LCU0_OUT3                          NXP_SIUL2_PINMUX(0, 0, 197, 10, 0, 0)
#define PTG8_LCU0_OUT1                          NXP_SIUL2_PINMUX(0, 0, 200, 12, 0, 0)

/* LPSPI5 */
#define PTA2_LPSPI5_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 2, 7, 0, 0)
#define PTA2_LPSPI5_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 2, 0, 267, 2)
#define PTA3_LPSPI5_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 3, 7, 0, 0)
#define PTA3_LPSPI5_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 3, 0, 266, 2)
#define PTA14_LPSPI5_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 14, 7, 0, 0)
#define PTA14_LPSPI5_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 14, 0, 263, 2)
#define PTA15_LPSPI5_PCS0                       NXP_SIUL2_PINMUX(0, 0, 15, 0, 262, 3)
#define PTB18_LPSPI5_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 50, 8, 0, 0)
#define PTB18_LPSPI5_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 50, 0, 264, 2)
#define PTB20_LPSPI5_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 52, 8, 0, 0)
#define PTB20_LPSPI5_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 52, 0, 265, 2)
#define PTD2_LPSPI5_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 98, 7, 0, 0)
#define PTD2_LPSPI5_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 98, 0, 268, 2)
#define PTD4_LPSPI5_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 100, 7, 0, 0)
#define PTD4_LPSPI5_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 100, 0, 262, 2)
#define PTD13_LPSPI5_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 109, 1, 0, 0)
#define PTD13_LPSPI5_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 109, 0, 267, 1)
#define PTD14_LPSPI5_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 110, 1, 0, 0)
#define PTD14_LPSPI5_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 110, 0, 266, 1)
#define PTD17_LPSPI5_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 113, 1, 0, 0)
#define PTD17_LPSPI5_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 113, 0, 262, 1)
#define PTD26_LPSPI5_SCK                        NXP_SIUL2_PINMUX(0, 0, 122, 0, 266, 3)
#define PTD27_LPSPI5_SOUT                       NXP_SIUL2_PINMUX(0, 0, 123, 0, 268, 3)
#define PTD28_LPSPI5_SIN                        NXP_SIUL2_PINMUX(0, 0, 124, 0, 267, 3)
#define PTD29_LPSPI5_PCS2                       NXP_SIUL2_PINMUX(0, 0, 125, 0, 264, 1)
#define PTD30_LPSPI5_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 126, 6, 0, 0)
#define PTD30_LPSPI5_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 126, 0, 265, 1)
#define PTE8_LPSPI5_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 136, 3, 0, 0)
#define PTE8_LPSPI5_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 136, 0, 263, 1)
#define PTE9_LPSPI5_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 137, 1, 0, 0)
#define PTE9_LPSPI5_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 137, 0, 268, 1)

