zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* ETPU_A */
#define PTA2_ETPU_A_CH2_O                       NXP_SIUL2_PINMUX(0, 0, 2, 8, 0, 0)
#define PTA2_ETPU_A_CH2_I                       NXP_SIUL2_PINMUX(0, 0, 2, 0, 446, 1)
#define PTA3_ETPU_A_CH3_O                       NXP_SIUL2_PINMUX(0, 0, 3, 11, 0, 0)
#define PTA3_ETPU_A_CH3_I                       NXP_SIUL2_PINMUX(0, 0, 3, 0, 445, 1)
#define PTA6_ETPU_A_CH18_O                      NXP_SIUL2_PINMUX(0, 0, 6, 8, 0, 0)
#define PTA6_ETPU_A_CH18_I                      NXP_SIUL2_PINMUX(0, 0, 6, 0, 467, 1)
#define PTA7_ETPU_A_CH20_O                      NXP_SIUL2_PINMUX(0, 0, 7, 10, 0, 0)
#define PTA7_ETPU_A_CH20_I                      NXP_SIUL2_PINMUX(0, 0, 7, 0, 466, 1)
#define PTA8_ETPU_A_CH5_O                       NXP_SIUL2_PINMUX(0, 0, 8, 9, 0, 0)
#define PTA8_ETPU_A_CH5_I                       NXP_SIUL2_PINMUX(0, 0, 8, 0, 479, 2)
#define PTA9_ETPU_A_CH12_O                      NXP_SIUL2_PINMUX(0, 0, 9, 10, 0, 0)
#define PTA9_ETPU_A_CH12_I                      NXP_SIUL2_PINMUX(0, 0, 9, 0, 481, 2)
#define PTA14_ETPU_A_CH6_O                      NXP_SIUL2_PINMUX(0, 0, 14, 8, 0, 0)
#define PTA14_ETPU_A_CH6_I                      NXP_SIUL2_PINMUX(0, 0, 14, 0, 442, 3)
#define PTA17_ETPU_A_CH8_O                      NXP_SIUL2_PINMUX(0, 0, 17, 9, 0, 0)
#define PTA17_ETPU_A_CH8_I                      NXP_SIUL2_PINMUX(0, 0, 17, 0, 450, 1)
#define PTA18_ETPU_A_CH3_O                      NXP_SIUL2_PINMUX(0, 0, 18, 10, 0, 0)
#define PTA18_ETPU_A_CH3_I                      NXP_SIUL2_PINMUX(0, 0, 18, 0, 445, 3)
#define PTA19_ETPU_A_CH4_O                      NXP_SIUL2_PINMUX(0, 0, 19, 11, 0, 0)
#define PTA19_ETPU_A_CH4_I                      NXP_SIUL2_PINMUX(0, 0, 19, 0, 448, 3)
#define PTA20_ETPU_A_CH5_O                      NXP_SIUL2_PINMUX(0, 0, 20, 10, 0, 0)
#define PTA20_ETPU_A_CH5_I                      NXP_SIUL2_PINMUX(0, 0, 20, 0, 479, 3)
#define PTA21_ETPU_A_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 21, 10, 0, 0)
#define PTA21_ETPU_A_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 21, 0, 449, 4)
#define PTA23_ETPU_A_CH24_O                     NXP_SIUL2_PINMUX(0, 0, 23, 10, 0, 0)
#define PTA23_ETPU_A_CH24_I                     NXP_SIUL2_PINMUX(0, 0, 23, 0, 504, 2)
#define PTB11_ETPU_A_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 43, 8, 0, 0)
#define PTB11_ETPU_A_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 43, 0, 434, 3)
#define PTB11_ETPU_A_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 43, 0, 447, 1)
#define PTB12_ETPU_A_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 44, 13, 0, 0)
#define PTB12_ETPU_A_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 44, 0, 434, 2)
#define PTB12_ETPU_A_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 44, 0, 447, 2)
#define PTB13_ETPU_A_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 45, 14, 0, 0)
#define PTB13_ETPU_A_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 45, 0, 449, 2)
#define PTB14_ETPU_A_CH9_O                      NXP_SIUL2_PINMUX(0, 0, 46, 8, 0, 0)
#define PTB14_ETPU_A_CH3_O                      NXP_SIUL2_PINMUX(0, 0, 46, 14, 0, 0)
#define PTB14_ETPU_A_CH3_I                      NXP_SIUL2_PINMUX(0, 0, 46, 0, 445, 2)
#define PTB14_ETPU_A_CH9_I                      NXP_SIUL2_PINMUX(0, 0, 46, 0, 454, 1)
#define PTB15_ETPU_A_CH4_O                      NXP_SIUL2_PINMUX(0, 0, 47, 12, 0, 0)
#define PTB15_ETPU_A_CH4_I                      NXP_SIUL2_PINMUX(0, 0, 47, 0, 448, 2)
#define PTB16_ETPU_A_CH10_O                     NXP_SIUL2_PINMUX(0, 0, 48, 13, 0, 0)
#define PTB16_ETPU_A_CH10_I                     NXP_SIUL2_PINMUX(0, 0, 48, 0, 444, 2)
#define PTB17_ETPU_A_CH5_O                      NXP_SIUL2_PINMUX(0, 0, 49, 10, 0, 0)
#define PTB17_ETPU_A_CH7_O                      NXP_SIUL2_PINMUX(0, 0, 49, 11, 0, 0)
#define PTB17_ETPU_A_CH7_I                      NXP_SIUL2_PINMUX(0, 0, 49, 0, 458, 2)
#define PTB17_ETPU_A_CH5_I                      NXP_SIUL2_PINMUX(0, 0, 49, 0, 479, 1)
#define PTB20_ETPU_A_CH24_O                     NXP_SIUL2_PINMUX(0, 0, 52, 9, 0, 0)
#define PTB20_ETPU_A_CH24_I                     NXP_SIUL2_PINMUX(0, 0, 52, 0, 504, 1)
#define PTB21_ETPU_A_CH25_O                     NXP_SIUL2_PINMUX(0, 0, 53, 9, 0, 0)
#define PTB21_ETPU_A_CH25_I                     NXP_SIUL2_PINMUX(0, 0, 53, 0, 505, 1)
#define PTB23_ETPU_A_CH30_O                     NXP_SIUL2_PINMUX(0, 0, 55, 9, 0, 0)
#define PTB23_ETPU_A_CH30_I                     NXP_SIUL2_PINMUX(0, 0, 55, 0, 506, 1)
#define PTB25_ETPU_A_CH31_O                     NXP_SIUL2_PINMUX(0, 0, 57, 8, 0, 0)
#define PTB25_ETPU_A_CH31_I                     NXP_SIUL2_PINMUX(0, 0, 57, 0, 507, 1)
#define PTC0_ETPU_A_CH18_O                      NXP_SIUL2_PINMUX(0, 0, 64, 9, 0, 0)
#define PTC0_ETPU_A_CH18_I                      NXP_SIUL2_PINMUX(0, 0, 64, 0, 467, 2)
#define PTC8_ETPU_A_CH22_O                      NXP_SIUL2_PINMUX(0, 0, 72, 8, 0, 0)
#define PTC8_ETPU_A_CH22_I                      NXP_SIUL2_PINMUX(0, 0, 72, 0, 465, 1)
#define PTC9_ETPU_A_CH13_O                      NXP_SIUL2_PINMUX(0, 0, 73, 9, 0, 0)
#define PTC9_ETPU_A_CH13_I                      NXP_SIUL2_PINMUX(0, 0, 73, 0, 464, 1)
#define PTC10_ETPU_A_CH23_O                     NXP_SIUL2_PINMUX(0, 0, 74, 10, 0, 0)
#define PTC10_ETPU_A_CH23_I                     NXP_SIUL2_PINMUX(0, 0, 74, 0, 461, 1)
#define PTC17_ETPU_A_CH29_O                     NXP_SIUL2_PINMUX(0, 0, 81, 9, 0, 0)
#define PTC17_ETPU_A_CH29_I                     NXP_SIUL2_PINMUX(0, 0, 81, 0, 503, 1)
#define PTC20_ETPU_A_CH22_O                     NXP_SIUL2_PINMUX(0, 0, 84, 10, 0, 0)
#define PTC20_ETPU_A_CH22_I                     NXP_SIUL2_PINMUX(0, 0, 84, 0, 465, 2)
#define PTC21_ETPU_A_CH23_O                     NXP_SIUL2_PINMUX(0, 0, 85, 10, 0, 0)
#define PTC21_ETPU_A_CH23_I                     NXP_SIUL2_PINMUX(0, 0, 85, 0, 461, 2)
#define PTC23_ETPU_A_CH15_O                     NXP_SIUL2_PINMUX(0, 0, 87, 9, 0, 0)
#define PTC23_ETPU_A_CH15_I                     NXP_SIUL2_PINMUX(0, 0, 87, 0, 469, 1)
#define PTC24_ETPU_A_CH12_O                     NXP_SIUL2_PINMUX(0, 0, 88, 10, 0, 0)
#define PTC24_ETPU_A_CH12_I                     NXP_SIUL2_PINMUX(0, 0, 88, 0, 481, 1)
#define PTC27_ETPU_A_CH14_O                     NXP_SIUL2_PINMUX(0, 0, 91, 8, 0, 0)
#define PTC27_ETPU_A_CH14_I                     NXP_SIUL2_PINMUX(0, 0, 91, 0, 473, 1)
#define PTC29_ETPU_A_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 93, 8, 0, 0)
#define PTC29_ETPU_A_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 93, 0, 475, 1)
#define PTC30_ETPU_A_CH19_O                     NXP_SIUL2_PINMUX(0, 0, 94, 9, 0, 0)
#define PTC30_ETPU_A_CH19_I                     NXP_SIUL2_PINMUX(0, 0, 94, 0, 476, 1)
#define PTC31_ETPU_A_CH17_O                     NXP_SIUL2_PINMUX(0, 0, 95, 8, 0, 0)
#define PTC31_ETPU_A_CH17_I                     NXP_SIUL2_PINMUX(0, 0, 95, 0, 477, 1)
#define PTD0_ETPU_A_CH7_O                       NXP_SIUL2_PINMUX(0, 0, 96, 10, 0, 0)
#define PTD0_ETPU_A_CH7_I                       NXP_SIUL2_PINMUX(0, 0, 96, 0, 458, 3)
#define PTD1_ETPU_A_CH2_O                       NXP_SIUL2_PINMUX(0, 0, 97, 11, 0, 0)
#define PTD1_ETPU_A_CH2_I                       NXP_SIUL2_PINMUX(0, 0, 97, 0, 446, 4)
#define PTD2_ETPU_A_CH10_O                      NXP_SIUL2_PINMUX(0, 0, 98, 8, 0, 0)
#define PTD2_ETPU_A_CH10_I                      NXP_SIUL2_PINMUX(0, 0, 98, 0, 444, 1)
#define PTD3_ETPU_A_CH11_O                      NXP_SIUL2_PINMUX(0, 0, 99, 8, 0, 0)
#define PTD3_ETPU_A_CH11_I                      NXP_SIUL2_PINMUX(0, 0, 99, 0, 443, 1)
#define PTD4_ETPU_A_CH6_O                       NXP_SIUL2_PINMUX(0, 0, 100, 8, 0, 0)
#define PTD4_ETPU_A_CH6_I                       NXP_SIUL2_PINMUX(0, 0, 100, 0, 442, 1)
#define PTD5_ETPU_A_CH27_O                      NXP_SIUL2_PINMUX(0, 0, 101, 8, 0, 0)
#define PTD5_ETPU_A_CH27_I                      NXP_SIUL2_PINMUX(0, 0, 101, 0, 501, 1)
#define PTD6_ETPU_A_CH26_O                      NXP_SIUL2_PINMUX(0, 0, 102, 8, 0, 0)
#define PTD6_ETPU_A_CH26_I                      NXP_SIUL2_PINMUX(0, 0, 102, 0, 500, 1)
#define PTD8_ETPU_A_CH28_O                      NXP_SIUL2_PINMUX(0, 0, 104, 9, 0, 0)
#define PTD8_ETPU_A_CH28_I                      NXP_SIUL2_PINMUX(0, 0, 104, 0, 502, 1)
#define PTD9_ETPU_A_CH19_O                      NXP_SIUL2_PINMUX(0, 0, 105, 11, 0, 0)
#define PTD9_ETPU_A_CH19_I                      NXP_SIUL2_PINMUX(0, 0, 105, 0, 476, 2)
#define PTD10_ETPU_A_CH17_O                     NXP_SIUL2_PINMUX(0, 0, 106, 9, 0, 0)
#define PTD10_ETPU_A_CH17_I                     NXP_SIUL2_PINMUX(0, 0, 106, 0, 477, 2)
#define PTD11_ETPU_A_CH14_O                     NXP_SIUL2_PINMUX(0, 0, 107, 9, 0, 0)
#define PTD11_ETPU_A_CH14_I                     NXP_SIUL2_PINMUX(0, 0, 107, 0, 473, 2)
#define PTD18_ETPU_A_CH17_O                     NXP_SIUL2_PINMUX(0, 0, 114, 10, 0, 0)
#define PTD18_ETPU_A_CH17_I                     NXP_SIUL2_PINMUX(0, 0, 114, 0, 477, 3)
#define PTD19_ETPU_A_CH19_O                     NXP_SIUL2_PINMUX(0, 0, 115, 10, 0, 0)
#define PTD19_ETPU_A_CH19_I                     NXP_SIUL2_PINMUX(0, 0, 115, 0, 476, 3)
#define PTD20_ETPU_A_CH11_O                     NXP_SIUL2_PINMUX(0, 0, 116, 12, 0, 0)
#define PTD20_ETPU_A_CH11_I                     NXP_SIUL2_PINMUX(0, 0, 116, 0, 443, 2)
#define PTD21_ETPU_A_CH7_O                      NXP_SIUL2_PINMUX(0, 0, 117, 8, 0, 0)
#define PTD21_ETPU_A_CH2_O                      NXP_SIUL2_PINMUX(0, 0, 117, 13, 0, 0)
#define PTD21_ETPU_A_CH2_I                      NXP_SIUL2_PINMUX(0, 0, 117, 0, 446, 2)
#define PTD21_ETPU_A_CH7_I                      NXP_SIUL2_PINMUX(0, 0, 117, 0, 458, 1)
#define PTD23_ETPU_A_CH4_O                      NXP_SIUL2_PINMUX(0, 0, 119, 8, 0, 0)
#define PTD23_ETPU_A_CH4_I                      NXP_SIUL2_PINMUX(0, 0, 119, 0, 448, 1)
#define PTD24_ETPU_A_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 120, 8, 0, 0)
#define PTD24_ETPU_A_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 120, 0, 449, 1)
#define PTD25_ETPU_A_CH15_O                     NXP_SIUL2_PINMUX(0, 0, 121, 9, 0, 0)
#define PTD25_ETPU_A_CH15_I                     NXP_SIUL2_PINMUX(0, 0, 121, 0, 469, 2)
#define PTD30_ETPU_A_CH16_O                     NXP_SIUL2_PINMUX(0, 0, 126, 9, 0, 0)
#define PTD30_ETPU_A_CH16_I                     NXP_SIUL2_PINMUX(0, 0, 126, 0, 468, 2)
#define PTD31_ETPU_A_CH8_O                      NXP_SIUL2_PINMUX(0, 0, 127, 6, 0, 0)
#define PTD31_ETPU_A_CH8_I                      NXP_SIUL2_PINMUX(0, 0, 127, 0, 450, 2)
#define PTE0_ETPU_A_CH1_O                       NXP_SIUL2_PINMUX(0, 0, 128, 8, 0, 0)
#define PTE0_ETPU_A_CH1_I                       NXP_SIUL2_PINMUX(0, 0, 128, 0, 449, 3)
#define PTE1_ETPU_A_CH2_O                       NXP_SIUL2_PINMUX(0, 0, 129, 10, 0, 0)
#define PTE1_ETPU_A_CH2_I                       NXP_SIUL2_PINMUX(0, 0, 129, 0, 446, 3)
#define PTE4_ETPU_A_CH12_O                      NXP_SIUL2_PINMUX(0, 0, 132, 11, 0, 0)
#define PTE4_ETPU_A_CH12_I                      NXP_SIUL2_PINMUX(0, 0, 132, 0, 481, 3)
#define PTE5_ETPU_A_CH11_O                      NXP_SIUL2_PINMUX(0, 0, 133, 12, 0, 0)
#define PTE5_ETPU_A_CH11_I                      NXP_SIUL2_PINMUX(0, 0, 133, 0, 443, 3)
#define PTE7_ETPU_A_CH16_O                      NXP_SIUL2_PINMUX(0, 0, 135, 8, 0, 0)
#define PTE7_ETPU_A_CH16_I                      NXP_SIUL2_PINMUX(0, 0, 135, 0, 468, 1)
#define PTE10_ETPU_A_CH10_O                     NXP_SIUL2_PINMUX(0, 0, 138, 10, 0, 0)
#define PTE10_ETPU_A_CH10_I                     NXP_SIUL2_PINMUX(0, 0, 138, 0, 444, 3)
#define PTE11_ETPU_A_CH9_O                      NXP_SIUL2_PINMUX(0, 0, 139, 12, 0, 0)
#define PTE11_ETPU_A_CH9_I                      NXP_SIUL2_PINMUX(0, 0, 139, 0, 454, 2)
#define PTE15_ETPU_A_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 143, 9, 0, 0)
#define PTE15_ETPU_A_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 143, 0, 434, 1)
#define PTE15_ETPU_A_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 143, 0, 447, 4)
#define PTE16_ETPU_A_CH6_O                      NXP_SIUL2_PINMUX(0, 0, 144, 10, 0, 0)
#define PTE16_ETPU_A_CH6_I                      NXP_SIUL2_PINMUX(0, 0, 144, 0, 442, 2)
#define PTE19_ETPU_A_CH9_O                      NXP_SIUL2_PINMUX(0, 0, 147, 8, 0, 0)
#define PTE19_ETPU_A_CH9_I                      NXP_SIUL2_PINMUX(0, 0, 147, 0, 454, 3)
#define PTE26_ETPU_A_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 154, 10, 0, 0)
#define PTE26_ETPU_A_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 154, 0, 434, 4)
#define PTE26_ETPU_A_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 154, 0, 447, 3)
#define PTE27_ETPU_A_CH20_O                     NXP_SIUL2_PINMUX(0, 0, 155, 9, 0, 0)
#define PTE27_ETPU_A_CH20_I                     NXP_SIUL2_PINMUX(0, 0, 155, 0, 466, 2)
#define PTE28_ETPU_A_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 156, 9, 0, 0)
#define PTE28_ETPU_A_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 156, 0, 475, 2)
#define PTE31_ETPU_A_CH31_O                     NXP_SIUL2_PINMUX(0, 0, 159, 9, 0, 0)
#define PTE31_ETPU_A_CH31_I                     NXP_SIUL2_PINMUX(0, 0, 159, 0, 507, 3)
#define PTF0_ETPU_A_CH30_O                      NXP_SIUL2_PINMUX(0, 0, 160, 10, 0, 0)
#define PTF0_ETPU_A_CH30_I                      NXP_SIUL2_PINMUX(0, 0, 160, 0, 506, 3)
#define PTF1_ETPU_A_CH29_O                      NXP_SIUL2_PINMUX(0, 0, 161, 9, 0, 0)
#define PTF1_ETPU_A_CH29_I                      NXP_SIUL2_PINMUX(0, 0, 161, 0, 503, 3)
#define PTF3_ETPU_A_CH28_O                      NXP_SIUL2_PINMUX(0, 0, 163, 9, 0, 0)
#define PTF3_ETPU_A_CH28_I                      NXP_SIUL2_PINMUX(0, 0, 163, 0, 502, 3)
#define PTF5_ETPU_A_CH27_O                      NXP_SIUL2_PINMUX(0, 0, 165, 9, 0, 0)
#define PTF5_ETPU_A_CH27_I                      NXP_SIUL2_PINMUX(0, 0, 165, 0, 501, 3)
#define PTF14_ETPU_A_CH28_O                     NXP_SIUL2_PINMUX(0, 0, 174, 9, 0, 0)
#define PTF14_ETPU_A_CH28_I                     NXP_SIUL2_PINMUX(0, 0, 174, 0, 502, 2)
#define PTF15_ETPU_A_CH30_O                     NXP_SIUL2_PINMUX(0, 0, 175, 8, 0, 0)
#define PTF15_ETPU_A_CH30_I                     NXP_SIUL2_PINMUX(0, 0, 175, 0, 506, 2)
#define PTF16_ETPU_A_CH31_O                     NXP_SIUL2_PINMUX(0, 0, 176, 8, 0, 0)
#define PTF16_ETPU_A_CH31_I                     NXP_SIUL2_PINMUX(0, 0, 176, 0, 507, 2)
#define PTF18_ETPU_A_CH18_O                     NXP_SIUL2_PINMUX(0, 0, 178, 10, 0, 0)
#define PTF18_ETPU_A_CH18_I                     NXP_SIUL2_PINMUX(0, 0, 178, 0, 467, 3)
#define PTF20_ETPU_A_CH29_O                     NXP_SIUL2_PINMUX(0, 0, 180, 9, 0, 0)
#define PTF20_ETPU_A_CH29_I                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 503, 2)
#define PTF21_ETPU_A_CH14_O                     NXP_SIUL2_PINMUX(0, 0, 181, 9, 0, 0)
#define PTF21_ETPU_A_CH14_I                     NXP_SIUL2_PINMUX(0, 0, 181, 0, 473, 3)
#define PTF23_ETPU_A_CH13_O                     NXP_SIUL2_PINMUX(0, 0, 183, 11, 0, 0)
#define PTF23_ETPU_A_CH13_I                     NXP_SIUL2_PINMUX(0, 0, 183, 0, 464, 2)
#define PTF29_ETPU_A_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 189, 12, 0, 0)
#define PTF29_ETPU_A_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 189, 13, 0, 0)
#define PTF29_ETPU_A_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 189, 0, 434, 5)
#define PTF29_ETPU_A_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 189, 0, 447, 5)
#define PTF29_ETPU_A_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 189, 0, 475, 3)
#define PTG0_ETPU_A_CH8_O                       NXP_SIUL2_PINMUX(0, 0, 192, 9, 0, 0)
#define PTG0_ETPU_A_CH8_I                       NXP_SIUL2_PINMUX(0, 0, 192, 0, 450, 3)
#define PTG1_ETPU_A_CH13_O                      NXP_SIUL2_PINMUX(0, 0, 193, 9, 0, 0)
#define PTG1_ETPU_A_CH13_I                      NXP_SIUL2_PINMUX(0, 0, 193, 0, 464, 3)
#define PTG2_ETPU_A_CH1_O                       NXP_SIUL2_PINMUX(0, 0, 194, 9, 0, 0)
#define PTG2_ETPU_A_CH22_O                      NXP_SIUL2_PINMUX(0, 0, 194, 10, 0, 0)
#define PTG2_ETPU_A_CH1_I                       NXP_SIUL2_PINMUX(0, 0, 194, 0, 449, 5)
#define PTG2_ETPU_A_CH22_I                      NXP_SIUL2_PINMUX(0, 0, 194, 0, 465, 3)
#define PTG3_ETPU_A_CH2_O                       NXP_SIUL2_PINMUX(0, 0, 195, 11, 0, 0)
#define PTG3_ETPU_A_CH23_O                      NXP_SIUL2_PINMUX(0, 0, 195, 12, 0, 0)
#define PTG3_ETPU_A_CH2_I                       NXP_SIUL2_PINMUX(0, 0, 195, 0, 446, 5)
#define PTG3_ETPU_A_CH23_I                      NXP_SIUL2_PINMUX(0, 0, 195, 0, 461, 3)
#define PTG4_ETPU_A_CH26_O                      NXP_SIUL2_PINMUX(0, 0, 196, 8, 0, 0)
#define PTG4_ETPU_A_CH26_I                      NXP_SIUL2_PINMUX(0, 0, 196, 0, 500, 2)
#define PTG5_ETPU_A_CH27_O                      NXP_SIUL2_PINMUX(0, 0, 197, 8, 0, 0)
#define PTG5_ETPU_A_CH27_I                      NXP_SIUL2_PINMUX(0, 0, 197, 0, 501, 2)
#define PTG8_ETPU_A_CH25_O                      NXP_SIUL2_PINMUX(0, 0, 200, 10, 0, 0)
#define PTG8_ETPU_A_CH25_I                      NXP_SIUL2_PINMUX(0, 0, 200, 0, 505, 2)
#define PTG9_ETPU_A_CH24_O                      NXP_SIUL2_PINMUX(0, 0, 201, 9, 0, 0)
#define PTG9_ETPU_A_CH24_I                      NXP_SIUL2_PINMUX(0, 0, 201, 0, 504, 3)
#define PTG10_ETPU_A_CH15_O                     NXP_SIUL2_PINMUX(0, 0, 202, 9, 0, 0)
#define PTG10_ETPU_A_CH15_I                     NXP_SIUL2_PINMUX(0, 0, 202, 0, 469, 3)
#define PTG11_ETPU_A_CH16_O                     NXP_SIUL2_PINMUX(0, 0, 203, 9, 0, 0)
#define PTG11_ETPU_A_CH16_I                     NXP_SIUL2_PINMUX(0, 0, 203, 0, 468, 3)
#define PTG12_ETPU_A_CH26_O                     NXP_SIUL2_PINMUX(0, 0, 204, 9, 0, 0)
#define PTG12_ETPU_A_CH26_I                     NXP_SIUL2_PINMUX(0, 0, 204, 0, 500, 3)
#define PTG13_ETPU_A_CH20_O                     NXP_SIUL2_PINMUX(0, 0, 205, 11, 0, 0)
#define PTG13_ETPU_A_CH20_I                     NXP_SIUL2_PINMUX(0, 0, 205, 0, 466, 3)
#define PTG14_ETPU_A_CH25_O                     NXP_SIUL2_PINMUX(0, 0, 206, 8, 0, 0)
#define PTG14_ETPU_A_CH25_I                     NXP_SIUL2_PINMUX(0, 0, 206, 0, 505, 3)

/* FLEXPWM_0 */
#define PTA2_PWM_0_B0_O                         NXP_SIUL2_PINMUX(0, 0, 2, 10, 0, 0)
#define PTA2_PWM_0_B0_I                         NXP_SIUL2_PINMUX(0, 0, 2, 0, 413, 1)
#define PTA3_PWM_0_A1_O                         NXP_SIUL2_PINMUX(0, 0, 3, 14, 0, 0)
#define PTA3_PWM_0_A1_I                         NXP_SIUL2_PINMUX(0, 0, 3, 0, 411, 1)
#define PTB12_PWM_0_X0_O                        NXP_SIUL2_PINMUX(0, 0, 44, 12, 0, 0)
#define PTB12_PWM_0_X0_I                        NXP_SIUL2_PINMUX(0, 0, 44, 0, 489, 1)
#define PTB13_PWM_0_X1_O                        NXP_SIUL2_PINMUX(0, 0, 45, 12, 0, 0)
#define PTB13_PWM_0_X1_I                        NXP_SIUL2_PINMUX(0, 0, 45, 0, 488, 1)
#define PTB14_PWM_0_X3_O                        NXP_SIUL2_PINMUX(0, 0, 46, 12, 0, 0)
#define PTB14_PWM_0_X3_I                        NXP_SIUL2_PINMUX(0, 0, 46, 0, 487, 1)
#define PTB15_PWM_0_FAULT0                      NXP_SIUL2_PINMUX(0, 0, 47, 0, 494, 1)
#define PTB16_PWM_0_FAULT1                      NXP_SIUL2_PINMUX(0, 0, 48, 0, 493, 1)
#define PTB17_PWM_0_FAULT3                      NXP_SIUL2_PINMUX(0, 0, 49, 0, 492, 1)
#define PTB17_PWM_0_EXT_CLK                     NXP_SIUL2_PINMUX(0, 0, 49, 0, 417, 1)
#define PTD2_PWM_0_A2_O                         NXP_SIUL2_PINMUX(0, 0, 98, 10, 0, 0)
#define PTD2_PWM_0_A2_I                         NXP_SIUL2_PINMUX(0, 0, 98, 0, 410, 1)
#define PTD3_PWM_0_B2_O                         NXP_SIUL2_PINMUX(0, 0, 99, 10, 0, 0)
#define PTD3_PWM_0_B2_I                         NXP_SIUL2_PINMUX(0, 0, 99, 0, 409, 1)
#define PTD4_PWM_0_A3_O                         NXP_SIUL2_PINMUX(0, 0, 100, 9, 0, 0)
#define PTD4_PWM_0_A3_I                         NXP_SIUL2_PINMUX(0, 0, 100, 0, 408, 1)
#define PTD20_PWM_0_FAULT2                      NXP_SIUL2_PINMUX(0, 0, 116, 0, 495, 1)
#define PTD20_PWM_0_EXT_FORCE                   NXP_SIUL2_PINMUX(0, 0, 116, 0, 418, 1)
#define PTD21_PWM_0_X2_O                        NXP_SIUL2_PINMUX(0, 0, 117, 11, 0, 0)
#define PTD21_PWM_0_X2_I                        NXP_SIUL2_PINMUX(0, 0, 117, 0, 491, 1)
#define PTD22_PWM_0_B3_O                        NXP_SIUL2_PINMUX(0, 0, 118, 9, 0, 0)
#define PTD22_PWM_0_B3_I                        NXP_SIUL2_PINMUX(0, 0, 118, 0, 414, 1)
#define PTD23_PWM_0_B1_O                        NXP_SIUL2_PINMUX(0, 0, 119, 10, 0, 0)
#define PTD23_PWM_0_B1_I                        NXP_SIUL2_PINMUX(0, 0, 119, 0, 415, 1)
#define PTD24_PWM_0_A0_O                        NXP_SIUL2_PINMUX(0, 0, 120, 11, 0, 0)
#define PTD24_PWM_0_A0_I                        NXP_SIUL2_PINMUX(0, 0, 120, 0, 416, 1)

