zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* LPSPI1 */
#define PTA2_LPSPI1_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 2, 12, 0, 0)
#define PTA2_LPSPI1_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 2, 0, 239, 2)
#define PTA3_LPSPI1_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 3, 3, 0, 0)
#define PTA3_LPSPI1_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 3, 0, 238, 1)
#define PTA6_LPSPI1_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 6, 3, 0, 0)
#define PTA6_LPSPI1_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 6, 0, 233, 1)
#define PTA9_LPSPI1_PCS2_O                      NXP_SIUL2_PINMUX(0, 0, 9, 9, 0, 0)
#define PTA9_LPSPI1_PCS2_I                      NXP_SIUL2_PINMUX(0, 0, 9, 0, 234, 3)
#define PTA14_LPSPI1_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 14, 3, 0, 0)
#define PTA14_LPSPI1_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 14, 0, 235, 2)
#define PTA16_LPSPI1_PCS2                       NXP_SIUL2_PINMUX(0, 0, 16, 0, 234, 2)
#define PTA18_LPSPI1_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 18, 4, 0, 0)
#define PTA18_LPSPI1_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 18, 0, 240, 4)
#define PTA19_LPSPI1_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 19, 4, 0, 0)
#define PTA19_LPSPI1_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 19, 0, 238, 3)
#define PTA20_LPSPI1_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 20, 4, 0, 0)
#define PTA20_LPSPI1_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 20, 0, 239, 3)
#define PTA21_LPSPI1_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 21, 4, 0, 0)
#define PTA21_LPSPI1_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 232, 3)
#define PTA22_LPSPI1_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 22, 4, 0, 0)
#define PTA22_LPSPI1_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 22, 0, 233, 3)
#define PTA26_LPSPI1_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 26, 3, 0, 0)
#define PTA26_LPSPI1_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 26, 0, 232, 5)
#define PTA29_LPSPI1_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 29, 5, 0, 0)
#define PTA29_LPSPI1_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 29, 0, 239, 4)
#define PTA30_LPSPI1_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 30, 3, 0, 0)
#define PTA30_LPSPI1_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 30, 0, 240, 5)
#define PTB14_LPSPI1_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 46, 3, 0, 0)
#define PTB14_LPSPI1_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 46, 0, 238, 2)
#define PTB15_LPSPI1_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 47, 3, 0, 0)
#define PTB15_LPSPI1_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 47, 0, 239, 1)
#define PTB16_LPSPI1_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 48, 3, 0, 0)
#define PTB16_LPSPI1_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 48, 0, 240, 2)
#define PTB17_LPSPI1_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 49, 3, 0, 0)
#define PTB17_LPSPI1_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 49, 0, 235, 1)
#define PTB18_LPSPI1_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 50, 4, 0, 0)
#define PTB18_LPSPI1_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 50, 0, 233, 2)
#define PTC6_LPSPI1_PCS1                        NXP_SIUL2_PINMUX(0, 0, 70, 0, 233, 4)
#define PTD2_LPSPI1_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 98, 3, 0, 0)
#define PTD2_LPSPI1_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 98, 0, 240, 1)
#define PTD3_LPSPI1_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 99, 3, 0, 0)
#define PTD3_LPSPI1_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 99, 0, 232, 1)
#define PTD4_LPSPI1_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 100, 3, 0, 0)
#define PTD4_LPSPI1_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 100, 0, 233, 6)
#define PTD20_LPSPI1_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 116, 5, 0, 0)
#define PTD20_LPSPI1_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 116, 0, 234, 1)
#define PTE4_LPSPI1_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 132, 2, 0, 0)
#define PTE4_LPSPI1_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 132, 0, 233, 5)
#define PTE5_LPSPI1_PCS3_O                      NXP_SIUL2_PINMUX(0, 0, 133, 10, 0, 0)
#define PTE5_LPSPI1_PCS3_I                      NXP_SIUL2_PINMUX(0, 0, 133, 0, 235, 3)
#define PTE11_LPSPI1_PCS4_O                     NXP_SIUL2_PINMUX(0, 0, 139, 10, 0, 0)
#define PTE11_LPSPI1_PCS4_I                     NXP_SIUL2_PINMUX(0, 0, 139, 0, 236, 2)
#define PTE26_LPSPI1_PCS5_O                     NXP_SIUL2_PINMUX(0, 0, 154, 8, 0, 0)
#define PTE26_LPSPI1_PCS5_I                     NXP_SIUL2_PINMUX(0, 0, 154, 0, 237, 2)
#define PTF21_LPSPI1_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 181, 5, 0, 0)
#define PTF21_LPSPI1_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 181, 0, 232, 4)

/* LPCMP0 */
#define PTA4_LPCMP0_OUT                         NXP_SIUL2_PINMUX(0, 0, 4, 4, 0, 0)
#define PTA8_LPCMP0_OUT                         NXP_SIUL2_PINMUX(0, 0, 8, 8, 0, 0)
#define PTC20_LPCMP0_RRT                        NXP_SIUL2_PINMUX(0, 0, 84, 8, 0, 0)
#define PTD14_LPCMP0_RRT                        NXP_SIUL2_PINMUX(0, 0, 110, 6, 0, 0)
#define PTE0_LPCMP0_OUT                         NXP_SIUL2_PINMUX(0, 0, 128, 11, 0, 0)
#define PTF14_LPCMP0_OUT                        NXP_SIUL2_PINMUX(0, 0, 174, 3, 0, 0)
#define PTF15_LPCMP0_RRT                        NXP_SIUL2_PINMUX(0, 0, 175, 3, 0, 0)
#define PTF23_LPCMP0_OUT                        NXP_SIUL2_PINMUX(0, 0, 183, 9, 0, 0)

/* JTAG */
#define PTA4_JTAG_TMSSWD_DIO_O                  NXP_SIUL2_PINMUX(0, 0, 4, 7, 0, 0)
#define PTA4_JTAG_TMSSWD_DIO_I                  NXP_SIUL2_PINMUX(0, 0, 4, 0, 186, 0)
#define PTC4_JTAG_TCKSWD_CLK                    NXP_SIUL2_PINMUX(0, 0, 68, 0, 184, 0)
#define PTC5_JTAG_TDI                           NXP_SIUL2_PINMUX(0, 0, 69, 0, 185, 0)

/* SYSTEM */
#define PTA22_CLKOUT_STANDBY                    NXP_SIUL2_PINMUX(0, 0, 22, 9, 0, 0)
#define PTA22_SWG_EXT_REF_CLK                   NXP_SIUL2_PINMUX(0, 0, 22, 0, 436, 1)
#define PTB5_CLKOUT_RUN                         NXP_SIUL2_PINMUX(0, 0, 37, 5, 0, 0)
#define PTB10_SWG_EXT_REF_CLK                   NXP_SIUL2_PINMUX(0, 0, 42, 0, 436, 3)
#define PTD10_CLKOUT_RUN                        NXP_SIUL2_PINMUX(0, 0, 106, 6, 0, 0)
#define PTD14_CLKOUT_RUN                        NXP_SIUL2_PINMUX(0, 0, 110, 7, 0, 0)
#define PTE9_SWG_EXT_REF_CLK                    NXP_SIUL2_PINMUX(0, 0, 137, 0, 436, 2)
#define PTE10_CLKOUT_STANDBY                    NXP_SIUL2_PINMUX(0, 0, 138, 5, 0, 0)
#define PTE23_SWG_EXT_REF_CLK                   NXP_SIUL2_PINMUX(0, 0, 151, 0, 436, 4)
#define PTF0_SWG_EXT_REF_CLK                    NXP_SIUL2_PINMUX(0, 0, 160, 0, 436, 5)

/* LPSPI3 */
#define PTA6_LPSPI3_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 6, 6, 0, 0)
#define PTA6_LPSPI3_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 6, 0, 249, 5)
#define PTA9_LPSPI3_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 9, 6, 0, 0)
#define PTA9_LPSPI3_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 9, 0, 248, 3)
#define PTA17_LPSPI3_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 17, 6, 0, 0)
#define PTA17_LPSPI3_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 17, 0, 254, 2)
#define PTB12_LPSPI3_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 44, 1, 0, 0)
#define PTB12_LPSPI3_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 44, 0, 251, 1)
#define PTB13_LPSPI3_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 45, 1, 0, 0)
#define PTB13_LPSPI3_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 45, 0, 250, 1)
#define PTB17_LPSPI3_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 49, 6, 0, 0)
#define PTB17_LPSPI3_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 49, 0, 248, 2)
#define PTB22_LPSPI3_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 54, 3, 0, 0)
#define PTB22_LPSPI3_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 54, 0, 249, 4)
#define PTC2_LPSPI3_PCS2_O                      NXP_SIUL2_PINMUX(0, 0, 66, 3, 0, 0)
#define PTC2_LPSPI3_PCS2_I                      NXP_SIUL2_PINMUX(0, 0, 66, 0, 250, 4)
#define PTC16_LPSPI3_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 80, 1, 0, 0)
#define PTC16_LPSPI3_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 80, 0, 253, 3)
#define PTC17_LPSPI3_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 81, 1, 0, 0)
#define PTC17_LPSPI3_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 81, 0, 252, 3)
#define PTD0_LPSPI3_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 96, 3, 0, 0)
#define PTD0_LPSPI3_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 96, 0, 254, 1)
#define PTD1_LPSPI3_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 97, 3, 0, 0)
#define PTD1_LPSPI3_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 97, 0, 252, 1)
#define PTD7_LPSPI3_PCS3_O                      NXP_SIUL2_PINMUX(0, 0, 103, 3, 0, 0)
#define PTD7_LPSPI3_PCS3_I                      NXP_SIUL2_PINMUX(0, 0, 103, 0, 251, 5)
#define PTD8_LPSPI3_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 104, 1, 0, 0)
#define PTD8_LPSPI3_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 104, 0, 254, 3)
#define PTD17_LPSPI3_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 113, 5, 0, 0)
#define PTD17_LPSPI3_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 113, 0, 248, 1)
#define PTD20_LPSPI3_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 116, 6, 0, 0)
#define PTD20_LPSPI3_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 116, 0, 253, 2)
#define PTE7_LPSPI3_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 135, 6, 0, 0)
#define PTE7_LPSPI3_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 135, 0, 252, 2)
#define PTE8_LPSPI3_PCS1_O                      NXP_SIUL2_PINMUX(0, 0, 136, 1, 0, 0)
#define PTE8_LPSPI3_PCS1_I                      NXP_SIUL2_PINMUX(0, 0, 136, 0, 249, 1)
#define PTE10_LPSPI3_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 138, 2, 0, 0)
#define PTE10_LPSPI3_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 138, 0, 253, 1)
#define PTF12_LPSPI3_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 172, 4, 0, 0)
#define PTF12_LPSPI3_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 172, 0, 253, 4)
#define PTF13_LPSPI3_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 173, 4, 0, 0)
#define PTF13_LPSPI3_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 173, 0, 252, 4)
#define PTF15_LPSPI3_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 175, 4, 0, 0)
#define PTF15_LPSPI3_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 175, 0, 254, 4)
#define PTF16_LPSPI3_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 176, 5, 0, 0)
#define PTF16_LPSPI3_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 176, 0, 248, 4)
#define PTF18_LPSPI3_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 178, 5, 0, 0)
#define PTF18_LPSPI3_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 178, 0, 249, 2)
#define PTF19_LPSPI3_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 179, 5, 0, 0)
#define PTF19_LPSPI3_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 179, 0, 250, 2)
#define PTF20_LPSPI3_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 180, 5, 0, 0)
#define PTF20_LPSPI3_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 251, 2)
#define PTF23_LPSPI3_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 183, 5, 0, 0)
#define PTF23_LPSPI3_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 183, 0, 251, 3)
#define PTF29_LPSPI3_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 189, 5, 0, 0)
#define PTF29_LPSPI3_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 189, 0, 249, 3)

/* LCU1 */
#define PTA6_LCU1_OUT0                          NXP_SIUL2_PINMUX(0, 0, 6, 9, 0, 0)
#define PTA7_LCU1_OUT2                          NXP_SIUL2_PINMUX(0, 0, 7, 11, 0, 0)
#define PTA21_LCU1_OUT9                         NXP_SIUL2_PINMUX(0, 0, 21, 11, 0, 0)
#define PTB0_LCU1_OUT5                          NXP_SIUL2_PINMUX(0, 0, 32, 5, 0, 0)
#define PTB0_LCU1_OUT8                          NXP_SIUL2_PINMUX(0, 0, 32, 9, 0, 0)
#define PTB1_LCU1_OUT4                          NXP_SIUL2_PINMUX(0, 0, 33, 7, 0, 0)
#define PTB1_LCU1_OUT9                          NXP_SIUL2_PINMUX(0, 0, 33, 11, 0, 0)
#define PTB2_LCU1_OUT3                          NXP_SIUL2_PINMUX(0, 0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                          NXP_SIUL2_PINMUX(0, 0, 35, 6, 0, 0)
#define PTB28_LCU1_OUT11                        NXP_SIUL2_PINMUX(0, 0, 60, 6, 0, 0)
#define PTB29_LCU1_OUT10                        NXP_SIUL2_PINMUX(0, 0, 61, 6, 0, 0)
#define PTC8_LCU1_OUT7                          NXP_SIUL2_PINMUX(0, 0, 72, 5, 0, 0)
#define PTC8_LCU1_OUT4                          NXP_SIUL2_PINMUX(0, 0, 72, 9, 0, 0)
#define PTC9_LCU1_OUT6                          NXP_SIUL2_PINMUX(0, 0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                        NXP_SIUL2_PINMUX(0, 0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                        NXP_SIUL2_PINMUX(0, 0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                         NXP_SIUL2_PINMUX(0, 0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                         NXP_SIUL2_PINMUX(0, 0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                         NXP_SIUL2_PINMUX(0, 0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                         NXP_SIUL2_PINMUX(0, 0, 79, 6, 0, 0)
#define PTC18_LCU1_OUT7                         NXP_SIUL2_PINMUX(0, 0, 82, 6, 0, 0)
#define PTC19_LCU1_OUT6                         NXP_SIUL2_PINMUX(0, 0, 83, 6, 0, 0)
#define PTC20_LCU1_OUT5                         NXP_SIUL2_PINMUX(0, 0, 84, 6, 0, 0)
#define PTC21_LCU1_OUT4                         NXP_SIUL2_PINMUX(0, 0, 85, 6, 0, 0)
#define PTC23_LCU1_OUT0                         NXP_SIUL2_PINMUX(0, 0, 87, 6, 0, 0)
#define PTC24_LCU1_OUT1                         NXP_SIUL2_PINMUX(0, 0, 88, 6, 0, 0)
#define PTC25_LCU1_OUT2                         NXP_SIUL2_PINMUX(0, 0, 89, 6, 0, 0)
#define PTC26_LCU1_OUT9                         NXP_SIUL2_PINMUX(0, 0, 90, 6, 0, 0)
#define PTC27_LCU1_OUT3                         NXP_SIUL2_PINMUX(0, 0, 91, 6, 0, 0)
#define PTC27_LCU1_OUT10                        NXP_SIUL2_PINMUX(0, 0, 91, 9, 0, 0)
#define PTC28_LCU1_OUT8                         NXP_SIUL2_PINMUX(0, 0, 92, 6, 0, 0)
#define PTC28_LCU1_OUT7                         NXP_SIUL2_PINMUX(0, 0, 92, 9, 0, 0)
#define PTC29_LCU1_OUT5                         NXP_SIUL2_PINMUX(0, 0, 93, 9, 0, 0)
#define PTC30_LCU1_OUT3                         NXP_SIUL2_PINMUX(0, 0, 94, 10, 0, 0)
#define PTC31_LCU1_OUT1                         NXP_SIUL2_PINMUX(0, 0, 95, 9, 0, 0)
#define PTD0_LCU1_OUT11                         NXP_SIUL2_PINMUX(0, 0, 96, 11, 0, 0)
#define PTD1_LCU1_OUT10                         NXP_SIUL2_PINMUX(0, 0, 97, 12, 0, 0)
#define PTD18_LCU1_OUT1                         NXP_SIUL2_PINMUX(0, 0, 114, 11, 0, 0)
#define PTD19_LCU1_OUT3                         NXP_SIUL2_PINMUX(0, 0, 115, 11, 0, 0)
#define PTE15_LCU1_OUT8                         NXP_SIUL2_PINMUX(0, 0, 143, 10, 0, 0)
#define PTF18_LCU1_OUT2                         NXP_SIUL2_PINMUX(0, 0, 178, 11, 0, 0)
#define PTF21_LCU1_OUT0                         NXP_SIUL2_PINMUX(0, 0, 181, 10, 0, 0)
#define PTF29_LCU1_OUT5                         NXP_SIUL2_PINMUX(0, 0, 189, 14, 0, 0)
#define PTG2_LCU1_OUT6                          NXP_SIUL2_PINMUX(0, 0, 194, 11, 0, 0)
#define PTG3_LCU1_OUT7                          NXP_SIUL2_PINMUX(0, 0, 195, 13, 0, 0)
#define PTG13_LCU1_OUT4                         NXP_SIUL2_PINMUX(0, 0, 205, 12, 0, 0)

/* FLEXPWM_1 */
#define PTA6_PWM_1_B0_O                         NXP_SIUL2_PINMUX(0, 0, 6, 10, 0, 0)
#define PTA6_PWM_1_B0_I                         NXP_SIUL2_PINMUX(0, 0, 6, 0, 427, 1)
#define PTA7_PWM_1_B1_O                         NXP_SIUL2_PINMUX(0, 0, 7, 12, 0, 0)
#define PTA7_PWM_1_B1_I                         NXP_SIUL2_PINMUX(0, 0, 7, 0, 426, 1)
#define PTB0_PWM_1_X0_O                         NXP_SIUL2_PINMUX(0, 0, 32, 10, 0, 0)
#define PTB0_PWM_1_X0_I                         NXP_SIUL2_PINMUX(0, 0, 32, 0, 486, 1)
#define PTB1_PWM_1_X1_O                         NXP_SIUL2_PINMUX(0, 0, 33, 12, 0, 0)
#define PTB1_PWM_1_X1_I                         NXP_SIUL2_PINMUX(0, 0, 33, 0, 485, 1)
#define PTC8_PWM_1_B2_O                         NXP_SIUL2_PINMUX(0, 0, 72, 10, 0, 0)
#define PTC8_PWM_1_B2_I                         NXP_SIUL2_PINMUX(0, 0, 72, 0, 425, 1)
#define PTC9_PWM_1_A3_O                         NXP_SIUL2_PINMUX(0, 0, 73, 10, 0, 0)
#define PTC9_PWM_1_A3_I                         NXP_SIUL2_PINMUX(0, 0, 73, 0, 424, 1)
#define PTC10_PWM_1_X3_O                        NXP_SIUL2_PINMUX(0, 0, 74, 11, 0, 0)
#define PTC10_PWM_1_X3_I                        NXP_SIUL2_PINMUX(0, 0, 74, 0, 484, 1)
#define PTC11_PWM_1_FAULT1                      NXP_SIUL2_PINMUX(0, 0, 75, 0, 496, 1)
#define PTC24_PWM_1_FAULT3                      NXP_SIUL2_PINMUX(0, 0, 88, 0, 497, 1)
#define PTC24_PWM_1_EXT_CLK                     NXP_SIUL2_PINMUX(0, 0, 88, 0, 432, 1)
#define PTC25_PWM_1_FAULT2                      NXP_SIUL2_PINMUX(0, 0, 89, 0, 498, 1)
#define PTC25_PWM_1_EXT_FORCE                   NXP_SIUL2_PINMUX(0, 0, 89, 0, 433, 1)
#define PTC26_PWM_1_FAULT0                      NXP_SIUL2_PINMUX(0, 0, 90, 0, 499, 1)
#define PTC27_PWM_1_X2_O                        NXP_SIUL2_PINMUX(0, 0, 91, 10, 0, 0)
#define PTC27_PWM_1_X2_I                        NXP_SIUL2_PINMUX(0, 0, 91, 0, 490, 1)
#define PTC28_PWM_1_B3_O                        NXP_SIUL2_PINMUX(0, 0, 92, 10, 0, 0)
#define PTC28_PWM_1_B3_I                        NXP_SIUL2_PINMUX(0, 0, 92, 0, 428, 1)
#define PTC29_PWM_1_A2_O                        NXP_SIUL2_PINMUX(0, 0, 93, 10, 0, 0)
#define PTC29_PWM_1_A2_I                        NXP_SIUL2_PINMUX(0, 0, 93, 0, 429, 1)
#define PTC30_PWM_1_A1_O                        NXP_SIUL2_PINMUX(0, 0, 94, 11, 0, 0)
#define PTC30_PWM_1_A1_I                        NXP_SIUL2_PINMUX(0, 0, 94, 0, 430, 1)
#define PTC31_PWM_1_A0_O                        NXP_SIUL2_PINMUX(0, 0, 95, 10, 0, 0)
#define PTC31_PWM_1_A0_I                        NXP_SIUL2_PINMUX(0, 0, 95, 0, 431, 1)

/* CAN0 */
#define PTA6_CAN0_RX                            NXP_SIUL2_PINMUX(0, 0, 6, 0, 0, 2)
#define PTA7_CAN0_TX                            NXP_SIUL2_PINMUX(0, 0, 7, 4, 0, 0)
#define PTB0_CAN0_RX                            NXP_SIUL2_PINMUX(0, 0, 32, 0, 0, 3)
#define PTB1_CAN0_TX                            NXP_SIUL2_PINMUX(0, 0, 33, 5, 0, 0)
#define PTC2_CAN0_RX                            NXP_SIUL2_PINMUX(0, 0, 66, 0, 0, 1)
#define PTC3_CAN0_TX                            NXP_SIUL2_PINMUX(0, 0, 67, 3, 0, 0)
#define PTC21_CAN0_TX                           NXP_SIUL2_PINMUX(0, 0, 85, 8, 0, 0)
#define PTC23_CAN0_RX                           NXP_SIUL2_PINMUX(0, 0, 87, 0, 0, 6)
#define PTD29_CAN0_RX                           NXP_SIUL2_PINMUX(0, 0, 125, 0, 0, 7)
#define PTF14_CAN0_TX                           NXP_SIUL2_PINMUX(0, 0, 174, 8, 0, 0)
#define PTF20_CAN0_TX                           NXP_SIUL2_PINMUX(0, 0, 180, 6, 0, 0)
#define PTF21_CAN0_RX                           NXP_SIUL2_PINMUX(0, 0, 181, 0, 0, 5)
#define PTG20_CAN0_TX                           NXP_SIUL2_PINMUX(0, 0, 212, 8, 0, 0)
#define PTG21_CAN0_RX                           NXP_SIUL2_PINMUX(0, 0, 213, 0, 0, 8)

/* LPUART3 */
#define PTA6_LPUART3_RX                         NXP_SIUL2_PINMUX(0, 0, 6, 0, 190, 2)
#define PTA7_LPUART3_TX_O                       NXP_SIUL2_PINMUX(0, 0, 7, 1, 0, 0)
#define PTA7_LPUART3_TX_I                       NXP_SIUL2_PINMUX(0, 0, 7, 0, 366, 1)
#define PTB14_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 46, 0, 190, 5)
#define PTB15_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 47, 9, 0, 0)
#define PTB15_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 47, 0, 366, 5)
#define PTC10_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 74, 9, 0, 0)
#define PTC10_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 74, 0, 366, 6)
#define PTC11_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 75, 0, 190, 6)
#define PTC19_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 83, 10, 0, 0)
#define PTC19_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 83, 0, 366, 7)
#define PTC20_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 84, 0, 190, 7)
#define PTD2_LPUART3_TX_O                       NXP_SIUL2_PINMUX(0, 0, 98, 6, 0, 0)
#define PTD2_LPUART3_TX_I                       NXP_SIUL2_PINMUX(0, 0, 98, 0, 366, 2)
#define PTD3_LPUART3_RX                         NXP_SIUL2_PINMUX(0, 0, 99, 0, 190, 3)
#define PTE0_LPUART3_RX                         NXP_SIUL2_PINMUX(0, 0, 128, 0, 190, 8)
#define PTE1_LPUART3_TX_O                       NXP_SIUL2_PINMUX(0, 0, 129, 8, 0, 0)
#define PTE1_LPUART3_TX_I                       NXP_SIUL2_PINMUX(0, 0, 129, 0, 366, 8)
#define PTE15_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 143, 0, 190, 1)
#define PTE16_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 144, 2, 0, 0)
#define PTE16_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 144, 0, 366, 3)
#define PTF18_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 178, 8, 0, 0)
#define PTF18_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 178, 0, 366, 9)
#define PTF19_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 179, 0, 190, 9)
#define PTF27_LPUART3_TX_O                      NXP_SIUL2_PINMUX(0, 0, 187, 9, 0, 0)
#define PTF27_LPUART3_TX_I                      NXP_SIUL2_PINMUX(0, 0, 187, 0, 366, 10)
#define PTF28_LPUART3_RX                        NXP_SIUL2_PINMUX(0, 0, 188, 0, 190, 10)
#define PTH10_LPUART3_TX                        NXP_SIUL2_PINMUX(0, 0, 234, 8, 0, 0)
#define PTH10_LPUART3_TX                        NXP_SIUL2_PINMUX(0, 0, 234, 0, 366, 11)
#define PTH11_LPUART3_RX_I                      NXP_SIUL2_PINMUX(0, 0, 235, 0, 190, 11)
#define PTH10_LPUART3_TX                        NXP_SIUL2_PINMUX(0, 0, 234, 8, 0, 0)
#define PTH10_LPUART3_TX                        NXP_SIUL2_PINMUX(0, 0, 234, 0, 366, 11)
#define PTH11_LPUART3_RX_I                      NXP_SIUL2_PINMUX(0, 0, 235, 0, 190, 11)

