zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* LPUART1 */
#define PTA6_LPUART1_CTS                        NXP_SIUL2_PINMUX(0, 0, 6, 0, 361, 2)
#define PTA7_LPUART1_RTS                        NXP_SIUL2_PINMUX(0, 0, 7, 5, 0, 0)
#define PTA16_LPUART1_DSR_B                     NXP_SIUL2_PINMUX(0, 0, 16, 0, 378, 1)
#define PTA18_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 18, 3, 0, 0)
#define PTA18_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 18, 0, 364, 4)
#define PTA19_LPUART1_RX                        NXP_SIUL2_PINMUX(0, 0, 19, 0, 188, 5)
#define PTB2_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 34, 0, 188, 6)
#define PTB3_LPUART1_TX_O                       NXP_SIUL2_PINMUX(0, 0, 35, 10, 0, 0)
#define PTB3_LPUART1_TX_I                       NXP_SIUL2_PINMUX(0, 0, 35, 0, 364, 6)
#define PTB8_LPUART1_DCD_B                      NXP_SIUL2_PINMUX(0, 0, 40, 0, 377, 1)
#define PTB9_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 41, 0, 188, 7)
#define PTB9_LPUART1_RIN_B                      NXP_SIUL2_PINMUX(0, 0, 41, 0, 376, 1)
#define PTB10_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 42, 8, 0, 0)
#define PTB10_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 42, 0, 364, 7)
#define PTB22_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 54, 5, 0, 0)
#define PTB22_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 54, 0, 364, 5)
#define PTB23_LPUART1_RX                        NXP_SIUL2_PINMUX(0, 0, 55, 0, 188, 4)
#define PTB27_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 59, 8, 0, 0)
#define PTB27_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 59, 0, 364, 8)
#define PTB28_LPUART1_RX                        NXP_SIUL2_PINMUX(0, 0, 60, 0, 188, 8)
#define PTC6_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 70, 0, 188, 1)
#define PTC8_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 72, 0, 188, 2)
#define PTC9_LPUART1_TX_O                       NXP_SIUL2_PINMUX(0, 0, 73, 2, 0, 0)
#define PTC9_LPUART1_TX_I                       NXP_SIUL2_PINMUX(0, 0, 73, 0, 364, 2)
#define PTC28_LPUART1_RIN_B                     NXP_SIUL2_PINMUX(0, 0, 92, 0, 376, 2)
#define PTC29_LPUART1_DCD_B                     NXP_SIUL2_PINMUX(0, 0, 93, 0, 377, 2)
#define PTC30_LPUART1_DSR_B                     NXP_SIUL2_PINMUX(0, 0, 94, 0, 378, 2)
#define PTC31_LPUART1_DTR_B                     NXP_SIUL2_PINMUX(0, 0, 95, 6, 0, 0)
#define PTD0_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 96, 0, 188, 9)
#define PTD1_LPUART1_TX_O                       NXP_SIUL2_PINMUX(0, 0, 97, 8, 0, 0)
#define PTD1_LPUART1_TX_I                       NXP_SIUL2_PINMUX(0, 0, 97, 0, 364, 9)
#define PTD13_LPUART1_RX                        NXP_SIUL2_PINMUX(0, 0, 109, 0, 188, 3)
#define PTD14_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 110, 3, 0, 0)
#define PTD14_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 110, 0, 364, 3)
#define PTE1_LPUART1_DTR_B                      NXP_SIUL2_PINMUX(0, 0, 129, 9, 0, 0)
#define PTE2_LPUART1_CTS                        NXP_SIUL2_PINMUX(0, 0, 130, 0, 361, 1)
#define PTE14_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 142, 8, 0, 0)
#define PTE14_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 142, 0, 364, 10)
#define PTE15_LPUART1_CTS                       NXP_SIUL2_PINMUX(0, 0, 143, 0, 361, 3)
#define PTE16_LPUART1_RTS                       NXP_SIUL2_PINMUX(0, 0, 144, 5, 0, 0)
#define PTF0_LPUART1_TX_O                       NXP_SIUL2_PINMUX(0, 0, 160, 8, 0, 0)
#define PTF0_LPUART1_TX_I                       NXP_SIUL2_PINMUX(0, 0, 160, 0, 364, 11)
#define PTF1_LPUART1_RX                         NXP_SIUL2_PINMUX(0, 0, 161, 0, 188, 11)
#define PTF23_LPUART1_TX_O                      NXP_SIUL2_PINMUX(0, 0, 183, 8, 0, 0)
#define PTF23_LPUART1_TX_I                      NXP_SIUL2_PINMUX(0, 0, 183, 0, 364, 12)
#define PTF24_LPUART1_RX                        NXP_SIUL2_PINMUX(0, 0, 184, 0, 188, 12)

/* LPSPI2 */
#define PTA8_LPSPI2_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 8, 3, 0, 0)
#define PTA8_LPSPI2_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 8, 0, 247, 1)
#define PTA9_LPSPI2_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 9, 3, 0, 0)
#define PTA9_LPSPI2_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 9, 0, 241, 1)
#define PTA15_LPSPI2_PCS3                       NXP_SIUL2_PINMUX(0, 0, 15, 0, 244, 1)
#define PTA21_LPSPI2_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 21, 1, 0, 0)
#define PTA21_LPSPI2_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 243, 1)
#define PTB2_LPSPI2_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 34, 3, 0, 0)
#define PTB2_LPSPI2_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 34, 0, 246, 2)
#define PTB3_LPSPI2_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 35, 3, 0, 0)
#define PTB3_LPSPI2_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 35, 0, 247, 2)
#define PTB24_LPSPI2_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 56, 9, 0, 0)
#define PTB24_LPSPI2_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 56, 0, 243, 5)
#define PTB25_LPSPI2_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 57, 5, 0, 0)
#define PTB25_LPSPI2_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 57, 0, 241, 4)
#define PTB26_LPSPI2_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 58, 8, 0, 0)
#define PTB26_LPSPI2_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 58, 0, 244, 5)
#define PTB27_LPSPI2_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 59, 5, 0, 0)
#define PTB27_LPSPI2_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 59, 0, 247, 3)
#define PTB28_LPSPI2_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 60, 5, 0, 0)
#define PTB28_LPSPI2_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 60, 0, 246, 3)
#define PTB29_LPSPI2_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 61, 5, 0, 0)
#define PTB29_LPSPI2_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 61, 0, 245, 3)
#define PTC10_LPSPI2_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 74, 4, 0, 0)
#define PTC10_LPSPI2_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 74, 0, 242, 3)
#define PTC12_LPSPI2_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 76, 4, 0, 0)
#define PTC12_LPSPI2_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 76, 0, 242, 4)
#define PTC13_LPSPI2_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 77, 9, 0, 0)
#define PTC13_LPSPI2_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 77, 0, 243, 4)
#define PTC14_LPSPI2_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 78, 3, 0, 0)
#define PTC14_LPSPI2_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 78, 0, 241, 2)
#define PTC15_LPSPI2_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 79, 3, 0, 0)
#define PTC15_LPSPI2_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 79, 0, 245, 2)
#define PTC18_LPSPI2_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 82, 9, 0, 0)
#define PTC18_LPSPI2_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 82, 0, 244, 4)
#define PTC19_LPSPI2_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 83, 5, 0, 0)
#define PTC19_LPSPI2_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 83, 0, 242, 2)
#define PTE10_LPSPI2_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 138, 3, 0, 0)
#define PTE10_LPSPI2_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 138, 0, 242, 1)
#define PTE11_LPSPI2_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 139, 2, 0, 0)
#define PTE11_LPSPI2_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 139, 0, 241, 3)
#define PTE15_LPSPI2_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 143, 3, 0, 0)
#define PTE15_LPSPI2_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 143, 0, 245, 1)
#define PTE16_LPSPI2_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 144, 3, 0, 0)
#define PTE16_LPSPI2_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 144, 0, 246, 1)
#define PTE26_LPSPI2_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 154, 9, 0, 0)
#define PTE26_LPSPI2_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 154, 0, 244, 3)
#define PTF0_LPSPI2_SCK_O                       NXP_SIUL2_PINMUX(0, 0, 160, 3, 0, 0)
#define PTF0_LPSPI2_SCK_I                       NXP_SIUL2_PINMUX(0, 0, 160, 0, 245, 4)
#define PTF1_LPSPI2_SIN_O                       NXP_SIUL2_PINMUX(0, 0, 161, 3, 0, 0)
#define PTF1_LPSPI2_SIN_I                       NXP_SIUL2_PINMUX(0, 0, 161, 0, 246, 4)
#define PTF2_LPSPI2_SOUT_O                      NXP_SIUL2_PINMUX(0, 0, 162, 3, 0, 0)
#define PTF2_LPSPI2_SOUT_I                      NXP_SIUL2_PINMUX(0, 0, 162, 0, 247, 4)
#define PTF3_LPSPI2_PCS0_O                      NXP_SIUL2_PINMUX(0, 0, 163, 3, 0, 0)
#define PTF3_LPSPI2_PCS0_I                      NXP_SIUL2_PINMUX(0, 0, 163, 0, 241, 6)
#define PTF25_LPSPI2_PCS2_O                     NXP_SIUL2_PINMUX(0, 0, 185, 5, 0, 0)
#define PTF25_LPSPI2_PCS2_I                     NXP_SIUL2_PINMUX(0, 0, 185, 0, 243, 3)
#define PTF26_LPSPI2_PCS3_O                     NXP_SIUL2_PINMUX(0, 0, 186, 5, 0, 0)
#define PTF26_LPSPI2_PCS3_I                     NXP_SIUL2_PINMUX(0, 0, 186, 0, 244, 2)

