zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* ETPU_B */
#define PTA8_ETPU_B_CH0_O                       NXP_SIUL2_PINMUX(0, 0, 8, 10, 0, 0)
#define PTA8_ETPU_B_TCRCLK                      NXP_SIUL2_PINMUX(0, 0, 8, 0, 435, 2)
#define PTA8_ETPU_B_CH0_I                       NXP_SIUL2_PINMUX(0, 0, 8, 0, 459, 2)
#define PTA9_ETPU_B_CH1_O                       NXP_SIUL2_PINMUX(0, 0, 9, 11, 0, 0)
#define PTA9_ETPU_B_CH1_I                       NXP_SIUL2_PINMUX(0, 0, 9, 0, 480, 2)
#define PTA14_ETPU_B_CH9_O                      NXP_SIUL2_PINMUX(0, 0, 14, 9, 0, 0)
#define PTA14_ETPU_B_CH9_I                      NXP_SIUL2_PINMUX(0, 0, 14, 0, 462, 3)
#define PTA18_ETPU_B_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 18, 9, 0, 0)
#define PTA18_ETPU_B_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 18, 0, 480, 3)
#define PTA20_ETPU_B_CH4_O                      NXP_SIUL2_PINMUX(0, 0, 20, 9, 0, 0)
#define PTA20_ETPU_B_CH4_I                      NXP_SIUL2_PINMUX(0, 0, 20, 0, 455, 2)
#define PTA21_ETPU_B_CH11_O                     NXP_SIUL2_PINMUX(0, 0, 21, 9, 0, 0)
#define PTA21_ETPU_B_CH11_I                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 511, 1)
#define PTA23_ETPU_B_CH13_O                     NXP_SIUL2_PINMUX(0, 0, 23, 11, 0, 0)
#define PTA23_ETPU_B_CH13_I                     NXP_SIUL2_PINMUX(0, 0, 23, 0, 453, 3)
#define PTA24_ETPU_B_CH8_O                      NXP_SIUL2_PINMUX(0, 0, 24, 8, 0, 0)
#define PTA24_ETPU_B_CH8_I                      NXP_SIUL2_PINMUX(0, 0, 24, 0, 482, 3)
#define PTA25_ETPU_B_CH9_O                      NXP_SIUL2_PINMUX(0, 0, 25, 9, 0, 0)
#define PTA25_ETPU_B_CH9_I                      NXP_SIUL2_PINMUX(0, 0, 25, 0, 462, 2)
#define PTA31_ETPU_B_CH28_O                     NXP_SIUL2_PINMUX(0, 0, 31, 9, 0, 0)
#define PTA31_ETPU_B_CH28_I                     NXP_SIUL2_PINMUX(0, 0, 31, 0, 384, 3)
#define PTB0_ETPU_B_CH7_O                       NXP_SIUL2_PINMUX(0, 0, 32, 8, 0, 0)
#define PTB0_ETPU_B_CH7_I                       NXP_SIUL2_PINMUX(0, 0, 32, 0, 463, 1)
#define PTB1_ETPU_B_CH9_O                       NXP_SIUL2_PINMUX(0, 0, 33, 10, 0, 0)
#define PTB1_ETPU_B_CH9_I                       NXP_SIUL2_PINMUX(0, 0, 33, 0, 462, 1)
#define PTB12_ETPU_B_CH2_O                      NXP_SIUL2_PINMUX(0, 0, 44, 9, 0, 0)
#define PTB12_ETPU_B_CH2_I                      NXP_SIUL2_PINMUX(0, 0, 44, 0, 456, 1)
#define PTB13_ETPU_B_CH4_O                      NXP_SIUL2_PINMUX(0, 0, 45, 9, 0, 0)
#define PTB13_ETPU_B_CH4_I                      NXP_SIUL2_PINMUX(0, 0, 45, 0, 455, 1)
#define PTB15_ETPU_B_CH13_O                     NXP_SIUL2_PINMUX(0, 0, 47, 10, 0, 0)
#define PTB15_ETPU_B_CH13_I                     NXP_SIUL2_PINMUX(0, 0, 47, 0, 453, 1)
#define PTB16_ETPU_B_CH14_O                     NXP_SIUL2_PINMUX(0, 0, 48, 10, 0, 0)
#define PTB16_ETPU_B_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 48, 11, 0, 0)
#define PTB16_ETPU_B_CH14_I                     NXP_SIUL2_PINMUX(0, 0, 48, 0, 452, 1)
#define PTB16_ETPU_B_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 48, 0, 480, 1)
#define PTB17_ETPU_B_CH16_O                     NXP_SIUL2_PINMUX(0, 0, 49, 9, 0, 0)
#define PTB17_ETPU_B_CH16_I                     NXP_SIUL2_PINMUX(0, 0, 49, 0, 451, 1)
#define PTB18_ETPU_B_CH29_O                     NXP_SIUL2_PINMUX(0, 0, 50, 10, 0, 0)
#define PTB18_ETPU_B_CH29_I                     NXP_SIUL2_PINMUX(0, 0, 50, 0, 385, 3)
#define PTB20_ETPU_B_CH13_O                     NXP_SIUL2_PINMUX(0, 0, 52, 10, 0, 0)
#define PTB20_ETPU_B_CH13_I                     NXP_SIUL2_PINMUX(0, 0, 52, 0, 453, 2)
#define PTB21_ETPU_B_CH14_O                     NXP_SIUL2_PINMUX(0, 0, 53, 10, 0, 0)
#define PTB21_ETPU_B_CH14_I                     NXP_SIUL2_PINMUX(0, 0, 53, 0, 452, 2)
#define PTB23_ETPU_B_CH20_O                     NXP_SIUL2_PINMUX(0, 0, 55, 10, 0, 0)
#define PTB23_ETPU_B_CH20_I                     NXP_SIUL2_PINMUX(0, 0, 55, 0, 471, 2)
#define PTB25_ETPU_B_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 57, 9, 0, 0)
#define PTB25_ETPU_B_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 57, 0, 470, 2)
#define PTC0_ETPU_B_CH26_O                      NXP_SIUL2_PINMUX(0, 0, 64, 8, 0, 0)
#define PTC0_ETPU_B_CH26_I                      NXP_SIUL2_PINMUX(0, 0, 64, 0, 382, 1)
#define PTC10_ETPU_B_CH5_O                      NXP_SIUL2_PINMUX(0, 0, 74, 13, 0, 0)
#define PTC10_ETPU_B_CH5_I                      NXP_SIUL2_PINMUX(0, 0, 74, 0, 474, 2)
#define PTC11_ETPU_B_CH19_O                     NXP_SIUL2_PINMUX(0, 0, 75, 8, 0, 0)
#define PTC11_ETPU_B_CH6_O                      NXP_SIUL2_PINMUX(0, 0, 75, 9, 0, 0)
#define PTC11_ETPU_B_CH19_I                     NXP_SIUL2_PINMUX(0, 0, 75, 0, 460, 1)
#define PTC11_ETPU_B_CH6_I                      NXP_SIUL2_PINMUX(0, 0, 75, 0, 478, 1)
#define PTC17_ETPU_B_CH19_O                     NXP_SIUL2_PINMUX(0, 0, 81, 10, 0, 0)
#define PTC17_ETPU_B_CH19_I                     NXP_SIUL2_PINMUX(0, 0, 81, 0, 460, 2)
#define PTC20_ETPU_B_CH30_O                     NXP_SIUL2_PINMUX(0, 0, 84, 9, 0, 0)
#define PTC20_ETPU_B_CH30_I                     NXP_SIUL2_PINMUX(0, 0, 84, 0, 386, 1)
#define PTC21_ETPU_B_CH31_O                     NXP_SIUL2_PINMUX(0, 0, 85, 9, 0, 0)
#define PTC21_ETPU_B_CH31_I                     NXP_SIUL2_PINMUX(0, 0, 85, 0, 387, 1)
#define PTC24_ETPU_B_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 88, 9, 0, 0)
#define PTC24_ETPU_B_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 88, 0, 470, 1)
#define PTC25_ETPU_B_CH20_O                     NXP_SIUL2_PINMUX(0, 0, 89, 8, 0, 0)
#define PTC25_ETPU_B_CH8_O                      NXP_SIUL2_PINMUX(0, 0, 89, 9, 0, 0)
#define PTC25_ETPU_B_CH20_I                     NXP_SIUL2_PINMUX(0, 0, 89, 0, 471, 1)
#define PTC25_ETPU_B_CH8_I                      NXP_SIUL2_PINMUX(0, 0, 89, 0, 482, 1)
#define PTC26_ETPU_B_CH18_O                     NXP_SIUL2_PINMUX(0, 0, 90, 8, 0, 0)
#define PTC26_ETPU_B_CH18_I                     NXP_SIUL2_PINMUX(0, 0, 90, 0, 472, 1)
#define PTC28_ETPU_B_CH5_O                      NXP_SIUL2_PINMUX(0, 0, 92, 8, 0, 0)
#define PTC28_ETPU_B_CH5_I                      NXP_SIUL2_PINMUX(0, 0, 92, 0, 474, 1)
#define PTD0_ETPU_B_CH17_O                      NXP_SIUL2_PINMUX(0, 0, 96, 8, 0, 0)
#define PTD0_ETPU_B_CH17_I                      NXP_SIUL2_PINMUX(0, 0, 96, 0, 510, 1)
#define PTD1_ETPU_B_CH12_O                      NXP_SIUL2_PINMUX(0, 0, 97, 10, 0, 0)
#define PTD1_ETPU_B_CH12_I                      NXP_SIUL2_PINMUX(0, 0, 97, 0, 509, 1)
#define PTD5_ETPU_B_CH16_O                      NXP_SIUL2_PINMUX(0, 0, 101, 9, 0, 0)
#define PTD5_ETPU_B_CH16_I                      NXP_SIUL2_PINMUX(0, 0, 101, 0, 451, 2)
#define PTD6_ETPU_B_CH15_O                      NXP_SIUL2_PINMUX(0, 0, 102, 9, 0, 0)
#define PTD6_ETPU_B_CH15_I                      NXP_SIUL2_PINMUX(0, 0, 102, 0, 457, 2)
#define PTD8_ETPU_B_CH18_O                      NXP_SIUL2_PINMUX(0, 0, 104, 10, 0, 0)
#define PTD8_ETPU_B_CH18_I                      NXP_SIUL2_PINMUX(0, 0, 104, 0, 472, 2)
#define PTD9_ETPU_B_CH27_O                      NXP_SIUL2_PINMUX(0, 0, 105, 10, 0, 0)
#define PTD9_ETPU_B_CH27_I                      NXP_SIUL2_PINMUX(0, 0, 105, 0, 383, 1)
#define PTD10_ETPU_B_CH25_O                     NXP_SIUL2_PINMUX(0, 0, 106, 8, 0, 0)
#define PTD10_ETPU_B_CH25_I                     NXP_SIUL2_PINMUX(0, 0, 106, 0, 381, 1)
#define PTD11_ETPU_B_CH24_O                     NXP_SIUL2_PINMUX(0, 0, 107, 8, 0, 0)
#define PTD11_ETPU_B_CH24_I                     NXP_SIUL2_PINMUX(0, 0, 107, 0, 380, 1)
#define PTD18_ETPU_B_CH25_O                     NXP_SIUL2_PINMUX(0, 0, 114, 9, 0, 0)
#define PTD18_ETPU_B_CH25_I                     NXP_SIUL2_PINMUX(0, 0, 114, 0, 381, 2)
#define PTD19_ETPU_B_CH27_O                     NXP_SIUL2_PINMUX(0, 0, 115, 9, 0, 0)
#define PTD19_ETPU_B_CH27_I                     NXP_SIUL2_PINMUX(0, 0, 115, 0, 383, 2)
#define PTD20_ETPU_B_CH15_O                     NXP_SIUL2_PINMUX(0, 0, 116, 8, 0, 0)
#define PTD20_ETPU_B_CH3_O                      NXP_SIUL2_PINMUX(0, 0, 116, 10, 0, 0)
#define PTD20_ETPU_B_CH15_I                     NXP_SIUL2_PINMUX(0, 0, 116, 0, 457, 1)
#define PTD20_ETPU_B_CH3_I                      NXP_SIUL2_PINMUX(0, 0, 116, 0, 483, 1)
#define PTD22_ETPU_B_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 118, 8, 0, 0)
#define PTD22_ETPU_B_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 118, 0, 435, 1)
#define PTD22_ETPU_B_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 118, 0, 459, 1)
#define PTD25_ETPU_B_CH10_O                     NXP_SIUL2_PINMUX(0, 0, 121, 10, 0, 0)
#define PTD25_ETPU_B_CH10_I                     NXP_SIUL2_PINMUX(0, 0, 121, 0, 508, 2)
#define PTE0_ETPU_B_CH4_O                       NXP_SIUL2_PINMUX(0, 0, 128, 9, 0, 0)
#define PTE0_ETPU_B_CH4_I                       NXP_SIUL2_PINMUX(0, 0, 128, 0, 455, 3)
#define PTE1_ETPU_B_CH2_O                       NXP_SIUL2_PINMUX(0, 0, 129, 11, 0, 0)
#define PTE1_ETPU_B_CH2_I                       NXP_SIUL2_PINMUX(0, 0, 129, 0, 456, 2)
#define PTE4_ETPU_B_CH6_O                       NXP_SIUL2_PINMUX(0, 0, 132, 10, 0, 0)
#define PTE4_ETPU_B_CH6_I                       NXP_SIUL2_PINMUX(0, 0, 132, 0, 478, 2)
#define PTE5_ETPU_B_CH5_O                       NXP_SIUL2_PINMUX(0, 0, 133, 11, 0, 0)
#define PTE5_ETPU_B_CH5_I                       NXP_SIUL2_PINMUX(0, 0, 133, 0, 474, 3)
#define PTE10_ETPU_B_CH23_O                     NXP_SIUL2_PINMUX(0, 0, 138, 9, 0, 0)
#define PTE10_ETPU_B_CH23_I                     NXP_SIUL2_PINMUX(0, 0, 138, 0, 379, 1)
#define PTE11_ETPU_B_CH22_O                     NXP_SIUL2_PINMUX(0, 0, 139, 11, 0, 0)
#define PTE11_ETPU_B_CH22_I                     NXP_SIUL2_PINMUX(0, 0, 139, 0, 407, 1)
#define PTE15_ETPU_B_CH10_O                     NXP_SIUL2_PINMUX(0, 0, 143, 8, 0, 0)
#define PTE15_ETPU_B_CH10_I                     NXP_SIUL2_PINMUX(0, 0, 143, 0, 508, 1)
#define PTE16_ETPU_B_CH8_O                      NXP_SIUL2_PINMUX(0, 0, 144, 9, 0, 0)
#define PTE16_ETPU_B_CH8_I                      NXP_SIUL2_PINMUX(0, 0, 144, 0, 482, 2)
#define PTE20_ETPU_B_CH3_O                      NXP_SIUL2_PINMUX(0, 0, 148, 9, 0, 0)
#define PTE20_ETPU_B_CH3_I                      NXP_SIUL2_PINMUX(0, 0, 148, 0, 483, 3)
#define PTE21_ETPU_B_CH6_O                      NXP_SIUL2_PINMUX(0, 0, 149, 9, 0, 0)
#define PTE21_ETPU_B_CH6_I                      NXP_SIUL2_PINMUX(0, 0, 149, 0, 478, 3)
#define PTE26_ETPU_B_CH3_O                      NXP_SIUL2_PINMUX(0, 0, 154, 11, 0, 0)
#define PTE26_ETPU_B_CH3_I                      NXP_SIUL2_PINMUX(0, 0, 154, 0, 483, 2)
#define PTE27_ETPU_B_CH28_O                     NXP_SIUL2_PINMUX(0, 0, 155, 8, 0, 0)
#define PTE27_ETPU_B_CH28_I                     NXP_SIUL2_PINMUX(0, 0, 155, 0, 384, 1)
#define PTE28_ETPU_B_CH29_O                     NXP_SIUL2_PINMUX(0, 0, 156, 8, 0, 0)
#define PTE28_ETPU_B_CH29_I                     NXP_SIUL2_PINMUX(0, 0, 156, 0, 385, 1)
#define PTE29_ETPU_B_CH7_O                      NXP_SIUL2_PINMUX(0, 0, 157, 9, 0, 0)
#define PTE29_ETPU_B_CH7_I                      NXP_SIUL2_PINMUX(0, 0, 157, 0, 463, 3)
#define PTE30_ETPU_B_CH10_O                     NXP_SIUL2_PINMUX(0, 0, 158, 9, 0, 0)
#define PTE30_ETPU_B_CH10_I                     NXP_SIUL2_PINMUX(0, 0, 158, 0, 508, 3)
#define PTE31_ETPU_B_CH11_O                     NXP_SIUL2_PINMUX(0, 0, 159, 10, 0, 0)
#define PTE31_ETPU_B_CH11_I                     NXP_SIUL2_PINMUX(0, 0, 159, 0, 511, 2)
#define PTF0_ETPU_B_CH12_O                      NXP_SIUL2_PINMUX(0, 0, 160, 11, 0, 0)
#define PTF0_ETPU_B_CH12_I                      NXP_SIUL2_PINMUX(0, 0, 160, 0, 509, 2)
#define PTF1_ETPU_B_CH17_O                      NXP_SIUL2_PINMUX(0, 0, 161, 10, 0, 0)
#define PTF1_ETPU_B_CH17_I                      NXP_SIUL2_PINMUX(0, 0, 161, 0, 510, 2)
#define PTF2_ETPU_B_CH11_O                      NXP_SIUL2_PINMUX(0, 0, 162, 10, 0, 0)
#define PTF2_ETPU_B_CH11_I                      NXP_SIUL2_PINMUX(0, 0, 162, 0, 511, 3)
#define PTF4_ETPU_B_CH12_O                      NXP_SIUL2_PINMUX(0, 0, 164, 9, 0, 0)
#define PTF4_ETPU_B_CH12_I                      NXP_SIUL2_PINMUX(0, 0, 164, 0, 509, 3)
#define PTF7_ETPU_B_CH17_O                      NXP_SIUL2_PINMUX(0, 0, 167, 9, 0, 0)
#define PTF7_ETPU_B_CH17_I                      NXP_SIUL2_PINMUX(0, 0, 167, 0, 510, 3)
#define PTF8_ETPU_B_CH22_O                      NXP_SIUL2_PINMUX(0, 0, 168, 10, 0, 0)
#define PTF8_ETPU_B_CH22_I                      NXP_SIUL2_PINMUX(0, 0, 168, 0, 407, 3)
#define PTF9_ETPU_B_CH23_O                      NXP_SIUL2_PINMUX(0, 0, 169, 9, 0, 0)
#define PTF9_ETPU_B_CH23_I                      NXP_SIUL2_PINMUX(0, 0, 169, 0, 379, 3)
#define PTF10_ETPU_B_CH24_O                     NXP_SIUL2_PINMUX(0, 0, 170, 9, 0, 0)
#define PTF10_ETPU_B_CH24_I                     NXP_SIUL2_PINMUX(0, 0, 170, 0, 380, 3)
#define PTF11_ETPU_B_CH25_O                     NXP_SIUL2_PINMUX(0, 0, 171, 9, 0, 0)
#define PTF11_ETPU_B_CH25_I                     NXP_SIUL2_PINMUX(0, 0, 171, 0, 381, 3)
#define PTF12_ETPU_B_CH26_O                     NXP_SIUL2_PINMUX(0, 0, 172, 11, 0, 0)
#define PTF12_ETPU_B_CH26_I                     NXP_SIUL2_PINMUX(0, 0, 172, 0, 382, 3)
#define PTF13_ETPU_B_CH27_O                     NXP_SIUL2_PINMUX(0, 0, 173, 10, 0, 0)
#define PTF13_ETPU_B_CH27_I                     NXP_SIUL2_PINMUX(0, 0, 173, 0, 383, 3)
#define PTF14_ETPU_B_CH18_O                     NXP_SIUL2_PINMUX(0, 0, 174, 10, 0, 0)
#define PTF14_ETPU_B_CH18_I                     NXP_SIUL2_PINMUX(0, 0, 174, 0, 472, 3)
#define PTF15_ETPU_B_CH1_O                      NXP_SIUL2_PINMUX(0, 0, 175, 9, 0, 0)
#define PTF15_ETPU_B_CH20_O                     NXP_SIUL2_PINMUX(0, 0, 175, 10, 0, 0)
#define PTF15_ETPU_B_CH20_I                     NXP_SIUL2_PINMUX(0, 0, 175, 0, 471, 3)
#define PTF15_ETPU_B_CH1_I                      NXP_SIUL2_PINMUX(0, 0, 175, 0, 480, 4)
#define PTF16_ETPU_B_CH2_O                      NXP_SIUL2_PINMUX(0, 0, 176, 9, 0, 0)
#define PTF16_ETPU_B_CH21_O                     NXP_SIUL2_PINMUX(0, 0, 176, 10, 0, 0)
#define PTF16_ETPU_B_CH2_I                      NXP_SIUL2_PINMUX(0, 0, 176, 0, 456, 3)
#define PTF16_ETPU_B_CH21_I                     NXP_SIUL2_PINMUX(0, 0, 176, 0, 470, 3)
#define PTF17_ETPU_B_CH22_O                     NXP_SIUL2_PINMUX(0, 0, 177, 9, 0, 0)
#define PTF17_ETPU_B_CH22_I                     NXP_SIUL2_PINMUX(0, 0, 177, 0, 407, 2)
#define PTF18_ETPU_B_CH26_O                     NXP_SIUL2_PINMUX(0, 0, 178, 9, 0, 0)
#define PTF18_ETPU_B_CH26_I                     NXP_SIUL2_PINMUX(0, 0, 178, 0, 382, 2)
#define PTF19_ETPU_B_CH23_O                     NXP_SIUL2_PINMUX(0, 0, 179, 9, 0, 0)
#define PTF19_ETPU_B_CH23_I                     NXP_SIUL2_PINMUX(0, 0, 179, 0, 379, 2)
#define PTF20_ETPU_B_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 180, 10, 0, 0)
#define PTF20_ETPU_B_CH19_O                     NXP_SIUL2_PINMUX(0, 0, 180, 11, 0, 0)
#define PTF20_ETPU_B_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 435, 3)
#define PTF20_ETPU_B_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 180, 0, 459, 3)
#define PTF20_ETPU_B_CH19_I                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 460, 3)
#define PTF21_ETPU_B_CH24_O                     NXP_SIUL2_PINMUX(0, 0, 181, 8, 0, 0)
#define PTF21_ETPU_B_CH24_I                     NXP_SIUL2_PINMUX(0, 0, 181, 0, 380, 2)
#define PTF23_ETPU_B_CH7_O                      NXP_SIUL2_PINMUX(0, 0, 183, 10, 0, 0)
#define PTF23_ETPU_B_CH7_I                      NXP_SIUL2_PINMUX(0, 0, 183, 0, 463, 2)
#define PTF25_ETPU_B_CH0_O                      NXP_SIUL2_PINMUX(0, 0, 185, 11, 0, 0)
#define PTF25_ETPU_B_TCRCLK                     NXP_SIUL2_PINMUX(0, 0, 185, 0, 435, 4)
#define PTF25_ETPU_B_CH0_I                      NXP_SIUL2_PINMUX(0, 0, 185, 0, 459, 4)
#define PTF26_ETPU_B_CH2_O                      NXP_SIUL2_PINMUX(0, 0, 186, 9, 0, 0)
#define PTF26_ETPU_B_CH2_I                      NXP_SIUL2_PINMUX(0, 0, 186, 0, 456, 4)
#define PTF27_ETPU_B_CH30_O                     NXP_SIUL2_PINMUX(0, 0, 187, 12, 0, 0)
#define PTF27_ETPU_B_CH30_I                     NXP_SIUL2_PINMUX(0, 0, 187, 0, 386, 3)
#define PTF29_ETPU_B_CH29_O                     NXP_SIUL2_PINMUX(0, 0, 189, 11, 0, 0)
#define PTF29_ETPU_B_CH29_I                     NXP_SIUL2_PINMUX(0, 0, 189, 0, 385, 2)
#define PTF30_ETPU_B_CH31_O                     NXP_SIUL2_PINMUX(0, 0, 190, 9, 0, 0)
#define PTF30_ETPU_B_CH31_I                     NXP_SIUL2_PINMUX(0, 0, 190, 0, 387, 3)
#define PTG2_ETPU_B_CH30_O                      NXP_SIUL2_PINMUX(0, 0, 194, 8, 0, 0)
#define PTG2_ETPU_B_CH30_I                      NXP_SIUL2_PINMUX(0, 0, 194, 0, 386, 2)
#define PTG3_ETPU_B_CH31_O                      NXP_SIUL2_PINMUX(0, 0, 195, 10, 0, 0)
#define PTG3_ETPU_B_CH31_I                      NXP_SIUL2_PINMUX(0, 0, 195, 0, 387, 2)
#define PTG4_ETPU_B_CH15_O                      NXP_SIUL2_PINMUX(0, 0, 196, 9, 0, 0)
#define PTG4_ETPU_B_CH15_I                      NXP_SIUL2_PINMUX(0, 0, 196, 0, 457, 3)
#define PTG5_ETPU_B_CH16_O                      NXP_SIUL2_PINMUX(0, 0, 197, 9, 0, 0)
#define PTG5_ETPU_B_CH16_I                      NXP_SIUL2_PINMUX(0, 0, 197, 0, 451, 3)
#define PTG8_ETPU_B_CH14_O                      NXP_SIUL2_PINMUX(0, 0, 200, 11, 0, 0)
#define PTG8_ETPU_B_CH14_I                      NXP_SIUL2_PINMUX(0, 0, 200, 0, 452, 3)
#define PTG13_ETPU_B_CH28_O                     NXP_SIUL2_PINMUX(0, 0, 205, 10, 0, 0)
#define PTG13_ETPU_B_CH28_I                     NXP_SIUL2_PINMUX(0, 0, 205, 0, 384, 2)

/* PG */
#define PTA8_EXTWAKE                            NXP_SIUL2_PINMUX(0, 0, 8, 12, 0, 0)
#define PTA9_PGOOD                              NXP_SIUL2_PINMUX(0, 0, 9, 0, 440, 2)
#define PTA20_PGOOD                             NXP_SIUL2_PINMUX(0, 0, 20, 0, 440, 1)
#define PTA25_EXTWAKE                           NXP_SIUL2_PINMUX(0, 0, 25, 11, 0, 0)
#define PTA26_PGOOD                             NXP_SIUL2_PINMUX(0, 0, 26, 0, 440, 3)
#define PTE21_EXTWAKE                           NXP_SIUL2_PINMUX(0, 0, 149, 10, 0, 0)

/* LPUART2 */
#define PTA8_LPUART2_RX                         NXP_SIUL2_PINMUX(0, 0, 8, 0, 189, 3)
#define PTA9_LPUART2_TX_O                       NXP_SIUL2_PINMUX(0, 0, 9, 2, 0, 0)
#define PTA9_LPUART2_TX_I                       NXP_SIUL2_PINMUX(0, 0, 9, 0, 365, 1)
#define PTA15_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 15, 0, 189, 6)
#define PTA29_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 29, 4, 0, 0)
#define PTA29_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 29, 0, 365, 5)
#define PTA30_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 30, 0, 189, 4)
#define PTB29_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 61, 10, 0, 0)
#define PTB29_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 61, 0, 365, 7)
#define PTC12_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 76, 0, 189, 7)
#define PTC13_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 77, 8, 0, 0)
#define PTC13_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 77, 0, 365, 8)
#define PTC15_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 79, 5, 0, 0)
#define PTC15_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 79, 0, 365, 2)
#define PTC16_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 80, 0, 189, 5)
#define PTC18_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 82, 0, 189, 8)
#define PTD6_LPUART2_RX                         NXP_SIUL2_PINMUX(0, 0, 102, 0, 189, 1)
#define PTD7_LPUART2_TX_O                       NXP_SIUL2_PINMUX(0, 0, 103, 2, 0, 0)
#define PTD7_LPUART2_TX_I                       NXP_SIUL2_PINMUX(0, 0, 103, 0, 365, 3)
#define PTD8_LPUART2_RX                         NXP_SIUL2_PINMUX(0, 0, 104, 0, 189, 9)
#define PTD9_LPUART2_TX_O                       NXP_SIUL2_PINMUX(0, 0, 105, 9, 0, 0)
#define PTD9_LPUART2_TX_I                       NXP_SIUL2_PINMUX(0, 0, 105, 0, 365, 9)
#define PTD11_LPUART2_CTS                       NXP_SIUL2_PINMUX(0, 0, 107, 0, 362, 1)
#define PTD12_LPUART2_RTS                       NXP_SIUL2_PINMUX(0, 0, 108, 3, 0, 0)
#define PTD15_LPUART2_CTS                       NXP_SIUL2_PINMUX(0, 0, 111, 0, 362, 2)
#define PTD16_LPUART2_RTS                       NXP_SIUL2_PINMUX(0, 0, 112, 6, 0, 0)
#define PTD17_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 113, 0, 189, 2)
#define PTE9_LPUART2_CTS                        NXP_SIUL2_PINMUX(0, 0, 137, 0, 362, 3)
#define PTF2_LPUART2_TX_O                       NXP_SIUL2_PINMUX(0, 0, 162, 8, 0, 0)
#define PTF2_LPUART2_TX_I                       NXP_SIUL2_PINMUX(0, 0, 162, 0, 365, 11)
#define PTF3_LPUART2_RX                         NXP_SIUL2_PINMUX(0, 0, 163, 0, 189, 10)
#define PTF12_LPUART2_TX_O                      NXP_SIUL2_PINMUX(0, 0, 172, 8, 0, 0)
#define PTF12_LPUART2_TX_I                      NXP_SIUL2_PINMUX(0, 0, 172, 0, 365, 12)
#define PTF13_LPUART2_RX                        NXP_SIUL2_PINMUX(0, 0, 173, 0, 189, 11)
#define PTH8_LPUART2_TX                         NXP_SIUL2_PINMUX(0, 0, 232, 8, 0, 0)
#define PTH8_LPUART2_TX                         NXP_SIUL2_PINMUX(0, 0, 232, 0, 365, 13)
#define PTH9_LPUART2_RX_I                       NXP_SIUL2_PINMUX(0, 0, 233, 0, 189, 12)
#define PTH8_LPUART2_TX                         NXP_SIUL2_PINMUX(0, 0, 232, 8, 0, 0)
#define PTH8_LPUART2_TX                         NXP_SIUL2_PINMUX(0, 0, 232, 0, 365, 13)
#define PTH9_LPUART2_RX_I                       NXP_SIUL2_PINMUX(0, 0, 233, 0, 189, 12)

