zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* LPCMP1 */
#define PTA9_LPCMP1_OUT                         NXP_SIUL2_PINMUX(0, 0, 9, 8, 0, 0)
#define PTC30_LPCMP1_OUT                        NXP_SIUL2_PINMUX(0, 0, 94, 12, 0, 0)
#define PTE1_LPCMP1_OUT                         NXP_SIUL2_PINMUX(0, 0, 129, 12, 0, 0)
#define PTE15_LPCMP1_RRT                        NXP_SIUL2_PINMUX(0, 0, 143, 5, 0, 0)
#define PTE30_LPCMP1_OUT                        NXP_SIUL2_PINMUX(0, 0, 158, 2, 0, 0)
#define PTE31_LPCMP1_RRT                        NXP_SIUL2_PINMUX(0, 0, 159, 2, 0, 0)

/* JTAGTRACENOETM */
#define PTA10_JTAG_TDOTRACENOETM_SWO            NXP_SIUL2_PINMUX(0, 0, 10, 7, 0, 0)

/* TRACE */
#define PTA18_EVTI_0                            NXP_SIUL2_PINMUX(0, 0, 18, 0, 388, 2)
#define PTA19_EVTO_0                            NXP_SIUL2_PINMUX(0, 0, 19, 12, 0, 0)
#define PTB10_EVTO_1                            NXP_SIUL2_PINMUX(0, 0, 42, 9, 0, 0)
#define PTC0_TRACE_ETM_D0                       NXP_SIUL2_PINMUX(0, 0, 64, 10, 0, 0)
#define PTC1_TRACE_ETM_CLKOUT                   NXP_SIUL2_PINMUX(0, 0, 65, 8, 0, 0)
#define PTC2_TRACE_ETM_CLKOUT                   NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PTC17_TRACE_ETM_D3                      NXP_SIUL2_PINMUX(0, 0, 81, 11, 0, 0)
#define PTC20_EVTI_1                            NXP_SIUL2_PINMUX(0, 0, 84, 0, 389, 2)
#define PTC21_EVTO_1                            NXP_SIUL2_PINMUX(0, 0, 85, 11, 0, 0)
#define PTC23_EVTO_0                            NXP_SIUL2_PINMUX(0, 0, 87, 12, 0, 0)
#define PTD7_TRACE_ETM_D0                       NXP_SIUL2_PINMUX(0, 0, 103, 6, 0, 0)
#define PTD8_TRACE_ETM_D2                       NXP_SIUL2_PINMUX(0, 0, 104, 11, 0, 0)
#define PTD9_TRACE_ETM_D1                       NXP_SIUL2_PINMUX(0, 0, 105, 12, 0, 0)
#define PTD10_TRACE_ETM_D3                      NXP_SIUL2_PINMUX(0, 0, 106, 4, 0, 0)
#define PTD11_TRACE_ETM_D2                      NXP_SIUL2_PINMUX(0, 0, 107, 4, 0, 0)
#define PTD12_TRACE_ETM_D1                      NXP_SIUL2_PINMUX(0, 0, 108, 4, 0, 0)
#define PTD25_EVTI_1                            NXP_SIUL2_PINMUX(0, 0, 121, 0, 389, 1)
#define PTF6_EVTI_1                             NXP_SIUL2_PINMUX(0, 0, 166, 0, 389, 3)
#define PTF23_EVTI_0                            NXP_SIUL2_PINMUX(0, 0, 183, 0, 388, 4)
#define PTF24_EVTI_0                            NXP_SIUL2_PINMUX(0, 0, 184, 0, 388, 3)
#define PTF25_EVTO_0                            NXP_SIUL2_PINMUX(0, 0, 185, 10, 0, 0)
#define PTF28_TRACE_ETM_D5                      NXP_SIUL2_PINMUX(0, 0, 188, 7, 0, 0)
#define PTF31_TRACE_ETM_D3                      NXP_SIUL2_PINMUX(0, 0, 191, 7, 0, 0)
#define PTG2_EVTI_0                             NXP_SIUL2_PINMUX(0, 0, 194, 0, 388, 1)
#define PTG3_EVTO_0                             NXP_SIUL2_PINMUX(0, 0, 195, 9, 0, 0)
#define PTG6_TRACE_ETM_CLKOUT                   NXP_SIUL2_PINMUX(0, 0, 198, 7, 0, 0)
#define PTG7_TRACE_ETM_D0                       NXP_SIUL2_PINMUX(0, 0, 199, 7, 0, 0)
#define PTG12_EVTO_1                            NXP_SIUL2_PINMUX(0, 0, 204, 10, 0, 0)
#define PTG15_TRACE_ETM_D1                      NXP_SIUL2_PINMUX(0, 0, 207, 7, 0, 0)
#define PTG16_TRACE_ETM_D2                      NXP_SIUL2_PINMUX(0, 0, 208, 7, 0, 0)
#define PTG17_TRACE_ETM_D4                      NXP_SIUL2_PINMUX(0, 0, 209, 7, 0, 0)
#define PTG18_TRACE_ETM_D6                      NXP_SIUL2_PINMUX(0, 0, 210, 7, 0, 0)
#define PTG19_TRACE_ETM_D7                      NXP_SIUL2_PINMUX(0, 0, 211, 7, 0, 0)
#define PTG20_TRACE_ETM_D8                      NXP_SIUL2_PINMUX(0, 0, 212, 7, 0, 0)
#define PTG21_TRACE_ETM_D9                      NXP_SIUL2_PINMUX(0, 0, 213, 7, 0, 0)
#define PTG22_TRACE_ETM_D10_O                   NXP_SIUL2_PINMUX(0, 0, 214, 7, 0, 0)
#define PTG23_TRACE_ETM_D11_O                   NXP_SIUL2_PINMUX(0, 0, 215, 7, 0, 0)
#define PTG24_TRACE_ETM_D12_O                   NXP_SIUL2_PINMUX(0, 0, 216, 7, 0, 0)
#define PTG25_TRACE_ETM_D13_O                   NXP_SIUL2_PINMUX(0, 0, 217, 7, 0, 0)
#define PTG26_TRACE_ETM_D14_O                   NXP_SIUL2_PINMUX(0, 0, 218, 7, 0, 0)
#define PTG27_TRACE_ETM_D15_O                   NXP_SIUL2_PINMUX(0, 0, 219, 7, 0, 0)
#define PTH7_TRACE_ETM_D10_O                    NXP_SIUL2_PINMUX(0, 0, 231, 7, 0, 0)
#define PTH8_TRACE_ETM_D11_O                    NXP_SIUL2_PINMUX(0, 0, 232, 7, 0, 0)
#define PTH9_TRACE_ETM_D12_O                    NXP_SIUL2_PINMUX(0, 0, 233, 7, 0, 0)
#define PTH10_TRACE_ETM_D13_O                   NXP_SIUL2_PINMUX(0, 0, 234, 7, 0, 0)
#define PTH11_TRACE_ETM_D14_O                   NXP_SIUL2_PINMUX(0, 0, 235, 7, 0, 0)
#define PTH12_TRACE_ETM_D15_O                   NXP_SIUL2_PINMUX(0, 0, 236, 7, 0, 0)
#define PTG22_TRACE_ETM_D10_O                   NXP_SIUL2_PINMUX(0, 0, 214, 7, 0, 0)
#define PTG23_TRACE_ETM_D11_O                   NXP_SIUL2_PINMUX(0, 0, 215, 7, 0, 0)
#define PTG24_TRACE_ETM_D12_O                   NXP_SIUL2_PINMUX(0, 0, 216, 7, 0, 0)
#define PTG25_TRACE_ETM_D13_O                   NXP_SIUL2_PINMUX(0, 0, 217, 7, 0, 0)
#define PTG26_TRACE_ETM_D14_O                   NXP_SIUL2_PINMUX(0, 0, 218, 7, 0, 0)
#define PTG27_TRACE_ETM_D15_O                   NXP_SIUL2_PINMUX(0, 0, 219, 7, 0, 0)
#define PTH7_TRACE_ETM_D10_O                    NXP_SIUL2_PINMUX(0, 0, 231, 7, 0, 0)
#define PTH8_TRACE_ETM_D11_O                    NXP_SIUL2_PINMUX(0, 0, 232, 7, 0, 0)
#define PTH9_TRACE_ETM_D12_O                    NXP_SIUL2_PINMUX(0, 0, 233, 7, 0, 0)
#define PTH10_TRACE_ETM_D13_O                   NXP_SIUL2_PINMUX(0, 0, 234, 7, 0, 0)
#define PTH11_TRACE_ETM_D14_O                   NXP_SIUL2_PINMUX(0, 0, 235, 7, 0, 0)
#define PTH12_TRACE_ETM_D15_O                   NXP_SIUL2_PINMUX(0, 0, 236, 7, 0, 0)

/* TRGMUX */
#define PTA22_TRGMUX_OUT3                       NXP_SIUL2_PINMUX(0, 0, 22, 8, 0, 0)
#define PTA31_TRGMUX_OUT8                       NXP_SIUL2_PINMUX(0, 0, 31, 7, 0, 0)
#define PTB2_TRGMUX_IN3                         NXP_SIUL2_PINMUX(0, 0, 34, 0, 347, 1)
#define PTB3_TRGMUX_IN2                         NXP_SIUL2_PINMUX(0, 0, 35, 0, 346, 1)
#define PTB4_TRGMUX_IN1                         NXP_SIUL2_PINMUX(0, 0, 36, 0, 345, 1)
#define PTB5_TRGMUX_IN0                         NXP_SIUL2_PINMUX(0, 0, 37, 0, 344, 1)
#define PTB15_TRGMUX_IN0                        NXP_SIUL2_PINMUX(0, 0, 47, 0, 344, 2)
#define PTB16_TRGMUX_IN1                        NXP_SIUL2_PINMUX(0, 0, 48, 0, 345, 2)
#define PTB17_TRGMUX_IN3                        NXP_SIUL2_PINMUX(0, 0, 49, 0, 347, 2)
#define PTB18_TRGMUX_OUT9                       NXP_SIUL2_PINMUX(0, 0, 50, 7, 0, 0)
#define PTB19_TRGMUX_OUT10                      NXP_SIUL2_PINMUX(0, 0, 51, 7, 0, 0)
#define PTB20_TRGMUX_OUT11                      NXP_SIUL2_PINMUX(0, 0, 52, 7, 0, 0)
#define PTB21_TRGMUX_OUT12                      NXP_SIUL2_PINMUX(0, 0, 53, 7, 0, 0)
#define PTB22_TRGMUX_OUT13                      NXP_SIUL2_PINMUX(0, 0, 54, 7, 0, 0)
#define PTB23_TRGMUX_OUT14                      NXP_SIUL2_PINMUX(0, 0, 55, 7, 0, 0)
#define PTC11_TRGMUX_IN5                        NXP_SIUL2_PINMUX(0, 0, 75, 0, 349, 2)
#define PTC24_TRGMUX_OUT15                      NXP_SIUL2_PINMUX(0, 0, 88, 7, 0, 0)
#define PTC24_TRGMUX_IN7                        NXP_SIUL2_PINMUX(0, 0, 88, 0, 351, 2)
#define PTC25_TRGMUX_IN6                        NXP_SIUL2_PINMUX(0, 0, 89, 0, 350, 2)
#define PTC26_TRGMUX_IN4                        NXP_SIUL2_PINMUX(0, 0, 90, 0, 348, 2)
#define PTD0_TRGMUX_OUT1                        NXP_SIUL2_PINMUX(0, 0, 96, 7, 0, 0)
#define PTD1_TRGMUX_OUT2                        NXP_SIUL2_PINMUX(0, 0, 97, 7, 0, 0)
#define PTD2_TRGMUX_IN5                         NXP_SIUL2_PINMUX(0, 0, 98, 0, 349, 1)
#define PTD3_TRGMUX_IN4                         NXP_SIUL2_PINMUX(0, 0, 99, 0, 348, 1)
#define PTD5_TRGMUX_OUT15                       NXP_SIUL2_PINMUX(0, 0, 101, 10, 0, 0)
#define PTD5_TRGMUX_IN7                         NXP_SIUL2_PINMUX(0, 0, 101, 0, 351, 1)
#define PTD20_TRGMUX_IN2                        NXP_SIUL2_PINMUX(0, 0, 116, 0, 346, 2)
#define PTE5_TRGMUX_OUT0                        NXP_SIUL2_PINMUX(0, 0, 133, 8, 0, 0)
#define PTE10_TRGMUX_OUT4                       NXP_SIUL2_PINMUX(0, 0, 138, 7, 0, 0)
#define PTE11_TRGMUX_OUT5                       NXP_SIUL2_PINMUX(0, 0, 139, 7, 0, 0)
#define PTE15_TRGMUX_OUT6                       NXP_SIUL2_PINMUX(0, 0, 143, 7, 0, 0)
#define PTE16_TRGMUX_OUT7                       NXP_SIUL2_PINMUX(0, 0, 144, 7, 0, 0)
#define PTF31_TRGMUX_IN6                        NXP_SIUL2_PINMUX(0, 0, 191, 0, 350, 3)

