zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* CAN1 */
#define PTA22_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 22, 0, 1, 3)
#define PTA23_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 23, 1, 0, 0)
#define PTB22_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 54, 1, 0, 0)
#define PTB23_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 55, 0, 1, 4)
#define PTC8_CAN1_TX                            NXP_SIUL2_PINMUX(0, 0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                            NXP_SIUL2_PINMUX(0, 0, 73, 0, 1, 1)
#define PTC24_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 88, 8, 0, 0)
#define PTC25_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 89, 0, 1, 6)
#define PTD30_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 126, 8, 0, 0)
#define PTD31_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 127, 0, 1, 7)
#define PTF14_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 174, 1, 0, 0)
#define PTF15_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 175, 0, 1, 5)
#define PTG26_CAN1_TX_O                         NXP_SIUL2_PINMUX(0, 0, 218, 8, 0, 0)
#define PTG27_CAN1_RX_I                         NXP_SIUL2_PINMUX(0, 0, 219, 0, 1, 8)
#define PTG26_CAN1_TX_O                         NXP_SIUL2_PINMUX(0, 0, 218, 8, 0, 0)
#define PTG27_CAN1_RX_I                         NXP_SIUL2_PINMUX(0, 0, 219, 0, 1, 8)

/* LPI2C0 */
#define PTA23_LPI2C0_SCLS_O                     NXP_SIUL2_PINMUX(0, 0, 23, 9, 0, 0)
#define PTA23_LPI2C0_SCLS_I                     NXP_SIUL2_PINMUX(0, 0, 23, 0, 213, 2)
#define PTB0_LPI2C0_SDAS_O                      NXP_SIUL2_PINMUX(0, 0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I                      NXP_SIUL2_PINMUX(0, 0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O                      NXP_SIUL2_PINMUX(0, 0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I                      NXP_SIUL2_PINMUX(0, 0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ                       NXP_SIUL2_PINMUX(0, 0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                        NXP_SIUL2_PINMUX(0, 0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O                       NXP_SIUL2_PINMUX(0, 0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I                       NXP_SIUL2_PINMUX(0, 0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O                       NXP_SIUL2_PINMUX(0, 0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I                       NXP_SIUL2_PINMUX(0, 0, 73, 0, 214, 1)
#define PTC27_LPI2C0_HREQ                       NXP_SIUL2_PINMUX(0, 0, 91, 0, 211, 3)
#define PTD13_LPI2C0_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 110, 0, 212, 2)
#define PTE28_LPI2C0_SDAS_O                     NXP_SIUL2_PINMUX(0, 0, 156, 11, 0, 0)
#define PTE28_LPI2C0_SDAS_I                     NXP_SIUL2_PINMUX(0, 0, 156, 0, 215, 2)
#define PTF20_LPI2C0_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 180, 4, 0, 0)
#define PTF20_LPI2C0_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 180, 0, 212, 3)
#define PTF21_LPI2C0_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 181, 4, 0, 0)
#define PTF21_LPI2C0_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 181, 0, 214, 3)
#define PTF29_LPI2C0_HREQ                       NXP_SIUL2_PINMUX(0, 0, 189, 0, 211, 4)
#define PTG8_LPI2C0_SCL_O                       NXP_SIUL2_PINMUX(0, 0, 200, 9, 0, 0)
#define PTG8_LPI2C0_SCL_I                       NXP_SIUL2_PINMUX(0, 0, 200, 0, 212, 4)
#define PTG13_LPI2C0_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 205, 9, 0, 0)
#define PTG13_LPI2C0_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 205, 0, 214, 4)

/* EMAC */
#define PTA26_EMAC_PPS0_O                       NXP_SIUL2_PINMUX(0, 0, 26, 7, 0, 0)
#define PTA26_EMAC_PPS0_I                       NXP_SIUL2_PINMUX(0, 0, 26, 0, 144, 3)
#define PTA29_EMAC_PPS2_O                       NXP_SIUL2_PINMUX(0, 0, 29, 3, 0, 0)
#define PTA29_EMAC_MII_RMII_MDIO_O              NXP_SIUL2_PINMUX(0, 0, 29, 9, 0, 0)
#define PTA29_EMAC_PPS2_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 146, 3)
#define PTA29_EMAC_MII_RMII_MDIO_I              NXP_SIUL2_PINMUX(0, 0, 29, 0, 291, 3)
#define PTA31_EMAC_PPS0_O                       NXP_SIUL2_PINMUX(0, 0, 31, 1, 0, 0)
#define PTA31_EMAC_PPS0_I                       NXP_SIUL2_PINMUX(0, 0, 31, 0, 144, 5)
#define PTB3_EMAC_MII_TXD3                      NXP_SIUL2_PINMUX(0, 0, 35, 8, 0, 0)
#define PTB3_EMAC_MII_RMII_TX_CLK               NXP_SIUL2_PINMUX(0, 0, 35, 0, 296, 5)
#define PTB4_EMAC_MII_RMII_TXD1                 NXP_SIUL2_PINMUX(0, 0, 36, 1, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_O               NXP_SIUL2_PINMUX(0, 0, 36, 5, 0, 0)
#define PTB4_EMAC_MII_RMII_MDIO_I               NXP_SIUL2_PINMUX(0, 0, 36, 0, 291, 1)
#define PTB5_EMAC_MII_RMII_TXD0                 NXP_SIUL2_PINMUX(0, 0, 37, 1, 0, 0)
#define PTB5_EMAC_MII_RMII_MDC                  NXP_SIUL2_PINMUX(0, 0, 37, 7, 0, 0)
#define PTB18_EMAC_MII_RMII_RX_DV_RGMII_RXCTL   NXP_SIUL2_PINMUX(0, 0, 50, 0, 292, 4)
#define PTB19_EMAC_PPS0_O                       NXP_SIUL2_PINMUX(0, 0, 51, 1, 0, 0)
#define PTB19_EMAC_MII_RMII_TX_EN               NXP_SIUL2_PINMUX(0, 0, 51, 4, 0, 0)
#define PTB19_EMAC_PPS0_I                       NXP_SIUL2_PINMUX(0, 0, 51, 0, 144, 4)
#define PTB22_EMAC_MII_CRS                      NXP_SIUL2_PINMUX(0, 0, 54, 0, 290, 1)
#define PTB23_EMAC_MII_COL                      NXP_SIUL2_PINMUX(0, 0, 55, 0, 289, 1)
#define PTB23_EMAC_MII_RMII_RXD0                NXP_SIUL2_PINMUX(0, 0, 55, 0, 294, 5)
#define PTB23_EMAC_MII_RMII_RXD1                NXP_SIUL2_PINMUX(0, 0, 55, 0, 295, 5)
#define PTB23_EMAC_MII_RXD2                     NXP_SIUL2_PINMUX(0, 0, 55, 0, 301, 5)
#define PTB24_EMAC_MII_RMII_RXD1                NXP_SIUL2_PINMUX(0, 0, 56, 0, 295, 4)
#define PTB24_EMAC_MII_RXD2                     NXP_SIUL2_PINMUX(0, 0, 56, 0, 301, 4)
#define PTB24_EMAC_MII_RXD3                     NXP_SIUL2_PINMUX(0, 0, 56, 0, 302, 3)
#define PTB25_EMAC_MII_COL                      NXP_SIUL2_PINMUX(0, 0, 57, 0, 289, 3)
#define PTB25_EMAC_MII_RMII_RX_ER               NXP_SIUL2_PINMUX(0, 0, 57, 0, 293, 3)
#define PTB26_EMAC_MII_RX_CLK                   NXP_SIUL2_PINMUX(0, 0, 58, 0, 300, 5)
#define PTB27_EMAC_MII_COL                      NXP_SIUL2_PINMUX(0, 0, 59, 0, 289, 4)
#define PTB27_EMAC_MII_CRS                      NXP_SIUL2_PINMUX(0, 0, 59, 0, 290, 3)
#define PTB28_EMAC_MII_TXD2                     NXP_SIUL2_PINMUX(0, 0, 60, 2, 0, 0)
#define PTB28_EMAC_PPS3_O                       NXP_SIUL2_PINMUX(0, 0, 60, 7, 0, 0)
#define PTB28_EMAC_MII_TXD3                     NXP_SIUL2_PINMUX(0, 0, 60, 8, 0, 0)
#define PTB28_EMAC_PPS3_I                       NXP_SIUL2_PINMUX(0, 0, 60, 0, 147, 2)
#define PTB29_EMAC_MII_RMII_TXD0                NXP_SIUL2_PINMUX(0, 0, 61, 2, 0, 0)
#define PTB29_EMAC_MII_RMII_TXD1                NXP_SIUL2_PINMUX(0, 0, 61, 8, 0, 0)
#define PTB29_EMAC_MII_TXD2                     NXP_SIUL2_PINMUX(0, 0, 61, 9, 0, 0)
#define PTC0_EMAC_MII_RMII_TX_CLK_O             NXP_SIUL2_PINMUX(0, 0, 64, 7, 0, 0)
#define PTC0_EMAC_MII_RMII_RXD0                 NXP_SIUL2_PINMUX(0, 0, 64, 0, 294, 2)
#define PTC0_EMAC_MII_RMII_RXD1                 NXP_SIUL2_PINMUX(0, 0, 64, 0, 295, 1)
#define PTC0_EMAC_MII_RMII_TX_CLK_I             NXP_SIUL2_PINMUX(0, 0, 64, 0, 296, 4)
#define PTC0_EMAC_MII_RX_CLK                    NXP_SIUL2_PINMUX(0, 0, 64, 0, 300, 4)
#define PTC1_EMAC_MII_RMII_RXD0                 NXP_SIUL2_PINMUX(0, 0, 65, 0, 294, 1)
#define PTC1_EMAC_MII_RMII_RXD1                 NXP_SIUL2_PINMUX(0, 0, 65, 0, 295, 2)
#define PTC1_EMAC_MII_RX_CLK                    NXP_SIUL2_PINMUX(0, 0, 65, 0, 300, 3)
#define PTC2_EMAC_MII_RMII_TXD1                 NXP_SIUL2_PINMUX(0, 0, 66, 1, 0, 0)
#define PTC2_EMAC_MII_RMII_TXD0                 NXP_SIUL2_PINMUX(0, 0, 66, 5, 0, 0)
#define PTC12_EMAC_MII_CRS                      NXP_SIUL2_PINMUX(0, 0, 76, 0, 290, 4)
#define PTC12_EMAC_MII_RMII_RX_ER               NXP_SIUL2_PINMUX(0, 0, 76, 0, 293, 4)
#define PTC13_EMAC_MII_COL                      NXP_SIUL2_PINMUX(0, 0, 77, 0, 289, 5)
#define PTC13_EMAC_MII_RMII_RX_DV_RGMII_RXCTL   NXP_SIUL2_PINMUX(0, 0, 77, 0, 292, 5)
#define PTC14_EMAC_MII_COL                      NXP_SIUL2_PINMUX(0, 0, 78, 0, 289, 2)
#define PTC14_EMAC_MII_RMII_RX_ER               NXP_SIUL2_PINMUX(0, 0, 78, 0, 293, 2)
#define PTC14_EMAC_MII_RMII_RXD0                NXP_SIUL2_PINMUX(0, 0, 78, 0, 294, 4)
#define PTC14_EMAC_MII_RXD2                     NXP_SIUL2_PINMUX(0, 0, 78, 0, 301, 3)
#define PTC14_EMAC_MII_RXD3                     NXP_SIUL2_PINMUX(0, 0, 78, 0, 302, 2)
#define PTC15_EMAC_MII_CRS                      NXP_SIUL2_PINMUX(0, 0, 79, 0, 290, 2)
#define PTC15_EMAC_MII_RMII_RX_DV_RGMII_RXCTL   NXP_SIUL2_PINMUX(0, 0, 79, 0, 292, 2)
#define PTC15_EMAC_MII_RMII_RXD0                NXP_SIUL2_PINMUX(0, 0, 79, 0, 294, 6)
#define PTC15_EMAC_MII_RMII_RXD1                NXP_SIUL2_PINMUX(0, 0, 79, 0, 295, 6)
#define PTC15_EMAC_MII_RXD2                     NXP_SIUL2_PINMUX(0, 0, 79, 0, 301, 2)
#define PTC15_EMAC_MII_RXD3                     NXP_SIUL2_PINMUX(0, 0, 79, 0, 302, 4)
#define PTC16_EMAC_MII_RMII_RX_ER               NXP_SIUL2_PINMUX(0, 0, 80, 0, 293, 1)
#define PTC16_EMAC_MII_RX_CLK                   NXP_SIUL2_PINMUX(0, 0, 80, 0, 300, 6)
#define PTC17_EMAC_MII_RMII_RX_DV_RGMII_RXCTL_O NXP_SIUL2_PINMUX(0, 0, 81, 5, 0, 0)
#define PTC17_EMAC_MII_RMII_RX_DV_RGMII_RXCTL_I NXP_SIUL2_PINMUX(0, 0, 81, 0, 292, 1)
#define PTC18_EMAC_MII_RMII_TXD0                NXP_SIUL2_PINMUX(0, 0, 82, 1, 0, 0)
#define PTC18_EMAC_MII_RMII_TXD1                NXP_SIUL2_PINMUX(0, 0, 82, 5, 0, 0)
#define PTC18_EMAC_MII_TXD2                     NXP_SIUL2_PINMUX(0, 0, 82, 8, 0, 0)
#define PTC19_EMAC_MII_RMII_TXD0                NXP_SIUL2_PINMUX(0, 0, 83, 9, 0, 0)
#define PTC19_EMAC_MII_RMII_TX_CLK              NXP_SIUL2_PINMUX(0, 0, 83, 0, 296, 6)
#define PTC20_EMAC_PPS0_O                       NXP_SIUL2_PINMUX(0, 0, 84, 7, 0, 0)
#define PTC20_EMAC_PPS0_I                       NXP_SIUL2_PINMUX(0, 0, 84, 0, 144, 6)
#define PTC21_EMAC_PPS1_O                       NXP_SIUL2_PINMUX(0, 0, 85, 1, 0, 0)
#define PTC21_EMAC_PPS1_I                       NXP_SIUL2_PINMUX(0, 0, 85, 0, 145, 4)
#define PTD5_EMAC_MII_TXD2                      NXP_SIUL2_PINMUX(0, 0, 101, 1, 0, 0)
#define PTD5_EMAC_MII_TXD3                      NXP_SIUL2_PINMUX(0, 0, 101, 5, 0, 0)
#define PTD5_EMAC_MII_RX_CLK                    NXP_SIUL2_PINMUX(0, 0, 101, 0, 300, 2)
#define PTD6_EMAC_MII_TXD3                      NXP_SIUL2_PINMUX(0, 0, 102, 1, 0, 0)
#define PTD6_EMAC_MII_RMII_TX_CLK_O             NXP_SIUL2_PINMUX(0, 0, 102, 4, 0, 0)
#define PTD6_EMAC_MII_TXD2                      NXP_SIUL2_PINMUX(0, 0, 102, 5, 0, 0)
#define PTD6_EMAC_MII_RMII_TX_CLK_I             NXP_SIUL2_PINMUX(0, 0, 102, 0, 296, 2)
#define PTD7_EMAC_MII_RMII_TXD0                 NXP_SIUL2_PINMUX(0, 0, 103, 1, 0, 0)
#define PTD7_EMAC_MII_RMII_TXD1                 NXP_SIUL2_PINMUX(0, 0, 103, 5, 0, 0)
#define PTD8_EMAC_MII_RMII_RXD1                 NXP_SIUL2_PINMUX(0, 0, 104, 0, 295, 3)
#define PTD8_EMAC_MII_RXD3                      NXP_SIUL2_PINMUX(0, 0, 104, 0, 302, 1)
#define PTD9_EMAC_MII_RMII_RXD0                 NXP_SIUL2_PINMUX(0, 0, 105, 0, 294, 3)
#define PTD9_EMAC_MII_RXD2                      NXP_SIUL2_PINMUX(0, 0, 105, 0, 301, 1)
#define PTD10_EMAC_MII_TXD3                     NXP_SIUL2_PINMUX(0, 0, 106, 1, 0, 0)
#define PTD10_EMAC_MII_RX_CLK                   NXP_SIUL2_PINMUX(0, 0, 106, 0, 300, 1)
#define PTD11_EMAC_MII_TXD2                     NXP_SIUL2_PINMUX(0, 0, 107, 1, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_EN               NXP_SIUL2_PINMUX(0, 0, 107, 3, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_CLK_O            NXP_SIUL2_PINMUX(0, 0, 107, 5, 0, 0)
#define PTD11_EMAC_MII_RMII_TX_CLK_I            NXP_SIUL2_PINMUX(0, 0, 107, 0, 296, 1)
#define PTD12_EMAC_MII_RMII_TX_CLK_O            NXP_SIUL2_PINMUX(0, 0, 108, 1, 0, 0)
#define PTD12_EMAC_MII_RMII_TX_EN               NXP_SIUL2_PINMUX(0, 0, 108, 5, 0, 0)
#define PTD12_EMAC_MII_RMII_TX_CLK_I            NXP_SIUL2_PINMUX(0, 0, 108, 0, 296, 3)
#define PTD13_EMAC_PPS1_O                       NXP_SIUL2_PINMUX(0, 0, 109, 5, 0, 0)
#define PTD13_EMAC_PPS1_I                       NXP_SIUL2_PINMUX(0, 0, 109, 0, 145, 2)
#define PTD14_EMAC_PPS0_O                       NXP_SIUL2_PINMUX(0, 0, 110, 5, 0, 0)
#define PTD14_EMAC_PPS0_I                       NXP_SIUL2_PINMUX(0, 0, 110, 0, 144, 2)
#define PTD14_EMAC_MII_RMII_RX_DV_RGMII_RXCTL   NXP_SIUL2_PINMUX(0, 0, 110, 0, 292, 3)
#define PTD15_EMAC_PPS2_O                       NXP_SIUL2_PINMUX(0, 0, 111, 5, 0, 0)
#define PTD15_EMAC_PPS2_I                       NXP_SIUL2_PINMUX(0, 0, 111, 0, 146, 2)
#define PTD16_EMAC_MII_RMII_MDIO_O              NXP_SIUL2_PINMUX(0, 0, 112, 3, 0, 0)
#define PTD16_EMAC_MII_RMII_MDIO_I              NXP_SIUL2_PINMUX(0, 0, 112, 0, 291, 2)
#define PTD17_EMAC_MII_RMII_MDC                 NXP_SIUL2_PINMUX(0, 0, 113, 3, 0, 0)
#define PTD17_EMAC_PPS2_O                       NXP_SIUL2_PINMUX(0, 0, 113, 7, 0, 0)
#define PTD17_EMAC_PPS2_I                       NXP_SIUL2_PINMUX(0, 0, 113, 0, 146, 1)
#define PTE8_EMAC_MII_RMII_MDC                  NXP_SIUL2_PINMUX(0, 0, 136, 5, 0, 0)
#define PTE9_EMAC_PPS3_O                        NXP_SIUL2_PINMUX(0, 0, 137, 5, 0, 0)
#define PTE9_EMAC_MII_RMII_TX_EN                NXP_SIUL2_PINMUX(0, 0, 137, 6, 0, 0)
#define PTE9_EMAC_PPS3_I                        NXP_SIUL2_PINMUX(0, 0, 137, 0, 147, 1)
#define PTE14_EMAC_PPS1_O                       NXP_SIUL2_PINMUX(0, 0, 142, 7, 0, 0)
#define PTE14_EMAC_PPS1_I                       NXP_SIUL2_PINMUX(0, 0, 142, 0, 145, 1)
#define PTF31_EMAC_MII_RMII_TX_EN               NXP_SIUL2_PINMUX(0, 0, 191, 9, 0, 0)

/* ZIPWIRE0 */
#define PTA29_LFAST_0_EXT_REF_O                 NXP_SIUL2_PINMUX(0, 0, 29, 8, 0, 0)
#define PTA29_LFAST_0_EXT_REF_I                 NXP_SIUL2_PINMUX(0, 0, 29, 0, 441, 1)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0               NXP_SIUL2_PINMUX(0, 0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0                  NXP_SIUL2_PINMUX(0, 0, 33, 0, 343, 1)
#define PTD23_HSE_TAMPER_LOOP_OUT0              NXP_SIUL2_PINMUX(0, 0, 119, 5, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0                 NXP_SIUL2_PINMUX(0, 0, 120, 0, 343, 2)
#define PTF11_HSE_TAMPER_EXTIN0                 NXP_SIUL2_PINMUX(0, 0, 171, 0, 343, 4)
#define PTF19_HSE_TAMPER_LOOP_OUT0              NXP_SIUL2_PINMUX(0, 0, 179, 6, 0, 0)

/* MSC0 */
#define PTB0_DSPI_MSC0_PCS0                     NXP_SIUL2_PINMUX(0, 0, 32, 11, 0, 0)
#define PTB1_DSPI_MSC0_SCK                      NXP_SIUL2_PINMUX(0, 0, 33, 13, 0, 0)
#define PTB2_LPUART_MSC0_RX                     NXP_SIUL2_PINMUX(0, 0, 34, 0, 438, 1)
#define PTB13_LPUART_MSC0_RX                    NXP_SIUL2_PINMUX(0, 0, 45, 0, 438, 4)
#define PTB14_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 46, 15, 0, 0)
#define PTC9_LPUART_MSC0_RX                     NXP_SIUL2_PINMUX(0, 0, 73, 0, 438, 3)
#define PTC10_DSPI_MSC0_SIN                     NXP_SIUL2_PINMUX(0, 0, 74, 0, 403, 1)
#define PTC27_DSPI_MSC0_SOUT                    NXP_SIUL2_PINMUX(0, 0, 91, 11, 0, 0)
#define PTC28_DSPI_MSC0_PCS1                    NXP_SIUL2_PINMUX(0, 0, 92, 11, 0, 0)
#define PTD18_DSPI_MSC0_SCK                     NXP_SIUL2_PINMUX(0, 0, 114, 12, 0, 0)
#define PTD19_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 115, 15, 0, 0)
#define PTD21_DSPI_MSC0_PCS1                    NXP_SIUL2_PINMUX(0, 0, 117, 15, 0, 0)
#define PTF14_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 174, 13, 0, 0)
#define PTF15_DSPI_MSC0_PCS1                    NXP_SIUL2_PINMUX(0, 0, 175, 13, 0, 0)
#define PTF16_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 176, 12, 0, 0)
#define PTF18_DSPI_MSC0_PCS1                    NXP_SIUL2_PINMUX(0, 0, 178, 12, 0, 0)
#define PTF20_DSPI_MSC0_SIN                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 403, 2)
#define PTF21_DSPI_MSC0_SOUT                    NXP_SIUL2_PINMUX(0, 0, 181, 12, 0, 0)
#define PTF23_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 183, 13, 0, 0)
#define PTF25_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 185, 8, 0, 0)
#define PTF26_LPUART_MSC0_RX                    NXP_SIUL2_PINMUX(0, 0, 186, 0, 438, 2)
#define PTF27_DSPI_MSC0_PCS0                    NXP_SIUL2_PINMUX(0, 0, 187, 8, 0, 0)

/* ADC1 */
#define PTB2_ADC1_MA0                           NXP_SIUL2_PINMUX(0, 0, 34, 1, 0, 0)
#define PTB23_ADC1_MA0                          NXP_SIUL2_PINMUX(0, 0, 55, 1, 0, 0)
#define PTB24_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 56, 1, 0, 0)
#define PTB28_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 60, 1, 0, 0)
#define PTC12_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 77, 4, 0, 0)
#define PTC20_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 84, 5, 0, 0)
#define PTC21_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 85, 5, 0, 0)
#define PTC23_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 87, 8, 0, 0)
#define PTC26_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 90, 9, 0, 0)
#define PTC27_ADC1_MA0                          NXP_SIUL2_PINMUX(0, 0, 91, 5, 0, 0)
#define PTF16_ADC1_MA0                          NXP_SIUL2_PINMUX(0, 0, 176, 4, 0, 0)
#define PTF17_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 177, 4, 0, 0)
#define PTF18_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 178, 4, 0, 0)
#define PTF29_ADC1_MA0                          NXP_SIUL2_PINMUX(0, 0, 189, 4, 0, 0)
#define PTF30_ADC1_MA1                          NXP_SIUL2_PINMUX(0, 0, 190, 4, 0, 0)
#define PTF31_ADC1_MA2                          NXP_SIUL2_PINMUX(0, 0, 191, 1, 0, 0)

/* CAN4 */
#define PTB2_CAN4_RX                            NXP_SIUL2_PINMUX(0, 0, 34, 0, 4, 2)
#define PTB3_CAN4_TX                            NXP_SIUL2_PINMUX(0, 0, 35, 5, 0, 0)
#define PTB29_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 61, 0, 4, 6)
#define PTC30_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 94, 1, 0, 0)
#define PTC31_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 95, 0, 4, 3)
#define PTD14_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 110, 8, 0, 0)
#define PTE14_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 142, 0, 4, 1)
#define PTE30_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 158, 1, 0, 0)
#define PTE31_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 159, 0, 4, 4)
#define PTG8_CAN4_TX                            NXP_SIUL2_PINMUX(0, 0, 200, 1, 0, 0)
#define PTG9_CAN4_RX                            NXP_SIUL2_PINMUX(0, 0, 201, 0, 4, 5)

/* QUADSPI */
#define PTB2_QUADSPI_INTA                       NXP_SIUL2_PINMUX(0, 0, 34, 0, 437, 5)
#define PTB20_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 52, 0, 437, 1)
#define PTB26_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 58, 0, 437, 8)
#define PTB27_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 59, 0, 437, 2)
#define PTC0_QUADSPI_IOFA4_O                    NXP_SIUL2_PINMUX(0, 0, 64, 4, 0, 0)
#define PTC0_QUADSPI_IOFA4_I                    NXP_SIUL2_PINMUX(0, 0, 64, 0, 419, 1)
#define PTC1_QUADSPI_DQSFA_O                    NXP_SIUL2_PINMUX(0, 0, 65, 3, 0, 0)
#define PTC1_QUADSPI_DQSFA_I                    NXP_SIUL2_PINMUX(0, 0, 65, 0, 423, 1)
#define PTC2_QUADSPI_IOFA3_O                    NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PTC2_QUADSPI_IOFA3_I                    NXP_SIUL2_PINMUX(0, 0, 66, 0, 308, 1)
#define PTC3_QUADSPI_PCSFA                      NXP_SIUL2_PINMUX(0, 0, 67, 6, 0, 0)
#define PTC13_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 77, 0, 437, 3)
#define PTC17_QUADSPI_IOFA7_O                   NXP_SIUL2_PINMUX(0, 0, 81, 8, 0, 0)
#define PTC17_QUADSPI_IOFA7_I                   NXP_SIUL2_PINMUX(0, 0, 81, 0, 422, 1)
#define PTC20_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 84, 0, 437, 6)
#define PTC23_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 87, 0, 437, 7)
#define PTD7_QUADSPI_IOFA1_O                    NXP_SIUL2_PINMUX(0, 0, 103, 7, 0, 0)
#define PTD7_QUADSPI_IOFA1_I                    NXP_SIUL2_PINMUX(0, 0, 103, 0, 306, 1)
#define PTD8_QUADSPI_IOFA6_O                    NXP_SIUL2_PINMUX(0, 0, 104, 8, 0, 0)
#define PTD8_QUADSPI_IOFA6_I                    NXP_SIUL2_PINMUX(0, 0, 104, 0, 421, 1)
#define PTD9_QUADSPI_IOFA5_O                    NXP_SIUL2_PINMUX(0, 0, 105, 8, 0, 0)
#define PTD9_QUADSPI_IOFA5_I                    NXP_SIUL2_PINMUX(0, 0, 105, 0, 420, 1)
#define PTD10_QUADSPI_SCKFA_O                   NXP_SIUL2_PINMUX(0, 0, 106, 7, 0, 0)
#define PTD10_QUADSPI_SCKFA_I                   NXP_SIUL2_PINMUX(0, 0, 106, 0, 309, 1)
#define PTD11_QUADSPI_IOFA0_O                   NXP_SIUL2_PINMUX(0, 0, 107, 7, 0, 0)
#define PTD11_QUADSPI_IOFA0_I                   NXP_SIUL2_PINMUX(0, 0, 107, 0, 305, 1)
#define PTD12_QUADSPI_IOFA2_O                   NXP_SIUL2_PINMUX(0, 0, 108, 7, 0, 0)
#define PTD12_QUADSPI_IOFA2_I                   NXP_SIUL2_PINMUX(0, 0, 108, 0, 307, 1)
#define PTD14_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 110, 0, 437, 9)

/* ADC0 */
#define PTB3_ADC0_MA0                           NXP_SIUL2_PINMUX(0, 0, 35, 4, 0, 0)
#define PTC8_ADC0_MA1                           NXP_SIUL2_PINMUX(0, 0, 72, 11, 0, 0)
#define PTC14_ADC0_MA1                          NXP_SIUL2_PINMUX(0, 0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                          NXP_SIUL2_PINMUX(0, 0, 79, 4, 0, 0)
#define PTC25_ADC0_MA2                          NXP_SIUL2_PINMUX(0, 0, 89, 10, 0, 0)
#define PTE7_ADC0_MA0                           NXP_SIUL2_PINMUX(0, 0, 135, 10, 0, 0)
#define PTF9_ADC0_MA0                           NXP_SIUL2_PINMUX(0, 0, 169, 3, 0, 0)
#define PTF10_ADC0_MA1                          NXP_SIUL2_PINMUX(0, 0, 170, 3, 0, 0)
#define PTF11_ADC0_MA2                          NXP_SIUL2_PINMUX(0, 0, 171, 3, 0, 0)
#define PTF12_ADC0_MA0                          NXP_SIUL2_PINMUX(0, 0, 172, 3, 0, 0)
#define PTF13_ADC0_MA1                          NXP_SIUL2_PINMUX(0, 0, 173, 3, 0, 0)
#define PTF19_ADC0_MA2                          NXP_SIUL2_PINMUX(0, 0, 179, 4, 0, 0)

/* CAN3 */
#define PTC0_CAN3_TX                            NXP_SIUL2_PINMUX(0, 0, 64, 1, 0, 0)
#define PTC1_CAN3_RX                            NXP_SIUL2_PINMUX(0, 0, 65, 0, 3, 2)
#define PTC28_CAN3_TX                           NXP_SIUL2_PINMUX(0, 0, 92, 1, 0, 0)
#define PTC29_CAN3_RX                           NXP_SIUL2_PINMUX(0, 0, 93, 0, 3, 3)
#define PTD15_CAN3_RX                           NXP_SIUL2_PINMUX(0, 0, 111, 0, 3, 1)
#define PTE9_CAN3_TX                            NXP_SIUL2_PINMUX(0, 0, 137, 4, 0, 0)
#define PTE28_CAN3_TX                           NXP_SIUL2_PINMUX(0, 0, 156, 1, 0, 0)
#define PTE29_CAN3_RX                           NXP_SIUL2_PINMUX(0, 0, 157, 0, 3, 4)
#define PTF29_CAN3_TX                           NXP_SIUL2_PINMUX(0, 0, 189, 1, 0, 0)
#define PTF30_CAN3_RX                           NXP_SIUL2_PINMUX(0, 0, 190, 0, 3, 5)

