zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K396_289BGA-pinctrl.h
/* LPI2C1 */
#define PTC5_LPI2C1_HREQ                        NXP_SIUL2_PINMUX(0, 0, 69, 0, 216, 2)
#define PTC7_LPI2C1_SCL                         NXP_SIUL2_PINMUX(0, 0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O                     NXP_SIUL2_PINMUX(0, 0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I                     NXP_SIUL2_PINMUX(0, 0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O                     NXP_SIUL2_PINMUX(0, 0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I                     NXP_SIUL2_PINMUX(0, 0, 81, 0, 218, 2)
#define PTC28_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 92, 5, 0, 0)
#define PTC28_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 92, 0, 217, 4)
#define PTC29_LPI2C1_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 93, 5, 0, 0)
#define PTC29_LPI2C1_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 93, 0, 219, 3)
#define PTD8_LPI2C1_SDA_O                       NXP_SIUL2_PINMUX(0, 0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I                       NXP_SIUL2_PINMUX(0, 0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O                       NXP_SIUL2_PINMUX(0, 0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I                       NXP_SIUL2_PINMUX(0, 0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ                       NXP_SIUL2_PINMUX(0, 0, 108, 0, 216, 1)
#define PTF6_LPI2C1_SDA_O                       NXP_SIUL2_PINMUX(0, 0, 166, 8, 0, 0)
#define PTF6_LPI2C1_SDA_I                       NXP_SIUL2_PINMUX(0, 0, 166, 0, 219, 6)
#define PTF7_LPI2C1_SCL_O                       NXP_SIUL2_PINMUX(0, 0, 167, 3, 0, 0)
#define PTF7_LPI2C1_SCL_I                       NXP_SIUL2_PINMUX(0, 0, 167, 0, 217, 5)
#define PTF8_LPI2C1_SDA_O                       NXP_SIUL2_PINMUX(0, 0, 168, 3, 0, 0)
#define PTF8_LPI2C1_SDA_I                       NXP_SIUL2_PINMUX(0, 0, 168, 0, 219, 4)
#define PTF29_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 189, 10, 0, 0)
#define PTF29_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 189, 0, 217, 7)

/* CAN2 */
#define PTC6_CAN2_RX                            NXP_SIUL2_PINMUX(0, 0, 70, 0, 2, 6)
#define PTC14_CAN2_RX                           NXP_SIUL2_PINMUX(0, 0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                           NXP_SIUL2_PINMUX(0, 0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                           NXP_SIUL2_PINMUX(0, 0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                           NXP_SIUL2_PINMUX(0, 0, 81, 3, 0, 0)
#define PTD18_CAN2_TX                           NXP_SIUL2_PINMUX(0, 0, 114, 1, 0, 0)
#define PTD19_CAN2_RX                           NXP_SIUL2_PINMUX(0, 0, 115, 0, 2, 4)
#define PTF8_CAN2_TX                            NXP_SIUL2_PINMUX(0, 0, 168, 8, 0, 0)
#define PTF25_CAN2_TX                           NXP_SIUL2_PINMUX(0, 0, 185, 1, 0, 0)
#define PTF26_CAN2_RX                           NXP_SIUL2_PINMUX(0, 0, 186, 0, 2, 5)

/* CAN5 */
#define PTC10_CAN5_TX                           NXP_SIUL2_PINMUX(0, 0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                           NXP_SIUL2_PINMUX(0, 0, 75, 0, 5, 2)
#define PTC26_CAN5_RX                           NXP_SIUL2_PINMUX(0, 0, 90, 0, 5, 5)
#define PTC27_CAN5_TX                           NXP_SIUL2_PINMUX(0, 0, 91, 1, 0, 0)
#define PTD17_CAN5_RX                           NXP_SIUL2_PINMUX(0, 0, 113, 0, 5, 1)
#define PTF4_CAN5_TX                            NXP_SIUL2_PINMUX(0, 0, 164, 1, 0, 0)
#define PTF5_CAN5_RX                            NXP_SIUL2_PINMUX(0, 0, 165, 0, 5, 3)
#define PTG13_CAN5_TX                           NXP_SIUL2_PINMUX(0, 0, 205, 1, 0, 0)
#define PTG14_CAN5_RX                           NXP_SIUL2_PINMUX(0, 0, 206, 0, 5, 4)

/* SDADC_3 */
#define PTD18_EXT_CLKIN3                        NXP_SIUL2_PINMUX(0, 0, 114, 0, 402, 1)
#define PTD19_EXT_DATA3                         NXP_SIUL2_PINMUX(0, 0, 115, 0, 401, 1)

/* SDADC_0 */
#define PTF14_EXT_CLKIN0                        NXP_SIUL2_PINMUX(0, 0, 174, 0, 396, 1)
#define PTF16_EXT_DATA0                         NXP_SIUL2_PINMUX(0, 0, 176, 0, 395, 1)

/* SDADC_1 */
#define PTF17_EXT_DATA1                         NXP_SIUL2_PINMUX(0, 0, 177, 0, 397, 1)
#define PTF20_EXT_CLKIN1                        NXP_SIUL2_PINMUX(0, 0, 180, 0, 398, 1)

/* SDADC_2 */
#define PTF18_EXT_DATA2                         NXP_SIUL2_PINMUX(0, 0, 178, 0, 399, 1)
#define PTF21_EXT_CLKIN2                        NXP_SIUL2_PINMUX(0, 0, 181, 0, 400, 1)

#endif /* HAL_NXP_DTS_NXP_S32_S32K396_289BGA_PINCTRL_H_ */
